[
  {
    "title": "The best earbuds we’ve tested for 2025",
    "slug": "the-best-earbuds-weve-tested-for-2025",
    "link": "https://www.theverge.com/21309820/best-wireless-earbuds",
    "published": "2025-08-06 20:00",
    "image": "https://images.unsplash.com/photo-1521891737967-520860cf80e4?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsb25nJTIwd2F5JTIwc2luY2V8ZW58MHx8fHwxNzU0NTI1NzEwfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "It’s hard to buy a bad pair of wireless earbuds these days, and with constant discounts and deals wherever you look, now is as good a time as any to splurge on the pair you’ve been eyeing. The market has come a long way since the early era of true wireless earbuds when we had […]",
    "full_text": "Comfort Collapse No matter how they sound, what good are earbuds if you don’t enjoy wearing them? Whether you’re trying to concentrate at the office or rest while traveling, noise cancellation can be a huge help. Sony has also further improved its ANC and is nearing the same territory as Bose’s QC Earbuds II. They’re also capable of multipoint Bluetooth connectivity, so you can pair them with two devices at the same time. They’re also the only AirPods that come with different sizes of ear tips for a customizable fit — including an extra small option. And my favorite thing about these earbuds are the hands-free voice commands that don’t require you to say any specific wake phrase beforehand. And there’s a small nub on the buds to help lock them in place even during intensive activities like running or exercise. Multipoint support is included, and Google’s latest earbuds eke out impressive battery life that surpasses most competitors. Apple’s AirPods 4 come in two different versions, with a higher-priced option that includes active noise cancellation and wireless charging. However, Apple says it used more than 50 million data points to further refine the contours and overall stability of its latest earbuds."
  },
  {
    "title": "Sonos confirms tariffs will increase its prices this year",
    "slug": "sonos-confirms-tariffs-will-increase-its-prices-this-year",
    "link": "https://www.theverge.com/news/739106/sonos-price-hike-tariffs",
    "published": "2025-08-06 19:42",
    "image": "https://images.unsplash.com/photo-1579532582937-16c108930bf6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmaXJzdCUyMHF1YXJ0ZXJseSUyMGVhcm5pbmdzJTIwcmVwb3J0fGVufDB8fHx8MTc1NDUyMzkxMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Tom Conrad took over as CEO of Sonos in January as it continues to recover from last year’s disastrous mobile app update, and now the company has issued its first quarterly earnings report after he dropped the interim tag from his title. Beyond the numbers, with $344.8 million in revenue and a net loss of […]",
    "full_text": "Conrad: With respect to our operations, like many companies, the most significant near-term challenge has been the uncertain tariff environment. As a reminder short of a few accessories, and our passive speaker partnership with Sonance (I think this is what he said?) we do all of our us-bound manufacturing in Vietnam and Malaysia. We talked last quarter about the contingency planning we underwent to minimize the effects of terrorists on our business, while also doing what we can to limit the downstream impact to our customers. Last week’s news, the tariff rates we were subject to going forward, appeared to be 20 percent for Vietnam and 19 percent for Malaysia. We continue to work closely with our contract manufacturers and our Channel Partners to share tariff costs, though it has become clear that we’ll need to raise prices on certain products later this year. As these pricing changes land, we’ll monitor consumer behavior closely as well as competitive Trends across our categories and will make adjustments in collaboration with our Channel Partners, when and if necessary, to ensure we’re exploring every opportunity to optimize our respective top and bottom lines."
  },
  {
    "title": "The best budget robot vacuums",
    "slug": "the-best-budget-robot-vacuums",
    "link": "https://www.theverge.com/23846479/best-budget-robot-vacuum-robot-mop",
    "published": "2025-08-06 18:40",
    "image": "https://images.unsplash.com/photo-1574914629572-4b1d4c05e716?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxtb3AlMjBwYWRzJTIwJTI5JTJDJTIwZGVmdGx5JTIwbmF2aWdhdGUlMjBkb2clMjBwb29wfGVufDB8fHx8MTc1NDUyMDMxMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Today’s robot vacuums are becoming a bit like cars: with all the features, upgrades, and fancy trimmings available these days, it’s easy to forget that they can just be simple machines that get us from point A to point B. Yes, some bots blow hot air on their bums (mop pads), deftly navigate dog poop, […]",
    "full_text": "You can pick up a brand new, two-year-old Roomba or Roborock with mapping and advanced navigation for half its original price. At a minimum, look for 2,500Pa (if the manufacturer lists suction power; some don’t). For around $300, the Tapo RV30 Max Plus is a very capable robot vacuum and mop with some key features usually only found on vacuums that are more than twice its price. It left some of the finer dust and debris, as its single bristle / rubber brush isn’t super effective. You can also set the cleaning direction and build up to four maps — again, features usually only found on higher-end robots. The Roborock S8 is a great vacuum that mops well and has AI-powered obstacle detection—a rarity at this price point. Another great feature at this price is that the S8 has carpet sensing and can raise its mops a few millimeters to avoid dampening your carpets. Most other budget mopping bots require you to remove the mop pads when vacuuming carpet or set keep-out zones around your rugs. The Q5 Pro doesn’t have AI-powered obstacle avoidance, although it will dodge shoes and larger objects. But its big wheels and 120-minute runtime mean it’s less prone to getting stuck or running out of juice than simpler $200 bots."
  },
  {
    "title": "Trump threatens 100 percent tariff on computer chips with a gigantic loophole",
    "slug": "trump-threatens-100-percent-tariff-on-computer-chips-with-a-gigantic-loophole",
    "link": "https://www.theverge.com/news/738172/trump-threatens-100-percent-tariff-on-computer-chips-with-a-gigantic-loophole",
    "published": "2025-08-06 18:25",
    "image": "https://images.unsplash.com/photo-1537901000667-93f516f717b4?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmb3JjZSUyMHNpbGljb24lMjBtYW51ZmFjdHVyaW5nJTIwYmFja3xlbnwwfHx8fDE3NTQ1MTk0MTB8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "In the very first week of his presidency, Donald Trump vowed to force silicon manufacturing back to the United States by making processors more expensive, a threat he’s repeated since. Is he finally going through with that plan? Trump just announced he’ll putting an enormous 100 percent tariff on chips and semiconductors — unless your […]",
    "full_text": "In the very first week of his presidency, Donald Trump vowed to force silicon manufacturing back to the United States by making processors more expensive, a threat he’s repeated since. Trump just announced he’ll putting an enormous 100 percent tariff on chips and semiconductors — unless your company kisses the ring like Apple CEO Tim Cook just did, perhaps. In the same live news conference where Apple announced a new $100 billion US manufacturing plan and presented Trump with a 24-karat gold and glass statue, the president explained that Apple had now done enough to escape his upcoming import taxes on chips: We’re going to be putting a very large tariff on chips and semiconductors, but the good news for companies like Apple is if you’re building in the United States or have committed to build without question in the United States, there will be no charge. You have to pay, and that’s a guarantee. Taiwan’s TSMC, which accounts for the vast majority of leading-edge chips and drew Trump’s ire as a result, announced a $100 billion US investment back in March. Apple isn’t exactly a chipmaker, after all; it does design its own chips but relies on companies like TSMC to actually make them. Trump did not say when new chip tariffs might happen. Trump’s new general reciprocal tariffs on dozens of countries go into effect tomorrow, August 7th. In July, AMD CEO Lisa Su revealed that TSMC’s US-made chips would cost it an extra 5 to 20 percent more than ones made overseas."
  },
  {
    "title": "Apple Commits $100 Billion More Toward US Manufacturing",
    "slug": "apple-commits-100-billion-more-toward-us-manufacturing",
    "link": "https://www.cnet.com/tech/computing/apple-will-commit-100-billion-more-to-us-manufacturing-says-white-house/#ftag=CAD590a51e",
    "published": "2025-08-06 22:23",
    "image": "https://www.cnet.com/a/img/resize/082f6d0316bdacf6547a481f5ab3fc2a0fcd5caf/hub/2025/04/17/066b0651-5ddc-4408-9b8a-4a2283ce1b0a/9t5a4032-3.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "\"Every new iPhone and every new Apple Watch sold in the world will contain cover glass made in Kentucky,\" Cook said.",
    "full_text": "Apple says it's increasing its investment in US production by another $100 billion over the next four years. The company said Wednesday in a wide-ranging announcement that was leaked early by the White House that it will expand to $600 billion total its commitment to hire more US workers and expand some of its manufacturing across 10 states. \"American innovation is central to everything we do,\" Cook said. We support 450,000 jobs with suppliers and partners in all 50 states.\" Trump praised Apple and Cook in particular, calling him a \"visionary\" moments before questioning his athleticism. The president repeated his assertion that there will be 100% tariffs on semiconductors imported from other countries. \"I think the chip companies are all coming back home,\" Trump said. \"If you're building in the United States or committed to build without question, there will be no charge.\" Apple has been shifting the way it produces its products this year in response to the steep tariffs against countries where it manufactures most of its flagship products such as iPhones. Trump said that Apple's supply chains have been in place for while."
  },
  {
    "title": "The 20 Best Nintendo Switch Games Right Now",
    "slug": "the-20-best-nintendo-switch-games-right-now",
    "link": "https://www.cnet.com/tech/gaming/top-best-nintendo-switch-games/#ftag=CAD590a51e",
    "published": "2025-08-06 21:53",
    "image": "https://www.cnet.com/a/img/resize/9c6ebc5788fb786f9a624171de0110cc2e0a6cef/hub/2024/10/03/3247a28f-5479-49c8-8007-e5b7056f36a2/totk-microsite-officialtrailer3-1304xj47am.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The Nintendo Switch's best games include Pokemon, Zelda, Mario and Metroid games, alongside indie hits and multiplayer party games.",
    "full_text": "It's practically the go-to party game, as pretty much anyone can pick up a controller and jump in. That might be a solid roster for another fighting game, but it's almost laughable compared to Super Smash Bros. Just turn on item drops or open the World of Light story mode and everyone will have a good time. New Horizons spices things up by giving you more freedom than ever before to perfect your little island world. Expect a new surprise at every level, especially if you're going in blind (which is what I recommend.) Like the best Mario games, Wonder executes its plethora of fun ideas so well that players will find joy around every corner. Spiritfarer breaks up the afterlife catharsis missions with some casual 2D platforming elements, which keeps things fresh and interesting. Dread allows players to perform melee attacks and aim freely across the screen, creating a more fluid combat system. Since it was released in April of 2017, the game has sold close to 63 million copies worldwide. Picking out the best Nintendo Switch game is subjective and answers will vary according to each gamer's preferences."
  },
  {
    "title": "Verizon Promo Offers NFL Sunday Ticket Access at No Extra Cost",
    "slug": "verizon-promo-offers-nfl-sunday-ticket-access-at-no-extra-cost",
    "link": "https://www.cnet.com/deals/verizon-promo-offers-nfl-sunday-ticket-access-at-no-extra-cost/#ftag=CAD590a51e",
    "published": "2025-08-06 21:50",
    "image": "https://www.cnet.com/a/img/resize/778d4a21d9ea09de8edf94a5f5e2de1fdf211572/hub/2024/12/06/18026b1e-cc26-4cab-9aaa-1f05ee7a8e96/streaming-nfl-football-3292.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The offer is open to new or existing customers.",
    "full_text": "Verizon revived its Sunday Ticket on Us promo on Tuesday, and it will run through Sept. 23, along with an alternative option to get $200 off the sports package for a savings of up to $480. The deal grants football fans access to watch out-of-market Sunday games that aren't broadcast on their local networks. As an added perk, the company is giving out a limited number of free tickets to NFL games. You'll need a Google account to stream live games on the sports package. This promo expires on Sept. 23, and you must redeem it within 60 days of your purchase or service activation. How to get NFL Sunday Ticket for free from Verizon If you buy a 5G phone from Verizon and sign up for a new line on its myPlan service, you can get the deal. Wireless customers can bring their own phone and add a new line with myPlan to be eligible. Existing Verizon phone or home internet customers can still get a discount without switching subscription plans or buying new devices, and returning Sunday Ticket subscribers may also be eligible. Though the offer doesn't apply if you're a Verizon prepaid, business or data-only phone customer, you can sign up for the sports package by Sept. 23 to lock in $200 off the full price."
  },
  {
    "title": "Apple made a 24k gold and glass statue for Donald Trump",
    "slug": "apple-made-a-24k-gold-and-glass-statue-for-donald-trump",
    "link": "https://www.theverge.com/news/737757/apple-president-donald-trump-ceo-tim-cook-glass-corning",
    "published": "2025-08-06 17:48",
    "image": "https://images.unsplash.com/photo-1675721554936-2628b714081e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3aGl0ZSUyMGhvdXNlJTIwcHJlc3MlMjBjb25mZXJlbmNlfGVufDB8fHx8MTc1NDUxODUxNnww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "At a White House press conference to discuss Apple’s new US manufacturing plans, CEO Tim Cook presented a gift to President Donald Trump: a “unique” piece of glass from iPhone glass manufacturer Corning that’s set in a 24-karat gold base. The piece of glass is a large disc with the Apple logo cut into it. […]",
    "full_text": "He joined The Verge in 2019 after nearly two years at Techmeme. Posts from this author will be added to your daily email digest and your homepage feed. At a White House press conference to discuss Apple’s new US manufacturing plans, CEO Tim Cook presented a gift to President Donald Trump: a “unique” piece of glass from iPhone glass manufacturer Corning that’s set in a 24-karat gold base. The piece of glass is a large disc with the Apple logo cut into it. On the top of the glass, President Trump’s name is printed. On the bottom, there’s a signature that appears to be Cook’s as well as the message “Made in USA” and the year 2025. The glass was designed by a “former US Marine Corps corporal” who works at Apple, according to Cook. The base “comes from Utah.” Cook is well known for his ability to foster a relationship with President Trump, and shortly after Trump was elected for his second term, CEOs reportedly looked to replicate Cook’s relationship-building skills. Trump has threatened Apple and other phone manufacturers with tariffs unless they bring manufacturing to the US."
  },
  {
    "title": "Best 4K Projector for 2025: Tested and Reviewed by Experts",
    "slug": "best-4k-projector-for-2025-tested-and-reviewed-by-experts",
    "link": "https://www.cnet.com/tech/home-entertainment/best-4k-projector/#ftag=CAD590a51e",
    "published": "2025-08-06 21:17",
    "image": "https://www.cnet.com/a/img/resize/1624e55c2a3f75651c76f65bc9535385f8529226/hub/2025/07/01/f782c9b4-a780-4aaa-abe8-d52776940ee2/anker-nebula-x1-1-of-6.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "See all the detail in your favorite shows and movies with the best 4K Ultra HD projectors we've tested.",
    "full_text": "I've been reviewing projectors for over 20 years and have used one (OK, many over the years) as my main \"TV\" since I started reviewing them. The data is collected and collated by Portrait Displays CalMan Ultimate software. Contrast ratios are measured in each lamp or LED/laser and iris mode (when available). Contrast ratio is the most important part of any projector's performance. The most accurate projectors produce lifelike colors that are very natural to watch. Light output is the second most important factor, because it's not only how bright the image appears on your wall, but also how big an image you can produce. We measure brightness in candelas per square meter (cd/m2) and then convert to estimated lumens for ease of comparison. Budget models, those that prioritize brightness over everything, along with devices from newcomers to the projector space often have wildly inaccurate colors that result in a very unnatural image. These are rarely a major factor in projector performance, but some models still use older chips that have issues. Those are difficult to do at the same time, but as long as the balance works and it looks better than its competitors at a similar price, it's a winner."
  },
  {
    "title": "Google would like you to study with Gemini instead of cheat with it",
    "slug": "google-would-like-you-to-study-with-gemini-instead-of-cheat-with-it",
    "link": "https://www.theverge.com/news/732182/google-gemini-ai-guided-learning-education",
    "published": "2025-08-06 17:09",
    "image": "https://images.unsplash.com/photo-1571939831265-d710665a1ea0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzdGVwJTIwc3VwcG9ydCUyMCUyQyVFMiU4MCU5RCUyMGNlbyUyMHN1bmRhciUyMHBpY2hhaSUyMHNheXN8ZW58MHx8fHwxNzU0NTE0OTEwfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Google’s Gemini AI now has a “guided learning” mode that tries to help you actually understand the problems you’re trying to learn about instead of just giving you the answer. Guided learning “acts as a learning companion” that guides you with “questions and step-by-step support,” CEO Sundar Pichai says in a blog post. Answers from […]",
    "full_text": "He joined The Verge in 2019 after nearly two years at Techmeme. Posts from this author will be added to your daily email digest and your homepage feed. Google’s Gemini AI now has a “guided learning” mode that tries to help you actually understand the problems you’re trying to learn about instead of just giving you the answer. Guided learning “acts as a learning companion” that guides you with “questions and step-by-step support,” CEO Sundar Pichai says in a blog post. Answers from the guided learning mode can include things like images, videos, and interactive quizzes. The company worked with students, educators, researchers, and learning experts to ensure the mode is “helpful for understanding new concepts and is backed by learning science,” according to Pichai. AI companies are increasingly pushing into education — perhaps in part to try and fight the reputation that AI tools have acquired that they help students cheat. Features like Gemini’s guided learning mode and ChatGPT’s similar study mode, which was announced last week, could theoretically help with actual learning, but the question is whether students will want to use these modes instead of just using the AI chatbots for easy answers. As part of its announcements on Wednesday, Google is now letting students 18 and older in the US, Japan, Indonesia, Korea, and Brazil sign up for 12 months of its AI Pro Plan for free, as long as they do so by October 6th. The company is also committing $1 billion in funding over three years for “American education, including AI literacy programs, research funding and cloud computing resources,” Pichai says."
  },
  {
    "title": "Apple announces $100 billion US manufacturing plan after pressure from Donald Trump",
    "slug": "apple-announces-100-billion-us-manufacturing-plan-after-pressure-from-donald-trump",
    "link": "https://www.theverge.com/news/719929/apple-100-billion-investment-us-manufacturing-trump",
    "published": "2025-08-06 17:07",
    "image": "https://images.unsplash.com/photo-1580835916901-40770720c505?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwxMDAlMjBiaWxsaW9uJTIwdG93YXJkJTIwZXhwYW5kaW5nJTIwbWFudWZhY3R1cmluZ3xlbnwwfHx8fDE3NTQ1MTQ5MTF8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Apple is putting another $100 billion toward expanding manufacturing in the US as the company responds to pressure from President Donald Trump to manufacture more of its products in the US. The move builds upon the company’s initial plan to invest $500 billion in the US over the next four years, and includes a new […]",
    "full_text": "Previously, she was a writer and editor at MUO. Apple is putting another $100 billion toward expanding manufacturing in the US as the company responds to pressure from President Donald Trump to manufacture more of its products in the US. As part of its investment, Apple has agreed to an expanded partnership with Corning to manufacture “100 percent” of the iPhone and Apple Watch cover glass in Kentucky. It will also work with Samsung at its chip fab in Austin, Texas, “to launch an innovative new technology for making chips, which has never been used before anywhere in the world,” according to Apple’s press release. Last month, Apple announced that it will open a manufacturing academy in Michigan to help train American companies in “advanced manufacturing” techniques as well. It’s not clear whether Apple’s new promises will satiate Trump, who believes Apple can make its iPhones in the US. Trump has criticized Apple for not bringing the work back to the US instead, and threatened the company with a 25 percent tariff if it doesn’t manufacture more products domestically. Apple revealed last week that Trump’s tariffs could add another $1.1 billion to its costs during the September quarter, adding to the $800 million it has already spent on the levies. On Wednesday, Trump said he would raise tariffs on India by 25 percent, where Cook said the “majority” of iPhones destined for the US are made. Update, August 6th: Added a statement from Cook."
  },
  {
    "title": "You Can Still See Bright Fireballs During the Perseids Meteor Shower",
    "slug": "you-can-still-see-bright-fireballs-during-the-perseids-meteor-shower",
    "link": "https://www.cnet.com/science/space/look-to-the-sky-bright-fireballs-appear-during-the-perseids-meteor-shower/#ftag=CAD590a51e",
    "published": "2025-08-06 21:07",
    "image": "https://www.cnet.com/a/img/resize/5c9b5afa9dd6e52fff0d2fa18dbae25e3386a49f/hub/2021/07/13/dd167c0d-8d80-4b5f-bb47-9bb936a9f3cb/nasaingallsperseid2016.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Look up, and if you're lucky, and in the right spot, you could see dozens of meteors in the sky each hour.",
    "full_text": "Skygazers rejoice, the summer isn't finished with delivering dazzling meteor showers. The Perseids meteor shower is about to give you a real light show, provided you're far enough away from light pollution to see it. The show started on July 17, and will run through Aug. 23. During its peak, the meteor shower is known to rain down as many as 100 meteors per hour, according to the American Meteor Society. Per NASA, fireballs tend to last longer than standard shooting stars and can come in a variety of different colors. Until then, it leaves behind an excellent tail of dust and debris to feed us yearly meteor showers. During this time, the shower will produce anywhere from 25 to 100 meteors per hour on average. Thus, if you're planning on watching this year's Perseids during their peak, you'll want to get out of the city and suburbs as far as possible. Like all meteors, Perseids are named after the constellation from which they appear. Thus, it is highly probable that light pollution from the moon may reduce the number of visible meteors by a hefty margin, depending on how things go."
  },
  {
    "title": "Researchers Seize Control of Smart Homes With Malicious Gemini AI Prompts",
    "slug": "researchers-seize-control-of-smart-homes-with-malicious-gemini-ai-prompts",
    "link": "https://www.cnet.com/home/smart-home/researchers-seize-control-of-smart-homes-with-malicious-gemini-ai-prompts/#ftag=CAD590a51e",
    "published": "2025-08-06 20:44",
    "image": "https://www.cnet.com/a/img/resize/866bb851a463889f588674929d19194cc6bba1e9/hub/2025/06/26/c718491b-2411-4747-8ab2-f153cd8d1a7e/cnet-gemini-ai-1455.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "AI hacks show how Gemini can be secretly used to control lights, heaters and other smart home tech, signaling a new evolution in digital vulnerabilities.",
    "full_text": "Recent reports and demonstrations from the Black Hat computer-security conference have shown how outside Gemini AI prompts, dubbed promptware, could fool the AI and force it to control Google Home-connected smart devices. Demonstrations show how a prompt sneakily added to an inserted Google Calendar invite will be read by Gemini the same way it scans other Google app data, such as when it is summarizing emails. But in this case, the addition gives Gemini a very specific order, like creating an agent to control everyday devices from Google Home. It includes videos showing how the right Gemini prompts could be used to open windows, turn off lights, turn on a boiler or geolocate the current user. As the Invitation is All You Need research shows, a detailed prompt can be hidden in an innocuous Calendar invite title or similar spot. These commands can make Gemini create a hidden agent and wait for a common response (like saying \"thank you\" in an email) to trigger certain actions. Even if your calendar controls are tight, some of these promptware attacks could be performed through other things that Gemini scans, such as an email subject line. Google told CNET they have introduced multiple fixes to address the promptware vulnerabilities since the researchers provided Google with their report in February 2015. Their research helped us better understand novel attack pathways, and accelerated our work to deploy new, cutting edge defenses which are now in place protecting users.\" But as these new generative AIs get added to smart homes (the slowly rolling out Alexa Plus and eventual Siri AI upgrades included), there's a chance they could bring new vulnerabilities with them."
  },
  {
    "title": "Best Power Bank for iPhones in 2025",
    "slug": "best-power-bank-for-iphones-in-2025",
    "link": "https://www.cnet.com/tech/mobile/best-power-bank-for-iphone/#ftag=CAD590a51e",
    "published": "2025-08-06 20:40",
    "image": "https://www.cnet.com/a/img/resize/c99490032b854bba0b4aabc77827bf1de00e6e0a/hub/2025/01/22/c2d49b68-7598-45b8-81da-e5bf35df9c6e/anker-zolo-10000.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "I tested a variety of iPhone battery packs, including MagSafe-enabled magnetic power banks with fast Qi2 wireless charging as well as more affordable models that cost less than $20. These are my current top picks.",
    "full_text": "Ugreen Qi2 magnetic power bank: Less well-known battery companies, like Ugreen and Baseus, are trying to take on Anker on Amazon with value power banks like this Qi2 magnetic wireless charger ($35). It's fairly slim for a 10,000-mAh battery and offers up 15-watt wireless charging and 20W wireless charging if you plug the battery into a 20W or higher power adapter. Mophie Powerstation Plus Mini: If you have one of the newer iPhones with USB-C charging, or an Android smartphone with USB-C, the Mophie Powerstation Plus Mini ($50) is a relatively compact power bank with an integrated USB-C cable that offers 20-watt fast charging. The mini version has a 5,000-mAh battery that will fully recharge most smartphones at once. Mophie Powerstation Plus: If you're still using Apple devices with Lightning connectors but also want a power bank that can charge USB-C equipped devices, the Mophie Powerstation Plus ($80), while fairly price, is a nice option with its dual UBC-C/Lightning cable design. The smaller Mini version costs about $30 less and has only a single USB-C cable (it's a 5,000-mAH battery), while the Mophie Powerstation Plus ($100) also has dual cables but adds retractable prongs so you can charge it in any power outlet. Its only drawback is that it's a little bulky for on-the-go use. You have to pay a bit more for going green, but it's a nice, compact 10,000-mAh charger that features 20-watt PD fast-charging with dual USB-C ports (one on either side of the power bank) that allow you to charge two devices at the same time. While the Anker 313 PowerCore Slim 10K is cheaper, this offers fast USB-C outcharging, which makes spending the extra dough a big plus if you have a USB-C-to-Lightning cable. Anker PowerCore III 10K Portable Charger: The Anker PowerCore III 10K portable charger has fast USB-C out charging (18 watts) as well as a USB-A port and up to 10-watt wireless charging."
  },
  {
    "title": "WB Games’ best PC titles are in this $12 Humble bundle",
    "slug": "wb-games-best-pc-titles-are-in-this-12-humble-bundle",
    "link": "https://www.theverge.com/tech/720211/humble-bundle-wb-games-deal-sale",
    "published": "2025-08-06 16:39",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/assets/764784/156_ArkhamCity-308.jpg?quality=90&strip=all&crop=0,3.4801106327551,100,93.03977873449",
    "summary": "The future of Warner Bros. Games is unclear, as it shut down several studios and canceled anticipated games earlier this year. But there’s no arguing that the company’s back catalog of titles is full of gems, many of which are in Humble’s great $12 bundle. Through August 27th, you can jump on this unbeatable deal […]",
    "full_text": "Posts from this author will be added to your daily email digest and your homepage feed. The future of Warner Bros. Games is unclear, as it shut down several studios and canceled anticipated games earlier this year. But there’s no arguing that the company’s back catalog of titles is full of gems, many of which are in Humble’s great $12 bundle. Through August 27th, you can jump on this unbeatable deal that gets you 16 WB Games titles on Steam for just $12, with proceeds going to the Raiden Science Foundation. This bittersweet bundle features an array of licensed and original open-world titles, fighting games, and first-person shooters from WB Games’ studios — most of which have either fallen from grace in recent years or have been shut down. The standout for me is Middle-earth: Shadow of Mordor, Monolith’s third-person action game that features the excellent Nemesis System, a mechanic that allows enemies to remember and react to players. For instance, if an enemy kills you in battle, that enemy will get stronger and remember your last encounter, making fights feel more personal. Other highlights include Batman: Arkham City, Batman: Arkham Asylum, and the oft-overlooked Mad Max. There’s a lot of fun to be had with other games in the bundle too, like Mortal Kombat 11, Mortal Kombat XL, Middle-earth: Shadow of War, and Suicide Squad: Kill the Justice League, among others. In most cases, you’ll be getting the most content-complete versions of the games with the purchase."
  },
  {
    "title": "You May Soon Be Able to Chat on WhatsApp Even Without an Account",
    "slug": "you-may-soon-be-able-to-chat-on-whatsapp-even-without-an-account",
    "link": "https://www.cnet.com/tech/services-and-software/you-may-soon-be-able-to-chat-on-whatsapp-even-without-an-account/#ftag=CAD590a51e",
    "published": "2025-08-06 20:25",
    "image": "https://www.cnet.com/a/img/resize/e2aec18d7495a2fff4419d35a65387e7985cc9e0/hub/2022/06/14/36a822dc-522c-4ac2-b3a7-2ddbf1f137f6/move-to-ios-whatsapp-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "'Guest chats' isn't in beta testing yet, but will likely be released in a future WhatsApp update.",
    "full_text": "The invited party does not need to have WhatsApp installed on their phone nor have a WhatsApp account, and the sender can share the online chat link on any platform they choose -- text, email or social media. The guest chats will be only one-to-one -- no group chats -- and no photos, videos or GIFs can be shared. App owner Meta did not immediately respond to a request for comment. WhatsApp's new \"guest chats\" feature doesn't come without risks, says Chuck Brooks, president of Brooks Consulting International and once called one of the \"5 Tech Voices You Should Be Following on LinkedIn.\" Brooks notes that the change offers the possibility that users with bad intentions will pose as trustworthy people, provide dangerous links or attempt phishing schemes. \"Unknown contacts may forward and include links to phishing websites that aim to steal personal data or infect a user's device with malware,\" he said. \"It can also result in unwanted interaction, such as harassment or unwelcome group additions, when you receive messages from strangers.\" Aras Nazarovas, security researcher at Lithuania-based Cybernews, said WhatsApp users need to avoid making \"easy mistakes\" with the guest chats feature to avoid security issues. \"But overall, from what we know, it's a good compatibility feature for people who have a WhatsApp account and those who don't.\" One of the provisions of that legislation was allowing WhatsApp and Messenger users in Europe to communicate with people using other messaging services, or what Meta refers to as \"third-party chats.\""
  },
  {
    "title": "Upwork is buying its way into corporate staffing beyond freelancers",
    "slug": "upwork-is-buying-its-way-into-corporate-staffing-beyond-freelancers",
    "link": "https://techcrunch.com/2025/08/06/upwork-acquires-bubty-and-ascen-with-plans-to-launch-a-standalone-enterprise-business/",
    "published": "2025-08-06 20:05",
    "image": "https://images.unsplash.com/photo-1633634070569-c07f111b8683?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzZXBhcmF0ZSUyMGVudGl0eSUyMGxhdGVyfGVufDB8fHx8MTc1NDUxMTMwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The company will merge Bubty and Ascen with its existing enterprise business to form a separate entity later this year.",
    "full_text": "Upwork, a platform that connects companies with freelancers, announced two acquisitions to help build out a new stand-alone enterprise-focused business that could expand its market reach. Upwork president and CEO Hayden Brown told TechCrunch that the timing was right to launch this new enterprise-focused business because Upwork’s existing enterprise customers have been increasingly asking for access to these talent pools. “And with this new capability, we’re refusing to compromise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Upwork decided to make the enterprise business a stand-alone entity because enterprises have very different needs regarding compliance and software integrations than the small and midsize businesses Upwork’s main business works with. The company landed on Bubty and Ascen not only for what they bring separately but also for how they worked together — Upwork piloted the companies both individually and together. “We saw through the power of those pilots how impactful their technology was and how easy it was to basically snap together what each of them offers, along with our existing offering to deliver something very new and innovative in the market,” Brown added."
  },
  {
    "title": "Jury Decides Meta Stole Data from Users of Period-Tracking App. What to Do If You're Worried",
    "slug": "jury-decides-meta-stole-data-from-users-of-period-tracking-app-what-to-do-if-you-re-worried",
    "link": "https://www.cnet.com/health/medical/jury-decides-meta-stole-data-from-users-of-period-tracking-app-what-to-do-if-youre-worried/#ftag=CAD590a51e",
    "published": "2025-08-06 20:01",
    "image": "https://www.cnet.com/a/img/resize/b788c2ee4a9bc0b31df884421745d3ba1febd582/hub/2025/08/06/17f04ac0-1bc1-4296-8a46-b7e8fbdc6f52/flo-app.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The tech company lost a massive privacy case involving the Flo app that has raised huge questions about how health apps are secretly being used.",
    "full_text": "A California jury ruled Wednesday that Meta broke state privacy laws by collecting data from the popular period-tracking app Flo, including private health data and pregnancy goals. The consolidated Flo lawsuit dates to 2021, when users of the Flo app accused major tech companies of harvesting their data and actions on the period-tracking app, which included personal profiles about their menstrual cycles, sexual activity, pregnancy history and a variety of other personal health information. This kit allowed Flo to send different types of user data to Facebook, including buttons users clicked and data they shared with the app. The jury agreed that Meta had intentionally eavesdropped on the plaintiffs when they had a reasonable expectation of privacy, and did not have consent to eavesdrop or record data in this way. User privacy is important to Meta, which is why we do not want health or other sensitive information and why our terms prohibit developers from sending any.\" Should you be worried about using the Flo app? Tracking periods on an app may not be the most efficient option, anyway. The good news is that when Flo settled in 2021, part of the bargain was to arrange an independent privacy review and require explicit consent when sharing data. But issues with data harvesting and sharing like this raise broader questions about how safe it is to use health apps if you're concerned with privacy. We've also covered ways to track menstrual cycles without relying on an app at all, so you have plenty of alternatives."
  },
  {
    "title": "Today's NYT Strands Hints, Answers and Help for Aug. 7 #522",
    "slug": "today-s-nyt-strands-hints-answers-and-help-for-aug-7-522",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-strands-hints-answers-and-help-for-aug-7-522/#ftag=CAD590a51e",
    "published": "2025-08-06 20:00",
    "image": "https://www.cnet.com/a/img/resize/166e67238a28ef7d82e62fe8aec7185a7cc23eda/hub/2024/05/15/859c9110-e596-432b-8690-95e6102759c9/nyt-new-york-times-strands-2054.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and answers for the NYT Strands puzzle for Aug. 7 No. 522.",
    "full_text": "Click here for our daily Strands hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle, Connections and Connections: Sports Edition puzzles. Today's NYT Strands puzzle isn't that simple of a topic. If you need hints and answers, read on. I go into depth about the rules for Strands in this story. If you're looking for today's Wordle, Connections and Mini Crossword answers, you can visit CNET's NYT puzzle hints page. If that doesn't help you, here's a clue: So dependable. Your goal is to find hidden words that fit the puzzle's theme. These are the words I used to get those hints but any words of four or more letters that you find will work: When you have all of them (I originally thought there were always eight but learned that the number can vary), every letter on the board will be used. To find it, look for the H that's four letters down on the far-left row, and wind across and down."
  },
  {
    "title": "Today's NYT Connections: Sports Edition Hints and Answers for Aug. 7, #318",
    "slug": "today-s-nyt-connections-sports-edition-hints-and-answers-for-aug-7-318",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-sports-edition-hints-and-answers-for-aug-7-318/#ftag=CAD590a51e",
    "published": "2025-08-06 20:00",
    "image": "https://www.cnet.com/a/img/resize/c7e1d294a1a554f051860c8dddd6fd0c6527b452/hub/2024/10/16/c34cfc41-01f2-4b1a-80a8-f6479c50c02e/connections-sports-edition-6859.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answers for the NYT Connections: Sports Edition puzzle for Aug. 7, No. 318.",
    "full_text": "Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle and Strands puzzles. Can you identify pro athletes from just a headshot? If not, today's Connections: Sports Edition might be tough. Or you can continue to play it free online. Hints for today's Connections: Sports Edition groups Blue group hint: Signal-callers from a certain team. Purple group hint: Promising football players, 7 years ago. Blue group: Baltimore Ravens QBs, past and present. What are today's Connections: Sports Edition answers? The theme is Baltimore Ravens QBs, past and present."
  },
  {
    "title": "Today's NYT Connections Hints, Answers and Help for Aug. 7, #788",
    "slug": "today-s-nyt-connections-hints-answers-and-help-for-aug-7-788",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-hints-answers-and-help-for-aug-7-788/#ftag=CAD590a51e",
    "published": "2025-08-06 20:00",
    "image": "https://www.cnet.com/a/img/resize/3986ca4ac5b498c6114118e0dfa25b2a05ae6531/hub/2025/03/26/c70b0a32-884a-4379-b77b-de75776952ba/nyt-word-games-connections-2798.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are some hints and the answers for the NYT Connections puzzle for Aug. 7, #788.",
    "full_text": "Looking for the most recent Connections answers? Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle, Connections: Sports Edition and Strands puzzles. Today's NYT Connections puzzle has one category that could be in the Connections: Sports Edition puzzle, so hopefully you know something about a certain sport. Read on for clues and today's Connections answers. Players who are registered with the Times Games section can now nerd out by following their progress, including number of puzzles completed, win rate, number of times they nabbed a perfect score and their win streak. Read more: Hints, Tips and Strategies to Help You Win at NYT Connections Every Time Green group hint: Make a hole in. Blue group hint: Cats have these. Blue group: Ones with pointy ears. The theme is ones with pointy ears."
  },
  {
    "title": "Today's Wordle Hints, Answer and Help for Aug. 7, #1510",
    "slug": "today-s-wordle-hints-answer-and-help-for-aug-7-1510",
    "link": "https://www.cnet.com/tech/gaming/todays-wordle-hints-answer-and-help-for-aug-7-1510/#ftag=CAD590a51e",
    "published": "2025-08-06 20:00",
    "image": "https://www.cnet.com/a/img/resize/837b400de41f50a97b52a8c799b193be01cea440/hub/2024/05/28/20480816-214e-4fcc-a9b4-b02f0ac71e7c/wordle-word-game-hints-puzzle-8667.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answer for today's Wordle No. 1,510 for Aug. 7.",
    "full_text": "Click here for today's Wordle hints, as well as our daily answers and hints for The New York Times Mini Crossword, Connections, Connections: Sports Edition and Strands puzzles. Today's Wordle puzzle wasn't too tough. It's a fairly easiy-to-guess word, and none of the letters are very rare. If you need a new starter word, check out our list of which letters show up the most in English words. If you need hints and the answer, read on. If you don't want a spoiler, look away now. Today's Wordle answer has no repeated letters. Today's Wordle answer has two vowels. Today's Wordle answer is sometimes used as a first name. Today's Wordle answer is related to ocean reefs."
  },
  {
    "title": "Google denies AI search features are killing website traffic",
    "slug": "google-denies-ai-search-features-are-killing-website-traffic",
    "link": "https://techcrunch.com/2025/08/06/google-denies-ai-search-features-are-killing-website-traffic/",
    "published": "2025-08-06 19:45",
    "image": "https://images.unsplash.com/photo-1594321120041-00d204971461?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0aG91Z2glMjBnb29nbGV8ZW58MHx8fHwxNzU0NTE0MDA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Though Google hasn't shared any specific data to back up its conclusions, even if we assume Google's claims to be true, this doesn't necessarily mean that AI isn't having an impact.",
    "full_text": "But Google on Wednesday denied that’s the case, at least in aggregate. Instead, the search giant says that total organic click volume from its search engine to websites has been “relatively stable” year-over-year and that average click quality has slightly increased. That word “some” is doing heavy lifting here, as Google doesn’t share data about how many sites are gaining or losing. Google also allows users to interact with an AI chatbot for some queries. Yet Google denies that this is significantly reshaping the search landscape. Back in 2022, a Google exec even said that social sites like TikTok and Instagram were eating into Google’s core products, like Search and Maps. Google has also long been worried that Amazon.com had become people’s first stop for online shopping searches, and Reddit.com had become the first stop for researching topics of interest. The company only points out that when people click through on an AI response to the source, they’re more likely to dive deeper, so those clicks are more valuable. One recent study from Similarweb indicates that the number of news searches on the web resulting in zero clicks to news websites has grown from 56% (when Google launched AI Overviews in May 2024) to 69% as of May 2025. It’s as if Google wants publishers to believe not what their own eyes — and graphs and charts — tell them, but instead take comfort in the fact that Google still sends “billions of clicks to websites” every day, just as the post claims."
  },
  {
    "title": "A rival Tea app for men is leaking its users’ personal data and driver’s licenses",
    "slug": "a-rival-tea-app-for-men-is-leaking-its-users-personal-data-and-drivers-licenses",
    "link": "https://techcrunch.com/2025/08/06/a-rival-tea-app-for-men-is-leaking-its-users-personal-data-and-drivers-licenses/",
    "published": "2025-08-06 19:40",
    "image": "https://images.unsplash.com/photo-1577228159816-2ab72a38c22b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsZWFzdCUyMG9uZSUyMG1ham9yJTIwc2VjdXJpdHklMjBmbGF3fGVufDB8fHx8MTc1NDUwOTUwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The newly launched app, now trending on Apple's App Store, contains at least one major security flaw that exposes the private information of its users, including their uploaded selfies and government-issued IDs.",
    "full_text": "Tea is advertised as a women’s safety app with more than 6 million users that is similar to “Are we dating the same guy?” Facebook networks. 2 among Lifestyle apps on iOS, appears to be a direct rebuttal to the Tea app, even copying the language from Tea’s App Store description in its own listing. But like the app it sought to emulate, TeaOnHer contains security flaws of its own. TeaOnHer was uploaded to the iOS App Store by a developer named Newville Media Corporation. According to LinkedIn, the founder and CEO of this company is Xavier Lampkin. TechCrunch identified at least one TeaOnHer record associated with Lampkin’s own data. Along with its security flaws, the content portrayed within TeaOnHer is troubling in itself. While the app requests IDs and selfies from its users to verify their identities — a process that is not automatic — users can access a “guest” view of the app without signing in. Immediately upon opening “guest” view, TechCrunch saw several images of the same naked woman, posted under different names in a form of spam. Other posts share the photos and names of women, alongside comments calling them “easy,” or accusing them of spreading sexually transmitted infections."
  },
  {
    "title": "Federal regulators give Zoox an exemption for its custom-built robotaxis",
    "slug": "federal-regulators-give-zoox-an-exemption-for-its-custom-built-robotaxis",
    "link": "https://techcrunch.com/2025/08/06/federal-regulators-give-zoox-an-exemption-for-its-custom-built-robotaxis/",
    "published": "2025-08-06 19:02",
    "image": "https://images.unsplash.com/photo-1649472307167-5014126dd571?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxvd25lZCUyMGF1dG9ub21vdXMlMjB2ZWhpY2xlJTIwY29tcGFueXxlbnwwfHx8fDE3NTQ1MDc3MDN8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "NHTSA is also closing an investigation into the Amazon-owned autonomous vehicle company.",
    "full_text": "The National Highway Traffic Safety Administration has given Zoox an exemption to demonstrate its custom-built robotaxis on public roads and closed a related investigation into whether the Amazon-owned company had sidestepped federal regulations. The company has since expanded its testing footprint to Las Vegas and San Francisco. NHTSA’s announcement is connected to its new national framework, which the agency argues will make it easier for companies to deploy autonomous vehicles without traditional manual driving controls — like steering wheels, pedals, and sideview mirrors — at scale. The framework, known as AV STEP (or ADS-Equipped Vehicle Safety, Transparency and Evaluation Program), allows NHTSA to green-light the sale and commercialization of autonomous vehicles that are not compliant with federal safety standards due to a lack of manual controls. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Zoox spokesperson Whitney Jencks said in an email that Zoox is working in close cooperation with NHTSA on this process, beginning with the demonstration exemption and followed by the commercial exemption. Zoox has agreed to remove or cover all statements that its purpose-built vehicles comply with applicable Federal Motor Vehicle Safety Standards."
  },
  {
    "title": "How to actually raise a seed round: Actionable advice from top investors at TechCrunch Disrupt 2025",
    "slug": "how-to-actually-raise-a-seed-round-actionable-advice-from-top-investors-at-techcrunch-disrupt-2025",
    "link": "https://techcrunch.com/2025/08/06/how-to-actually-raise-a-seed-round-actionable-advice-from-top-investors-at-techcrunch-disrupt-2025-on-july-15/",
    "published": "2025-08-06 18:48",
    "image": "https://images.unsplash.com/photo-1602567781778-3e37e0550c39?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0eXBpY2FsJTIwdmVudHVyZSUyMHBhbmVsfGVufDB8fHx8MTc1NDUwNjgwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "This isn’t your typical venture panel. Expect sharp insights on how to cut through the noise, structure your raise, and build relationships that last beyond a term sheet. Whether you're gearing up for your first round or advising a founder who is, this is the TC Disrupt session you don’t want to miss.",
    "full_text": "TechCrunch Disrupt 2025 returns to Moscone West in San Francisco from October 27-29, bringing together more than 10,000 startup and VC leaders for an inside look at where innovation is headed. Register now to save up to $675 on your ticket and join this conversation — plus 200+ more sessions across five industry stages, roundtables, and breakouts. From shaping a compelling pitch to choosing the right capital partners, they’ll share honest, actionable insights to help founders translate interest into investment. She holds an MBA from Yale and a BS in chemical engineering. Marlon Nichols, co-founder and managing general partner of MaC Venture Capital, leads one of North America’s top seed-stage firms with over $600 million AUM (assets under management). Whether you’re gearing up for your first round or advising a founder who is, this is the session you don’t want to miss. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "Best Internet Providers in Chicago, Illinois",
    "slug": "best-internet-providers-in-chicago-illinois",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-chicago-il/#ftag=CAD590a51e",
    "published": "2025-08-06 18:48",
    "image": "https://www.cnet.com/a/img/resize/df03afcb87cc1274dab1407c4ecd31f1a3502728/hub/2022/04/01/392f98de-e48f-4abb-99ca-76b9514698db/gettyimages-584791924.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Whether you're looking for fiber internet, unlimited data or affordable plans in the Chicago area, our internet experts have found best internet service providers for you.",
    "full_text": "CNET’s top recommendation for most households in Chicago is AT&T Fiber due to its ultra-fast symmetrical speeds, straightforward pricing and solid availability. For those who need top-tier performance, AT&T Fiber also delivers the fastest internet in the area with speeds up to 5,000Mbps for $245 per month, all without data caps or long-term contracts. The best internet deals and top promotions in Chicago depend on what discounts are available during a given time. For a more extensive list of promos, check out our guide on the best internet deals. (Disclosure: Ookla is owned by the same parent company as CNET, Ziff Davis.) For more information, refer to our guide on how much internet speed you really need. ISP plans and prices are subject to frequent changes; all information provided is accurate as of publication. The Windy City has a lot of options when it comes to home internet, including both speedy and more affordable service. Prices will vary depending on your provider and selected plan, but most entry-level internet plans in Chicago start at $50 a month. Smaller regional providers like Zentro Internet also offer fiber service at select addresses, but only to a scattering of buildings throughout the city."
  },
  {
    "title": "First impressions of Alexa+, Amazon’s upgraded, AI-powered digital assistant",
    "slug": "first-impressions-of-alexa-amazons-upgraded-ai-powered-digital-assistant",
    "link": "https://techcrunch.com/2025/08/06/first-impressions-of-alexa-amazons-upgraded-ai-powered-digital-assistant/",
    "published": "2025-08-06 18:27",
    "image": "https://images.unsplash.com/photo-1570562457207-9c0c00274740?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxiZXN0JTIwc21hcnQlMjBhc3Npc3RhbnR8ZW58MHx8fHwxNzU0NTA1MDA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "To find out whether Alexa is still the best smart assistant for my family, I'm going to test Amazon's AI-powered devices, experiment with AI queries, and write out my thoughts in a multi-part series.",
    "full_text": "But before we can get to that, let’s see how Alexa+ handles the basics. While it’s a bit tedious to do so — and something that could be even more tedious in time as more services are added — I did appreciate that it felt like I was in control of the data sharing and could see exactly what each service was requesting before agreeing. In this section, there was also a list of services I had previously linked with Alexa. I mean, would it not make sense to just remove the broken thing that no longer exists? It felt more natural, but there’s a very slight lag with her responses at times. Alexa: Sure, I’d be happy to remember your Delta SkyMiles number for you. Alexa: I don’t see any information specifically for [grade] in that email. Me: Alexa, I want to know when the Glow Recipe Plum Plumping and Hydrating Hyaluronic Acid Skin Care Serum goes on sale. I’ve already set up a deal tracker for the Glow Recipe Plum Plumping Serum. (Long pause) I found the Coach Swinger handbag, but it’s currently available in black."
  },
  {
    "title": "I tested 30 smart locks, and these are the best",
    "slug": "i-tested-30-smart-locks-and-these-are-the-best",
    "link": "https://www.theverge.com/23393163/best-smart-door-lock",
    "published": "2025-08-06 14:23",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/257776_Smart_lock_buying_guide_CVirginia3.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "A smart lock is an easy solution to some common problems. Locked yourself out? Need to let a friend in to water the plants? Your latchkey kid lost their key? Hands are full, and it’s raining cats and dogs? A smart lock solves all of these problems and more. One of the best smart home […]",
    "full_text": "We have four exterior doors, so it saves me from walking around the house at night checking everything is secure. It unlocks just as I approach my porch, making coming home and opening the door a virtually hands-free experience. The Select can also auto-lock based on your location, not just after a set amount of time as most locks offer. Kwikset’s solution allows you to use its advanced features today while still having the future-proofing potential of Matter for tomorrow. Support for other platforms and remote unlocking comes through Yale’s ingenious swappable networking modules, which cost around $80 each. Yale promised support for Matter via a Matter-over-Thread module back in 2022, but this still hasn’t materialized. Home Key took a while to gain adoption, but there are now several options (and should soon be more as Apple has made it part of Matter). Level locks work over Bluetooth out of the box and can connect to an Apple Home hub for out-of-home control. But packages and people were clearly visible, which is most of what you want to see with a doorbell camera. The downside is that not all platforms support creating PIN codes for Matter smart locks with keypads (Google Home and Alexa don’t offer this yet)."
  },
  {
    "title": "When Will the iPhone 17 Be Released? We're Running Down the Possibilities",
    "slug": "when-will-the-iphone-17-be-released-we-re-running-down-the-possibilities",
    "link": "https://www.cnet.com/tech/mobile/when-will-the-iphone-17-be-released-were-running-down-the-possibilities/#ftag=CAD590a51e",
    "published": "2025-08-06 18:20",
    "image": "https://www.cnet.com/a/img/resize/83ba834275905a2f2ae314c512d3d67c7ba46618/hub/2025/06/18/efcc498a-d738-4252-b330-8f11c36cce90/iphone-17-rumors-vt-v04-00000.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The projected release date of Apple's biggest product is starting to come into focus.",
    "full_text": "It's fun to speculate on which features the new iPhone 17 lineup will have, but what we really want to know is when we can get our hands on Apple's latest editions of its flagship smartphone. As we get closer to September and the traditional announcement date, iPhone rumors are arriving more frequently. One recent leak points to Apple holding the iPhone 17 event on Sept. 9. German site iPhone-Ticker claims that it gained access to internal documents from a local carrier, and even though the sourcing cannot be confirmed, that release date lines up with existing rumors and expert opinion. For nearly a decade, Apple has announced its new iPhone lineup in early September. The supposed leak reported on by iPhone-Ticker lines up with expert opinion, so you might want to mark your calendar for Sept. 9 if you want to catch the new iPhone event. Here's a chart for the release dates of previous iPhone models: Here's a chart for the potential dates based on past schedules. Apple is expected to change its release format with the rumored iPhone 18. Reports suggest that Apple will only release higher-end models in fall 2026 -- iPhone 18 Pro, Pro Max, Air and a rumored new foldable iPhone -- and release the rest of the line in winter 2027."
  },
  {
    "title": "Google takes on ChatGPT’s Study Mode with new ‘Guided Learning’ tool in Gemini",
    "slug": "google-takes-on-chatgpts-study-mode-with-new-guided-learning-tool-in-gemini",
    "link": "https://techcrunch.com/2025/08/06/google-takes-on-chatgpts-study-mode-with-new-guided-learning-tool-in-gemini/",
    "published": "2025-08-06 18:18",
    "image": "https://images.unsplash.com/photo-1515073838964-4d4d56a58b21?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhbHNvJTIwb2ZmZXJpbmclMjBzdHVkZW50c3xlbnwwfHx8fDE3NTQ1MDUwMDV8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Google is also offering students in the U.S., Japan, Indonesia, Korea, and Brazil a free one-year subscription to its AI Pro plan.",
    "full_text": "The tool sort of functions like an AI tutor, as it’s designed to help users build a deep understanding instead of just getting answers. The launch follows just over a week after OpenAI rolled out Study Mode for ChatGPT, which is also designed to go beyond simply obtaining answers to questions by actually helping users develop critical thinking skills. Both companies’ launches come amid concerns that AI chatbots undermine the learning process because they spit out direct answers. The new tools from Google and OpenAI likely aim to address these concerns by positioning their chatbots as learning tools rather than simple answer engines. With Guided Learning, Gemini will break down problems step-by-step and adapt explanations to its users’ needs. Plus, users can now also ask Gemini to create flashcards and study guides based on their quiz results or other class materials. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "The Jurassic Park islands and dinos are coming to Microsoft Flight Simulator 2024",
    "slug": "the-jurassic-park-islands-and-dinos-are-coming-to-microsoft-flight-simulator-2024",
    "link": "https://www.theverge.com/news/720070/orbx-universal-jurassic-world-park-dinosaurs-microsoft-flight-simulator-2-024",
    "published": "2025-08-06 14:07",
    "image": "https://images.unsplash.com/photo-1665021657505-3a680c9cf4b3?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsZXRzJTIwYXNwaXJpbmclMjBwaWxvdHMlMjBleHBsb3JlJTIwaXNsYSUyMG51YmxhcnxlbnwwfHx8fDE3NTQ1MjAzMTZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Jurassic World: Archipelago is a new expansion pack for Microsoft Flight Simulator 2024 that lets aspiring pilots explore Isla Nublar and the five islands of the fictional Muertes Archipelago featured in the Jurassic Park and Jurassic World movies. Created by Australian developer Orbx, which is known for its flight sim add-ons, the expansion will let […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. Jurassic World: Archipelago is a new expansion pack for Microsoft Flight Simulator 2024 that lets aspiring pilots explore Isla Nublar and the five islands of the fictional Muertes Archipelago featured in the Jurassic Park and Jurassic World movies. Created by Australian developer Orbx, which is known for its flight sim add-ons, the expansion will let you visit many locations from the films while the islands will be teeming with more than 10 different species of dinosaurs. According to an FAQ on Orbx’s website, the Jurassic World: Archipelago expansion is an official collaboration with Universal Products & Experiences and will be available sometime in late August or early September of this year. It will initially launch for all versions of Microsoft Flight Simulator 2024 on Xbox and PC, but it will be compatible with the entry-level Standard Edition, which is also available through Xbox Game Pass. The studio says it’s also “working towards making compatible products for Microsoft Flight Simulator 2020 and X-Plane 12.” The expansion lets you visit the six islands — Nublar, Sorna, Matanceros, Peña, Tacaño, and Muerta — as they were before the events of 2015’s Jurassic World, “when the park is operational but not everything is under control.” You’ll be able to fly over Isla Nublar and see the park alive with activity, while the breeding facilities on Isla Sorna, as seen in The Lost World: Jurassic Park, remain abandoned and overgrown. Jurassic World: Archipelago includes new flying challenges like transporting VIPs between the islands and nearby Costa Rica, as well as conducting guided tours. You can visit the facilities and theme park structures seen in the various films and land at recognizable airfields and helipads, all while dodging the local wildlife that includes brachiosaurus, stegosaurus, velociraptors, tyrannosaurus rex, and flying pteranodons."
  },
  {
    "title": "'South Park' Season 27, Episode 2: How to Watch Without Cable",
    "slug": "south-park-season-27-episode-2-how-to-watch-without-cable",
    "link": "https://www.cnet.com/tech/services-and-software/south-park-season-27-episode-2-how-to-watch-without-cable/#ftag=CAD590a51e",
    "published": "2025-08-06 18:07",
    "image": "https://www.cnet.com/a/img/resize/d36890995e03834d433d528e77307ac91320df42/hub/2025/08/06/0e556889-9e0c-4085-9dd0-c6113d7a6a56/south-park.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "New episodes stream on Paramount Plus.",
    "full_text": "South Park season 27 didn't air a new episode last week, but fans won't have to wait too much longer for the second installment of the satirical show. Episode 2 of the hit animated series drops later today, and you can watch the trailer if you haven't already. After a hectic rollout that included a premiere-date push, South Park's new season is underway and its streaming home is now clear. Per a report from Deadline, five upcoming seasons and the show's back catalog will be on Comedy Central and Paramount Plus with the signing of a new deal. Forthcoming episodes of South Park season 27 will stream on Paramount Plus in the US the day after airing on Comedy Central. As for what the new season will entail, we have the above video for reference -- which starts sort of like a horror movie trailer before fires are unleashed, the Statue of Liberty is dismantled and disastrous plane collisions occur. If you want to watch the 27th season of the show co-created by Trey Parker and Matt Stone, here's what to know. South Park season 27, episode 2 release date and streaming details Episode 2 is titled \"Got A Nut.\" Premium removes ads and unlocks more Showtime titles, among other perks."
  },
  {
    "title": "Are Vibration Plates a Magic Bullet for Losing Weight and Gaining Strength? We Asked the Experts",
    "slug": "are-vibration-plates-a-magic-bullet-for-losing-weight-and-gaining-strength-we-asked-the-experts",
    "link": "https://www.cnet.com/health/fitness/are-vibration-plates-a-magic-bullet-for-losing-weight-and-gaining-strength-we-asked-the-experts/#ftag=CAD590a51e",
    "published": "2025-08-06 18:00",
    "image": "https://www.cnet.com/a/img/resize/506dd017b0f9b6e3d54c431538dd231ff1785c7c/hub/2025/01/09/ce0bddc4-e164-4864-8e49-76bfcf91327a/person-exercising-on-vibration-plate.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Vibration plates are the newest fitness trend on social media, but how well do they actually work?",
    "full_text": "If you're on a personal fitness journey, finding the best ways to lose weight and build muscle isn't easy. \"The purpose of vibration plates is to generate quick vibrations that cause your body's muscles to contract and relax several times per second,\" says Dr. Leah Verebes, a physical therapist and assistant professor at Touro University's School of Health Sciences. \"At a far greater frequency, this resembles the spontaneous contractions that take place during exercise.\" There are several ways to use a vibration plate, the most common being standing on its rectangular platform. However, experts agree that vibration plates offer the most benefits when used as part of an overall health and wellness plan. In other words, you shouldn't expect to lose weight or increase muscle strength just by standing on a vibration plate -- even if social media makes it seem so. \"You're going to experience much more muscle activation when doing it on a vibration plate machine.\" Scoot forward until you're hovering in front of the platform, only supported by your arms and legs. While it's true that vibration plates offer some compelling benefits, they aren't a shortcut to fitness. Experts also recommend following a healthy diet and participating in other forms of exercise to get the best results from vibration plate training."
  },
  {
    "title": "Instagram Adds New Features, Including Reposts and Maps",
    "slug": "instagram-adds-new-features-including-reposts-and-maps",
    "link": "https://www.cnet.com/news/social-media/instagram-adds-new-features-including-reposts-and-maps/#ftag=CAD590a51e",
    "published": "2025-08-06 17:59",
    "image": "https://www.cnet.com/a/img/resize/a15d618a8706dd3aab5fc21ea097e3b0cdee617e/hub/2025/08/06/4e6b60e9-17e5-407e-a7fe-1720c56d2441/instagrammap.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Feed posts and public reels can now be reshared on the popular social-networking app.",
    "full_text": "Instagram has launched new features aimed at further connecting users with their online contacts, the company announced Wednesday. One involves sharing public feed posts and reels, another shares locations with others on an Instagram map, and a new Friends tab shows what content your contacts have liked or commented on. For reposts, you'll be able to share public reels and feed posts from other users. Posts and reels will now include a reshare icon when they're available to share. You can set who can see your location and can also choose not to share your location when you're in specific places, or have your location available to specific users. Location sharing can be disabled at any time, Instagram says. Reels, posts and stories can be viewed through the map. Also, a new Friends tab at the top of Reels shows public content from contacts. This feature has been available previously, but is now being expanded globally. You can opt out of having your content displayed in the tab with options to hide likes, comments and reposts."
  },
  {
    "title": "'Freakier Friday' Review: Disney's Body-Swapping Sequel Really Rocks",
    "slug": "freakier-friday-review-disney-s-body-swapping-sequel-really-rocks",
    "link": "https://www.cnet.com/culture/entertainment/freakier-friday-review-much-anticipated-disney-sequel-really-rocks/#ftag=CAD590a51e",
    "published": "2025-08-06 17:29",
    "image": "https://www.cnet.com/a/img/resize/f7a4e232af28194fcf64cecc027086942e8f38a1/hub/2025/08/04/dcd6740e-fa6d-4ecd-958a-60def8677a91/ff-regal-27x40-470c-fin03-fintout-mech3.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Jamie Lee Curtis and Lindsay Lohan are back for a freakishly fun follow-up.",
    "full_text": "For me, watching Freakier Friday -- the new sequel to the 2003 body-switch comedy starring Lindsay Lohan and Jamie Lee Curtis -- led to a change in perspective: I was now a fan of two Freaky Friday movies headlined by Lohan and Curtis. From Curtis' nostalgic and still-hilarious portrayal of waking up as a 15-year-old inhabiting her step-grandmother's body to entertaining scenes with a job-switching fortune teller (Saturday Night Live alum Vanessa Bayer), the sequel offers wacky and laugh-out-loud moments. It wouldn't work without the commitment of its stars, Curtis and Lohan. Harper and Lily's status as mortal enemies complicates the soon-to-be blended family. When inevitable fortune-teller meddling and body-swapping occurs -- Lily switches with Tess and mother Anna trades places with daughter Harper -- the teens realize they can use their new bodies to break up their parents. Anna doesn't fully accept the relationship between her mom and soon-to-be stepdad. It takes body-switching for Anna and Tess to appreciate what they had been missing about each other. In Freakier Friday, being a teenager is depicted in a cringier light, from bedroom door notices that say \"no triggering\" to gluten-free requirements at high-school bake sales. However, the movie packs in copious cameos -- bringing back virtually every supporting character from the first movie -- an element I found kind of tiring. Curtis doesn't shy away from jokes at her expense; one scene where she reluctantly grabs items from the \"senior supplies\" section of a store is particularly memorable."
  },
  {
    "title": "Before the Next Planet Parade, Don't Miss This Week's Full Sturgeon Moon",
    "slug": "before-the-next-planet-parade-don-t-miss-this-week-s-full-sturgeon-moon",
    "link": "https://www.cnet.com/science/space/before-the-next-planet-parade-dont-miss-this-weeks-full-sturgeon-moon/#ftag=CAD590a51e",
    "published": "2025-08-06 17:27",
    "image": "https://www.cnet.com/a/img/resize/3a5aa53dedb9f38d32988abeb9af289cd61af2ff/hub/2022/10/05/7659e3a9-02ec-49c0-9635-ed1fc0645793/2036-vasquez-rocks-moonrise-1280x900.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The full moon shines bright in three days, just before the peak of the Perseid meteor shower and 11 days before the next planet spectacle.",
    "full_text": "As long as you're looking at the night sky, August has a ton of cool stuff going on this year. According to The Old Farmer's Almanac, the full moon will reach its peak brightness at 3:55 a.m. Thus, if you want to see the moon at its brightest, you'll want to look up the evening of Aug. 8 and on into the next morning. It's not a big deal if you miss it, as the moon will be over 90% full from Aug. 6 through Aug. 11, so you'll have plenty of chances to look up and see it. Venus and Jupiter don't make an appearance until much later in the evening, but they'll be visible with the naked eye. The other three will require some sort of magnification. The Perseids meteor shower is also active, so you may spy a shooting star or two, depending on how dark it is outside. According to The Old Farmer's Almanac, sturgeon were a staple food for Native Americans in the Great Lakes region, and the fish used to be a lot more abundant during mid- to late summer. Thus, scholars often refer to the fish as a living fossil. It's also a long-lived fish, with an average lifespan of 50 to 60 years."
  },
  {
    "title": "Our Favorite Back-to-School Picks for 2025",
    "slug": "our-favorite-back-to-school-picks-for-2025",
    "link": "https://www.cnet.com/tech/our-favorite-back-to-school-picks/#ftag=CAD590a51e",
    "published": "2025-08-06 17:15",
    "image": "https://www.cnet.com/a/img/resize/091a4fcf99466ae39cbf81ffe3d4024c02dc8ff5/hub/2024/06/26/35e347fa-8822-4a00-9b45-9e82ac72f54e/back-to-school-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Get prepared for the upcoming school year with our editors' handpicked back-to-school essentials.",
    "full_text": "A recent CNET survey found that 78% of US shoppers are worried about being able to afford back-to-school tech purchases. This handy, easy-to-use device can help with time management and reduce procrastination for scholars of all ages. There's also a stopwatch mode that can be used for timing other activities -- like workouts and cooking. Once their notes are safely stored, they can wipe the page clean with a damp cloth and start fresh. They can also choose between classic lined, custom dot grids or blank pages to suit their needs. Anker Zolo portable power bank Most students can't go one second without their phones, whether they're texting friends or looking up homework assignments. If you want to make sure their phone never runs out of juice, get them a power bank for easy charging on the go. Speck phone case Not only do you need to keep their phone juiced up, but you'll need to make sure it stays protected and can withstand the rigors of being thrown into a backpack or left on a gym floor. They're almost always less expensive and simpler to use than a laptop running Windows or MacOS. It's a one-stop shop for the essentials most elementary school kids will need this year."
  },
  {
    "title": "OpenAI is practically giving ChatGPT to the government for free",
    "slug": "openai-is-practically-giving-chatgpt-to-the-government-for-free",
    "link": "https://techcrunch.com/2025/08/06/openai-is-practically-giving-chatgpt-to-the-government-for-free/",
    "published": "2025-08-06 17:09",
    "image": "https://images.unsplash.com/photo-1597953531299-73c77242fe46?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxnc2ElMjBmZWRlcmFsJTIwYWNxdWlzaXRpb24lMjBzZXJ2aWNlJTIwY29tbWlzc2lvbmVyJTIwam9zaCUyMGdydWVuYmF1bXxlbnwwfHx8fDE3NTQ1MDA1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "GSA Federal Acquisition Service commissioner Josh Gruenbaum in a statement encouraged “other American AI technology companies to follow OpenAI’s lead and work with us.”",
    "full_text": "The partnership comes a day after the GSA added OpenAI, Google, and Anthropic to a list of approved AI vendors that can offer their services to civilian federal agencies. The companies will see their tools offered via the Multiple Award Schedule (MAS), a federal contracting platform that lets government agencies access AI tools via pre-negotiated contracts so they don’t have to negotiate with vendors individually. It’s not clear whether other AI firms are going to offer their services at such a discounted rate, though GSA Federal Acquisition Service commissioner Josh Gruenbaum in a statement encouraged “other American AI technology companies to follow OpenAI’s lead and work with us.” Data security is a top priority for government agencies that are concerned about sensitive information being leaked into model training sets. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “This ensures sensitive information remains protected while enabling agencies to benefit from AI‑driven efficiencies.” OpenAI’s discount comes a couple of weeks after the Trump administration published its AI Action Plan that seeks to boost data center buildouts and integrate more AI tools into government, among other things."
  },
  {
    "title": "Declutter Your Kitchen: Pro Chefs Detail the Most Useless Kitchen Tools",
    "slug": "declutter-your-kitchen-pro-chefs-detail-the-most-useless-kitchen-tools",
    "link": "https://www.cnet.com/news/declutter-your-kitchen-pro-chefs-detail-the-most-useless-kitchen-tools/#ftag=CAD590a51e",
    "published": "2025-08-06 17:00",
    "image": "https://www.cnet.com/a/img/resize/9b4d5a82318f7e9d00d3167fe21861d153faed65/hub/2025/06/12/96072141-0be4-4438-acd0-8f3e0cd37719/gettyimages-1483818193.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Not every kitchen gadget deserves the space they take up. These tools can be skipped, according to career chefs.",
    "full_text": "While essential kitchen utensils can speed up the process, not every option available is worth stuffing into your cabinets. Instead, cut the onion in half to create a flat surface so it won't roll away. Cookbook author Peter Som didn't hold back when asked about his least favorite kitchen tools. Why: \"Most of us grew up with an electric can opener permanently stationed on the kitchen counter, like it was a vital appliance. They take up space, can be a hassle to clean and often struggle with irregularly sized cans. Richard Ingraham avoids certain kitchen tools when cooking for celebs like Dwayne Wade and Gabrielle Union. What to try instead: Cracking an egg and using the shell halves or your fingers works just as well. What to try instead: Smashing garlic cloves with a chef knife is quicker and more reliable. These scissors are gimmicky, awkward to clean and take up more space than they're worth.\" The electric version just adds clutter unless you boil eggs constantly and hate using a stove.\""
  },
  {
    "title": "Best Sports Streaming Service for 2025",
    "slug": "best-sports-streaming-service-for-2025",
    "link": "https://www.cnet.com/tech/services-and-software/best-sports-streaming-service/#ftag=CAD590a51e",
    "published": "2025-08-06 17:00",
    "image": "https://www.cnet.com/a/img/resize/234de93d9c24df0feb8cc2bc4778b7fdfb965a28/hub/2025/02/12/ccd2a185-9d7c-44dc-9edd-865f5cc47a94/duke-vs-clemson.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The top sports streaming services differ depending on the sport. Rest assured, we've analyzed the options, covering everything from NFL to UFC fighting.",
    "full_text": "Streaming services generally don't carry these RSNs, but DirecTV and Fubo are the exceptions. DirecTV stands out as a top choice for its mix of RSNs and other channels that show sports, but other services are less expensive and may be better for casual fans who are satisfied with just watching national broadcast networks. You can use its channel lookup tool to see which local channels and RSNs are available in your area. ESPN Plus is heavily invested in global soccer, hosting LaLiga games from Spain and Germany's Bundesliga. ... Show more Get it now Save $20 and get an annual subscription for the price of 9 months (Then $119.99/yr) See at ESPN Specs & Configurations Simultaneous streams 3 Learn more ESPN Plus review Add to compare It includes ESPN, but not TBS and TNT -- which might be a problem for some sports fans. Sling Blue currently lacks a single RSN, but you can use it to watch some national broadcasts. And right now, you can get your first month for half off. But later this year, NBA on NBC will bring live basketball to the platform. Local channels/RSNs: You'll need a live streaming service to watch most RSNs without cable, but if you want to watch games on a local station, an antenna or basic live TV streaming package could meet your needs."
  },
  {
    "title": "Google’s AI coding agent Jules is now out of beta",
    "slug": "googles-ai-coding-agent-jules-is-now-out-of-beta",
    "link": "https://techcrunch.com/2025/08/06/googles-ai-coding-agent-jules-is-now-out-of-beta/",
    "published": "2025-08-06 16:00",
    "image": "https://images.unsplash.com/photo-1612398424065-c6880a7319bd?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxnb29nbGUlMjBjbG91ZCUyMHZpcnR1YWwlMjBtYWNoaW5lc3xlbnwwfHx8fDE3NTQ1MDMyMDV8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Powered by Gemini 2.5 Pro, Jules is an asynchronous, agent-based coding tool that integrates with GitHub, clones codebases into Google Cloud virtual machines, and uses AI to fix or update code while developers focus on other tasks.",
    "full_text": "“The trajectory of where we’re going gives us a lot of confidence that Jules is around and going to be around for the long haul,” she said. Korevec noted that Jules’ packaging and pricing are based on “real usage” insights gathered over the past couple of months. “The 15/day is designed to give people a sense of whether Jules will work for them on real project tasks.” Google also updated Jules’ privacy policy to be more explicit about how it trains AI. This week, Jules received a deeper integration with GitHub to open pull requests automatically — just like it could open branches — and a feature called Environment Snapshots to save dependencies and install scripts as a snapshot for faster, more consistent task execution. From vibe coding to mobile use, beta trials informed Jules’ development Google did not share specifics on Jules’ user base and its top geographies. Korevec said the company quickly enabled Jules to work even with an empty repository. Google Labs’ team also noticed an increasing number of users accessing Jules through their mobile devices. Alongside beta testers, Korevec stated that Google already uses Jules to help develop some projects internally, and there is now a “big push” to use the tool on “a lot more projects” at the company."
  },
  {
    "title": "Payment platform Lava raises $5.8M to build digital wallets for the ‘agent-native economy’",
    "slug": "payment-platform-lava-raises-5-8m-to-build-digital-wallets-for-the-agent-native-economy",
    "link": "https://techcrunch.com/2025/08/06/billing-platform-lava-raises-5-8m-to-build-digital-wallets-for-the-agent-native-economy/",
    "published": "2025-08-06 15:45",
    "image": "https://images.unsplash.com/photo-1430276084627-789fe55a6da0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsZXRzJTIwbWVyY2hhbnRzJTIwdXNlJTIwY3JlZGl0c3xlbnwwfHx8fDE3NTQ0OTYwMDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Lava is a digital wallet that lets merchants use credits to facilitate transactions.",
    "full_text": "A new startup, Lava Payments, aims to take on payment giants by building a solution for the modern web where AI agents now handle transactions for their customers. “I kept running into the same issue,” he told TechCrunch. Lava is a digital wallet that lets merchants use usage credits to facilitate transactions. The idea is that one set of credits working across merchants and services makes it easier for autonomous agents to make payments without needing human intervention. So, rather than having to pay for each tool, a user buys a one-time usage credit that AI agents can simply charge as they perform various tasks. “Without Lava, agents can’t move smoothly through the internet because they constantly get blocked when it comes time to pay,” he said. On Wednesday, the startup announced a $5.8 million seed round led by Lerer Hippeau. “We see the world as very interconnected,” Jones said about what makes his product different. “What we’re really focused on is building [for the] agent-native economy.” “We want to make sure that AI is something that can be used by every single person, even a kid from Dayton, like myself.”"
  },
  {
    "title": "Key sections of the US Constitution deleted from government’s website",
    "slug": "key-sections-of-the-us-constitution-deleted-from-governments-website",
    "link": "https://techcrunch.com/2025/08/06/key-sections-of-the-us-constitution-deleted-from-governments-website/",
    "published": "2025-08-06 15:29",
    "image": "https://images.unsplash.com/photo-1603058817990-2b9a9abbce86?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxrZXklMjBsZWdhbCUyMHByb3Zpc2lvbiUyMHJlbGF0aW5nfGVufDB8fHx8MTc1NDQ5NDIwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Internet sleuths say the U.S. Constitution's website is now missing key sections from its website, including a key legal provision relating to habeas corpus, which protects citizens from unlawful detention.",
    "full_text": "Several sections of Article 1 of the U.S. Constitution appear to have been removed from the official U.S. government website, as pointed out by sleuths on the internet and as seen by TechCrunch. Several Reddit threads identified the changes in Article 1 of the U.S. Constitution: Large parts of Section 8 have been removed, and Sections 9 and 10 have been deleted altogether. These sections largely relate to the powers that Congress has and does not have, as well as limitations on the powers of individual states. The removal includes sections relating to habeas corpus, the powers that protect citizens from unlawful detention. Some of the sections’ text appears to be missing, as indicated by a trailing semicolon at the end of Section 8, where text used to follow. In a tweet posted on Wednesday, the Library of Congress said the sections were missing “due to a coding error” and expect it to be “resolved soon.” When contacted by TechCrunch, a spokesperson for the Library of Congress did not say what caused the coding error, or how it was introduced. Changing the U.S. Constitution’s text on the website does not change or have any effect on U.S. law, but it nevertheless follows senior Trump administration official Stephen Miller’s threats earlier this year to suspend habeas corpus. When reached by TechCrunch, White House spokesperson Davis Ingle declined to comment beyond the Library of Congress’ post. Large sections of the U.S. Constitution were removed from the U.S. government’s official page Image Credits:TechCrunch (screenshot) Updated with more details from the Library of Congress, and with a response from the White House."
  },
  {
    "title": "Tavily raises $25M to connect AI agents to the web",
    "slug": "tavily-raises-25m-to-connect-ai-agents-to-the-web",
    "link": "https://techcrunch.com/2025/08/06/tavily-raises-25m-to-connect-ai-agents-to-the-web/",
    "published": "2025-08-06 15:15",
    "image": "https://images.unsplash.com/photo-1581631059833-17c59be479d4?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxvbGQlMjBzdGFydHVwJTIwcmFpc2VkfGVufDB8fHx8MTc1NDQ5NDIwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The one-year-old startup raised a Series A led by Insight Partners.",
    "full_text": "Companies across many industries are implementing AI agents for internal use, automating a wide range of tasks. Meanwhile, sales organizations are using AI agents to gather data on potential customers. These AI sales agents can scour the web and social media for information. To be effective, these agents need to access the internet and find information from relevant sources, all while following company policies and mirroring how a human researcher would work. Founded last year by data scientist Rotem Weiss, Tavily began as an open source project he created in 2023 called GPT Researcher. “It went extremely viral, so pretty fast we gained almost 20,000 GitHub stars.” They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "Citizen Lab director warns cyber industry about US authoritarian descent",
    "slug": "citizen-lab-director-warns-cyber-industry-about-us-authoritarian-descent",
    "link": "https://techcrunch.com/2025/08/06/citizen-lab-director-warns-cyber-industry-about-us-authoritarian-descent/",
    "published": "2025-08-06 15:01",
    "image": "https://images.unsplash.com/photo-1591451994715-7f5f3d9a4235?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwcm9taW5lbnQlMjBkaWdpdGFsJTIwaHVtYW4lMjByaWdodHMlMjBncm91cHMlMjBjaXRpemVuJTIwbGFifGVufDB8fHx8MTc1NDQ5MzMwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Ron Deibert, the head of the prominent digital human rights groups Citizen Lab, sounds the alarm at the Black Hat security conference about the \"dramatic descent into authoritarianism,\" but one that the cyber community can help to defend against.",
    "full_text": "Ahead of his talk, Deibert told TechCrunch that he plans to speak about what he describes as a “descent into a kind of fusion of tech and fascism,” and the role that the Big Tech platforms are playing, and “propelling forward a really frightening type of collective insecurity that isn’t typically addressed by this crowd, this community, as a cybersecurity problem.” Earlier this year, President Donald Trump ordered an investigation into former CISA director Chris Krebs, who had publicly rebuffed Trump’s false claims about election fraud by declaring the 2020 election secure. Easterly was herself a victim of political pressure from the Trump administration when her offer to join West Point was rescinded in late July. Deibert is also concerned that big companies like Meta, Google, and Apple could take a step back in their efforts to fight against government spyware — sometimes referred to as “commercial” or “mercenary” spyware — by gutting their threat intelligence teams. These threat intelligence teams are dedicated groups of security researchers that track government hackers, both those working inside government agencies, such as China’s Ministry of State Security or Russia’s intelligence agencies FSB and GRU, and companies such as NSO Group or Paragon. These are the same teams that are responsible for detecting hacks against their own users, such as when WhatsApp caught NSO Group hacking more than 1,400 of its users in 2019, or when Apple caught hackers using government spyware to target its customers and notified the victims of the attacks. Deibert believes there is a “huge market failure when it comes to cybersecurity for global civil society,” a part of the population that generally cannot afford to get help from big security companies that typically serve governments and corporate clients. “This market failure is going to get more acute as supporting institutions evaporate and attacks on civil society amplify,” he said. Deibert is concerned that these threat intelligence teams could be cut or at least reduced, given that the same companies have cut their moderation and safety teams. “But the question is how long will that last?” said Deibert."
  },
  {
    "title": "ESPN's Standalone Streaming Service and App to Launch Aug. 21",
    "slug": "espn-s-standalone-streaming-service-and-app-to-launch-aug-21",
    "link": "https://www.cnet.com/tech/services-and-software/espns-standalone-streaming-service-and-app-to-launch-aug-21/#ftag=CAD590a51e",
    "published": "2025-08-06 15:00",
    "image": "https://www.cnet.com/a/img/resize/ac669437ce07eba8f315ee494d1e4e6c8259c3ce/hub/2025/08/06/a97b26ad-c87e-4aef-9efa-3b3b8c0661f2/gettyimages-2226447220.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "With prices starting at just $30, with content from NFL Network and WWE, the new service looks like a tempting offer for sports fans.",
    "full_text": "The service, which will simply be called ESPN, will cost $30 as a standalone service or $36 a month if bundled with Disney+ and Hulu. Subscribers will receive access to all of ESPN's live games for all sports and programming from ESPN on ABC, ESPN2 and the SEC Network. On Wednesday, Disney-owned ESPN announced it will be acquiring the NFL Network, which includes the popular RedZone Channel and NFL Fantasy. ESPN also struck a deal with World Wrestling Entertainment for the US rights to show WrestleMania, the Royal Rumble and SummerSlam, starting in 2026. Disney CEO Bob Iger said ESPN's \"full suite of networks and services\" will be available on the streaming service. Paolo Pescatore, founder and TMT analyst at PP Foresight, said ESPN's streaming service launch announcement was an overall positive one. \"It is essential to empower fans with a slew of choices of how they watch and engage with content,\" he said. ESPN and Fox One will join an ever-expanding menu of sports streaming services available for all fans' tastes. Mike Proulx, vice president and research director at Forrester, said ESPN's streaming service launch will provide Disney a \"notable lift in revenue\" after being a tad below expectations. \"Disney is racing full force to sign sports rights with the company's NFL and WWE announcements,\" he said."
  },
  {
    "title": "Apple to announce $100B further commitment for US manufacturing",
    "slug": "apple-to-announce-100b-further-commitment-for-us-manufacturing",
    "link": "https://techcrunch.com/2025/08/06/apple-to-announce-100b-further-commitment-for-u-s-manufacturing/",
    "published": "2025-08-06 14:30",
    "image": "https://images.unsplash.com/photo-1605116900847-77c07153a083?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwcmV2aW91c2x5JTIwYW5ub3VuY2VkJTIwcGxhbnxlbnwwfHx8fDE3NTQ0OTE1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "This is on top of Apple's previously announced plan to invest $500 billion into the U.S. over the next four years.",
    "full_text": "In Brief Apple plans to increase its commitment to U.S. manufacturing, according to a White House official cited and first reported by Reuters. The tech giant is set to announce Wednesday another $100 billion in spending to help boost production of its products here in the U.S., after previously committing to invest $500 billion in the country over the next four years. The $500 billion commitment includes opening a new advanced manufacturing facility in Houston to produce servers that support Apple Intelligence, producing Apple TV+ productions in 20 U.S. states, and working with U.S. suppliers. The news comes as President Trump has threatened the iPhone maker with tariffs unless it moves more of its manufacturing from Asia to the United States. Apple, which mainly manufactures its devices in India, China, and Vietnam, has already been affected by tariffs. The company incurred $800 million in tariff-related costs during June and expects to spend $1.1 billion in the next quarter, CEO Tim Cook said during an earnings call last month."
  },
  {
    "title": "Play Assassin's Creed, Aliens and More on Xbox Game Pass Soon",
    "slug": "play-assassin-s-creed-aliens-and-more-on-xbox-game-pass-soon",
    "link": "https://www.cnet.com/tech/gaming/play-assassins-creed-aliens-and-more-on-xbox-game-pass-soon/#ftag=CAD590a51e",
    "published": "2025-08-06 14:12",
    "image": "https://www.cnet.com/a/img/resize/c7672b76cfc9402a80bc010ae7b08ed51c9db3a7/hub/2025/08/05/83d1e157-e3f8-4c69-9bfb-d55174179601/acmirage-hero-ec9a85a3f5692f4fa2a6-1900x1080.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Microsoft also brought a few more games to Game Pass Standard, too.",
    "full_text": "Here are the games Microsoft is bringing to Game Pass in August. In this survival platformer, you're a slugcat -- both adorable and dangerous -- in a broken ecosystem that's filled with overgrown plants and industrial waste. You have to survive in this world with nothing but your wits and trusty spear. This is the sequel to Lonely Mountains: Downhill, but up to eight players can join cross-platform multiplayer matches, so you and your block-headed friends can enjoy the fresh powder together. Your territory is being invaded in this game, and you lead a squad of five other mech pilots to turn the invasion back. Each hero in this game has their own unique play style, so pick the one that's most fun for you. And team up with others in four-player co-op to obliterate the chaotic, cartoonish hordes. You play as Basim, a cunning street thief who joins an ancient organization called the Hidden Ones. For more on Xbox, discover other games available on Game Pass now, read our hands-on review of the gaming service and learn which Game Pass plan is right for you. You can also check out what to know about upcoming Xbox game price hikes."
  },
  {
    "title": "Instagram takes on Snapchat with new ‘Instagram Map’",
    "slug": "instagram-takes-on-snapchat-with-new-instagram-map",
    "link": "https://techcrunch.com/2025/08/06/instagram-takes-on-snapchat-with-new-instagram-map/",
    "published": "2025-08-06 14:00",
    "image": "https://images.unsplash.com/photo-1588294566715-767838bf5b8a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0aW1lJTIwbG9jYXRpb24lMjB1cGRhdGVzfGVufDB8fHx8MTc1NDQ4OTcwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Instagram notes that location sharing is off by default on Instagram Map, and a user's location only updates when they open the app, meaning it doesn't provide real-time location updates.",
    "full_text": "The Meta-owned social network is also launching reposts, and making its “Friends” tab in Reels available globally. It’s worth noting that Instagram does offer real-time location sharing via DMs (direct messages). It also lets users explore location-based content that their friends and favorite creators have shared or engaged with. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Although Instagram is certainly taking on Snapchat with this new feature, it also has the opportunity to appeal to people who were fans of Zenly, a social map app that Snap acquired and then shut down in 2023. As for the new “Reposts” feature, Instagram is taking a page out of TikTok’s book while also creating its own version of the popular “retweet” function from Twitter (now X). For users who want to browse and interact with content privately, Instagram is rolling out the ability to opt out of having content you’ve engaged with shown in the friends tab."
  },
  {
    "title": "Tinder explores a redesign, dating ‘modes,’ and college-specific features to boost engagement",
    "slug": "tinder-explores-a-redesign-dating-modes-and-college-specific-features-to-boost-engagement",
    "link": "https://techcrunch.com/2025/08/06/tinder-explores-a-redesign-dating-modes-and-college-specific-features-to-boost-engagement/",
    "published": "2025-08-06 13:40",
    "image": "https://images.unsplash.com/photo-1606677549245-b8bb3fd820d4?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx5b3VuZ2VyJTIwdXNlcnN8ZW58MHx8fHwxNzU0NTAwNTA3fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Tinder will redesign and debut college-specific features, like searching for people within the college, to appeal to younger users.",
    "full_text": "During Match’s second-quarter earnings call, Match Group CEO Spencer Rascoff said that Tinder will debut a new feature called “modes,” which will allow users to switch between different dating goals to explore new connections in real time. Tinder will also explore a broader redesign and other new features, including those aimed at college students, to drive more usage among Gen Z. The changes arrive amid a mixed quarter for the dating app giant, which reported flat year-over-year revenue of $864 million and earnings that declined from $133.3 million year-over-year to $122.5 million in Q2. Match also announced it would invest $50 million in product development, as the dating app maker aims to connect with younger Gen Z users and use AI to improve its products. “We’re on track to test version one of a redesigned ‘see who likes you’ tab this fall with the goal of helping users connect with people they’re more likely to be interested in, as well as to drive more revenue,” he added. In the case of the latter, Tinder continues to experiment with AI-powered matching, which it debuted in New Zealand earlier this year. “The interactive matching experience we’ve been testing in New Zealand is specifically designed to appeal to this type of audience [users under 30]: Somebody who doesn’t just want to be judged based on their physical appearance. The company also offered an update on Tinder’s Double Date option, launched in June, that lets users pair up with a friend to match with another couple. This was Rascoff’s first full quarter at the helm of Match Group, as the Zillow Group co-founder and Match board member was appointed CEO in February. The company also laid off 13% of its staff (around 325 people) in May, and closed open roles."
  },
  {
    "title": "Cohere’s new AI agent platform, North, promises to keep enterprise data secure",
    "slug": "coheres-new-ai-agent-platform-north-promises-to-keep-enterprise-data-secure",
    "link": "https://techcrunch.com/2025/08/06/coheres-new-ai-agent-platform-north-promises-to-keep-enterprise-data-secure/",
    "published": "2025-08-06 13:32",
    "image": "https://images.unsplash.com/photo-1593407089396-93f0c7a575f0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjdXN0b21lcnMlMjAlMjclMkMlMjBkYXRhJTIwc2FmZSUyMGJlaGluZHxlbnwwfHx8fDE3NTQ0ODc5MDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Canadian AI firm Cohere aims to alleviate data privacy concerns with its new AI agent platform, North, which can be deployed privately so that enterprises and governments can keep their, and their customers', data safe behind their own firewalls.",
    "full_text": "AI agent tools promise to siphon out some of the drudgery from daily workflows, but most organizations are hesitant to adopt them yet, harboring a pressing concern: data security. Instead of using enterprise cloud platforms like Azure or AWS, Cohere says it can install North on an organization’s private infrastructure so that it never sees or interacts with a customer’s data. “We can deploy literally on a GPU in a closet that they might have somewhere,” he explained, adding that North was designed to run on as few as two GPUs. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. The chat and search functions are powered by existing Cohere technology, like Command (its family of generative AI models) and Compass (its multimodal search tech stack). “It goes beyond just Q&A and gets into doing work for you. Correction: A previous version of this article misstated Frosst’s title."
  },
  {
    "title": "Two arrested for smuggling AI chips to China — Nvidia says no to kill switches",
    "slug": "two-arrested-for-smuggling-ai-chips-to-china-nvidia-says-no-to-kill-switches",
    "link": "https://techcrunch.com/2025/08/06/two-arrested-for-smuggling-ai-chips-to-china-nvidia-says-no-to-kill-switches/",
    "published": "2025-08-06 13:02",
    "image": "https://images.unsplash.com/photo-1592214468571-0a38317ef79e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0d28lMjBjaGluZXNlJTIwbmF0aW9uYWxzfGVufDB8fHx8MTc1NDQ4NjEwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The U.S. Department of Justice (DOJ) said on Tuesday that two Chinese nationals have been arrested for their alleged involvement in illegally shipping \"tens of millions of dollars\" worth of high-performance AI chips to China.",
    "full_text": "A report by Reuters specifically named Nvidia’s H100 GPUs as the chips being shipped. “We primarily sell our products to well-known partners, including OEMs, who help us ensure that all sales comply with U.S. export control rules. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “Nvidia has been designing processors for over 30 years. “It would undermine global digital infrastructure and fracture trust in U.S. technology. Established law wisely requires companies to fix vulnerabilities — not create them.” For more on the semiconductor industry’s tumultuous year so far, here’s a regularly updated timeline of market news since the beginning of 2025."
  },
  {
    "title": "Photo-sharing app Locket is banking on a new celebrity-focused feature to fuel its growth",
    "slug": "photo-sharing-app-locket-is-banking-on-a-new-celebrity-focused-feature-to-fuel-its-growth",
    "link": "https://techcrunch.com/2025/08/06/photo-sharing-app-locket-is-banking-on-a-new-celebrity-focused-feature-to-fuel-its-growth/",
    "published": "2025-08-06 13:00",
    "image": "https://images.unsplash.com/photo-1557928816-93c6683fbfea?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjBmZWF0dXJlfGVufDB8fHx8MTc1NDQ4NjEwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Celebrity Lockets is a new feature where celebrities can engage with their most loyal followers on their home screens.",
    "full_text": "The app claims to have over 80 million total downloads and more than 9 million daily active users, and its users have shared more than 10 billion photos to date. Notably, the company also shared with TechCrunch that it achieved profitability in 2024, a significant accomplishment given its relatively modest fundraising efforts of just $12.5 million. To drive additional growth, Locket has been quietly testing a feature called “Celebrity Lockets” for the past six months, which the app officially announced on Wednesday. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. This also preserves the same intimacy and brand of Locket as a product today … We knew our community used Locket to share music with their friends, so being able to also connect with their favorite artists is a natural evolution for the platform,” Moss said. Although Moss says the feedback from testers has been good, it’s unclear whether this will help Locket grow its user numbers. BeReal tried something similar with a feature called “RealPeople,” but the reception wasn’t entirely positive, with some people saying that they preferred the anti-social media app as a way to escape from celebrities."
  },
  {
    "title": "Final call: TechCrunch Disrupt 2025 ticket savings end tonight",
    "slug": "final-call-techcrunch-disrupt-2025-ticket-savings-end-tonight",
    "link": "https://techcrunch.com/2025/08/06/final-call-techcrunch-disrupt-2025-ticket-savings-end-tonight/",
    "published": "2025-08-06 13:00",
    "image": "https://images.unsplash.com/photo-1703192163894-dbc99acc00d5?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZWNoY3J1bmNoJTIwZGlzcnVwdCUyMDIwMjUlMjBtYXJrcyUyMDIwJTIweWVhcnN8ZW58MHx8fHwxNzU0NDAzMzA2fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "TechCrunch Disrupt 2025 marks 20 years of shaping the startup world — and tonight’s your last chance to save up to $675 on your ticket. From October 27–29, Disrupt returns to Moscone West in San Francisco. Join 10,000+ tech innovators, founders, VCs, and ecosystem builders for three days of high-impact programming, networking, and startup energy. […]",
    "full_text": "From October 27–29, Disrupt returns to Moscone West in San Francisco. Where tech meets the cosmos Going Public Stage: Candid lessons from companies that made it They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Braindate helps you find those key conversations that move your goals forward, whether in a 1:1 or small-group format. Plus, your reserved seat at the exclusive StrictlyVC session on Day 2 awaits. Plus, your reserved seat at the exclusive session on Day 2 awaits. Register now and lock in your savings before prices go up after tonight."
  }
]