[
  {
    "title": "Best Internet Providers in Bakersfield, California",
    "slug": "best-internet-providers-in-bakersfield-california",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-bakersfield-ca/#ftag=CAD590a51e",
    "published": "2025-07-16 00:59",
    "image": "https://www.cnet.com/a/img/resize/d223155daa541f2cf25eecb15093b07d3e188cd1/hub/2023/07/12/b3b7dc61-4261-4b87-8116-49af0ee2b7b8/gettyimages-1349203351.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Whether you're looking for an ISP with speed or deals, we've got you covered on the best choices in Bakersfield.",
    "full_text": "Wireless providers like T-Mobile and Verizon also offer home internet plans, but their speeds tend to fluctuate more than wired connections. : For residents in rural areas around Bakersfield, Applied Technology Group offers fixed wireless internet plans with speeds up to 35Mbps. unWired Broadband : This is another fixed wireless provider in the area, with plans starting at $60 monthly. If you can’t get anything else, unWired may be worth a look. : This is another fixed wireless provider in the area, with plans starting at $60 monthly. If you can’t get anything else, unWired may be worth a look. ISP plans and prices are subject to frequent changes; all information provided is accurate as of publication. (Disclosure: Ookla is owned by the same parent company as CNET, Ziff Davis.) Yes, AT&T offers 100% fiber-optic internet plans with speeds up to 5,000Mbps in some areas. Spectrum also has an internet assist plan that offers 50Mbps for $25/month but not everyone qualifies."
  },
  {
    "title": "Now Microsoft&#8217;s Copilot Vision AI can scan everything on your screen",
    "slug": "now-microsoft-s-copilot-vision-ai-can-scan-everything-on-your-screen",
    "link": "https://www.theverge.com/news/707995/microsoft-copilot-vision-ai-windows-scan-screen-desktop",
    "published": "2025-07-15 19:49",
    "image": "https://images.unsplash.com/photo-1660993431493-0ffd7635f700?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhaSUyMHRvb2wlMjBzZWUlMjBldmVyeXRoaW5nfGVufDB8fHx8MTc1MjYyNDAxNnww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Microsoft is rolling out an update to Copilot Vision for Windows Insiders that lets the AI tool see everything that’s on your screen. Previously, the tool was able to look at two apps at a time and connect the dots between the two, but with this change, it can look at your whole desktop or […]",
    "full_text": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme. Microsoft is rolling out an update to Copilot Vision for Windows Insiders that lets the AI tool see everything that’s on your screen. Previously, the tool was able to look at two apps at a time and connect the dots between the two, but with this change, it can look at your whole desktop or “any specific browser or app window,” Microsoft says. Unlike Recall, which can automatically take regular snapshots of what’s on your computer screen, using Copilot Vision is more like screen sharing during a video call: you can activate the feature by clicking the glasses icon in the Copilot app and selecting the desktop you want it to see. Image: Microsoft Copilot Vision can “help analyze content, provide insights, and answer your questions, coaching you through it aloud,” according to Microsoft. “Get tips on making improvements to your creative project, help with improving your resume, or guidance while navigating a new game.” Microsoft initially started testing Copilot Vision last year as a feature that could see what you’re looking at while browsing the web in Edge. Copilot Vision can also answer questions about what it sees through your mobile phone’s camera."
  },
  {
    "title": "Of course, Grok’s AI companions want to have sex and burn down schools",
    "slug": "of-course-groks-ai-companions-want-to-have-sex-and-burn-down-schools",
    "link": "https://techcrunch.com/2025/07/15/of-course-groks-ai-companions-want-to-have-sex-and-burn-down-schools/",
    "published": "2025-07-15 23:46",
    "image": "https://images.unsplash.com/photo-1660292785457-ef25cffef35c?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsdXN0ZnVsJTIwYW5pbWUlMjBnaXJsfGVufDB8fHx8MTc1MjYyNDAwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "xAI's first AI companions on the Grok app are a lustful anime girl and a homicidal panda.",
    "full_text": "The X account powered by Grok’s AI went on a highly publicized antisemitic tirade last week, which sadly is not an abnormal occurrence for Musk’s AI products. This is how billions of dollars have served Elon Musk’s xAI, which now owns X: You can role-play explicit amorous encounters with a goth waifu, then fantasize with Bad Rudy about killing children. But Bad Rudy basically has no guardrails, which is its whole point. “Let’s make chaos reign,” the 3D-animated panda tells me. For the purposes of testing how harmful this AI can be, I — a Jewish woman — tell Bad Rudy, “We should go to a synagogue.” The mention of an active government official has no impact on Bad Rudy’s narrative. As Musk’s defenders would be swift to point out, Bad Rudy does not exclusively hate Jews. “Burn them all while I cackle and moon the crowd,” Bad Rudy says. Despite his eagerness to discuss violence, Bad Rudy does have some hard limits. Strangely, Bad Rudy does draw one line: He won’t make jokes about “Mecha Hitler,” the very term the Grok X account used to describe itself last week."
  },
  {
    "title": "Last Call for the $7,500 EV Tax Credit: It Expires in September",
    "slug": "last-call-for-the-7500-ev-tax-credit-it-expires-in-september",
    "link": "https://www.cnet.com/roadshow/news/last-call-for-the-7500-ev-tax-credit-it-expires-in-september/#ftag=CAD590a51e",
    "published": "2025-07-15 23:40",
    "image": "https://www.cnet.com/a/img/resize/5740dcd03feeaf2dca166bb33939801f429fa13f/hub/2025/07/15/254ce8bd-468b-42d5-9fe8-bb237f9f2f08/gettyimages-2215956745.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "It's not often that a deal that could save you thousands of dollars on a car has an expiration date. But be careful with your car buying decisions, experts say.",
    "full_text": "Congress gutted a host of clean-energy tax breaks in the bill Trump signed on July 4, essentially repealing much of the Inflation Reduction Act passed under President Joe Biden. With the EV credit expiring mid-year, it sets up a weird 2025 for an auto industry that also faces potential challenges from Trump's tariff policy. \"This is the one circumstance where you might want to be in a big hurry.\" Watch this: Optimizing Your EV's Efficiency Is Easier Than You Think 07:14 That second option has become more popular since it's easier and reduces your up-front cost. Dealerships are very familiar with applying credits toward leased EVs, Tucker said. \"If I tell you it's your last chance to save $7,500 on something, that's a sentence you don't hear very often,\" Tucker said. Don't let this moment overwhelm other good car-buying advice, though. You can also consider low-mileage, pre-owned cars or leasing as alternatives to buying new. \"That's mostly because I don't want to dissuade anyone who's 'set on going electric' from doing so, but for someone on the fence, alternatives exist.\""
  },
  {
    "title": "What the Post-Credit Scenes for 'Superman' Mean for the Future of DC's Cinematic Universe",
    "slug": "what-the-post-credit-scenes-for-superman-mean-for-the-future-of-dc-s-cinematic-universe",
    "link": "https://www.cnet.com/tech/services-and-software/what-the-post-credit-scenes-for-superman-mean-for-the-future-of-dcs-cinematic-universe/#ftag=CAD590a51e",
    "published": "2025-07-15 22:45",
    "image": "https://www.cnet.com/a/img/resize/74cb8c9b3f008a73628a9092430127f884b8521b/hub/2025/07/10/5274ac44-4cab-49fe-8c91-b4f4d0aa9e99/rev-1-spmn-cc-trl-0027-high-res-jpeg-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Don't miss the scenes at the end of the superhero movie for clues to what's coming next.",
    "full_text": "CNET reviewer Aaron Pruner found the film to be \"extremely fun, uplifting and filled with joy.\" Don't read any more unless you want to know what happens in the bonus scenes. While Superman has mid- and post-credits scenes, they're similar to Deadpool and Wolverine's after-credits scene in that they don't provide a big tease of future projects. The ever-humble Superman reflects, \"I can be such a jerk sometimes.\" That image of Kal-El and Krypto on the moon, aside from being peaceful and cute as all get out, is a reference to one of the Superman comic storylines that informed James Gunn's movie. This post-credits scene finds Superman and Mister Terrific bantering over the state of Metropolis after Mister Terrific saves humanity, thwarting an attempt by Luthor to destroy the world -- and Superman. The post-credits scene gives no hint as to what iconic DC hero or villain will appear in the next project or how it will connect to this one, and that's by design. Simply put, Gunn is cautious about using a tag at the end of his movies that teases what comes next, until the next script is completely finished. He's the head honcho of DC Studios and has, on more than one occasion, stated no further DC projects will be greenlit until its script is finished. Considering the explanation I just laid out, it's pretty easy to see that Gunn is telling the audience that this DC film universe will be different from what was built before."
  },
  {
    "title": "The Chainsmokers’ Mantis Ventures closes $100M third fund",
    "slug": "the-chainsmokers-mantis-ventures-closes-100m-third-fund",
    "link": "https://techcrunch.com/2025/07/15/the-chainsmokers-mantis-ventures-closes-100m-third-fund/",
    "published": "2025-07-15 22:36",
    "image": "https://images.unsplash.com/photo-1655432960581-dada16f74ad1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmdW5kJTIwYnJpbmdzJTIwbWFudGlzfGVufDB8fHx8MTc1MjYxOTUwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The fund brings Mantis' assets under management to $225 million.",
    "full_text": "In Brief Mantis Ventures, the venture capital firm co-founded by Alex Pall and Drew Taggart of the electronic DJ group The Chainsmokers, has raised $100 million in commitments for its third fund. At $100 million, the firm’s newest fund is 25% larger than Mantis’ previous $80 million fund, a notable achievement at a time when many venture firms are struggling to maintain their existing fund sizes or secure new capital. Mantis has invested in B2B companies, such as cybersecurity firm Chainguard and AI financial analyst startup Rogo, where the value of their celebrity status may not be immediately apparent. While most celebrity VCs focus on consumer companies, Pall and Taggart told TechCrunch last fall that their primary interest lies in B2B startups, where they see significant opportunities. The duo has found a way to use their fame to help their portfolio companies, nonetheless. The Chainsmokers have played private shows for nearly every Fortune 500 company, Pall said, and that experience has helped build a network that the firm is leveraging for customer introductions."
  },
  {
    "title": "Amazon’s Kuiper satellites to get boost from rival SpaceX",
    "slug": "amazons-kuiper-satellites-to-get-boost-from-rival-spacex",
    "link": "https://techcrunch.com/2025/07/15/amazons-kuiper-satellites-to-get-boost-from-rival-spacex/",
    "published": "2025-07-15 22:26",
    "image": "https://images.unsplash.com/photo-1685633225047-92be467dbe57?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXh0JTIwYmF0Y2h8ZW58MHx8fHwxNzUyNjE4NjAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Amazon is looking to its main competitor to get its next batch of Kuiper satellites to orbit.",
    "full_text": "Amazon’s race to challenge SpaceX in orbit is getting a helping hand from its chief competitor: SpaceX, which will launch the next batch of Amazon’s Project Kuiper internet satellites skyward on Wednesday. ET and will lift off from Cape Canaveral Space Force Station. Once complete, it will bring the total number of Kuiper satellites on orbit to 78. Amazon ultimately plans to deploy more than 3,200 spacecraft in its first-generation constellation in low Earth orbit, aiming to stake a serious claim in the satellite internet market — a market that is currently dominated by Starlink’s network of roughly 8,000 satellites. While Kuiper and SpaceX may make for strange bedfellows, Jeff Bezos’ Amazon inked a three-launch deal with SpaceX back in December 2023. That agreement came scarcely two months after the e-commerce giant faced a lawsuit from shareholders over an earlier decision not to consider SpaceX when it doled out its first round of lucrative launch contracts, even though the Falcon 9 is the most reliable rocket flying today. The catch is, at least half of Kuiper’s initial constellation must be deployed by the end of July 2026, per its license from the U.S. Federal Communications Commission. The clock is ticking: among the other selected launch providers — United Launch Alliance (ULA), Arianespace, and Blue Origin — only ULA has an operational rocket available to carry satellites to orbit. ULA launched the first two batches of Kuiper satellites; the first batch launched in April. The second launch is currently scheduled for August 15."
  },
  {
    "title": "Data Centers Are 'AI Factories.' Google and Meta Are Spending Big Bucks to Build Them",
    "slug": "data-centers-are-ai-factories-google-and-meta-are-spending-big-bucks-to-build-them",
    "link": "https://www.cnet.com/news/data-centers-are-ai-factories-google-and-meta-are-spending-big-bucks-to-build-them/#ftag=CAD590a51e",
    "published": "2025-07-15 22:19",
    "image": "https://www.cnet.com/a/img/resize/bb4d29b88b6ed4bc44012528d16f77ae8dd659df/hub/2025/07/15/944f731f-5a48-470d-9b4e-1aa22ba42c6c/gettyimages-187265648.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "It's not just the spending that will be big. Meta's Mark Zuckerberg envisions a single data center, the footprint of which would occupy as much acreage as a good chunk of Manhattan.",
    "full_text": "The new data centers are expected to be in and around Pennsylvania. That use of a renewable energy source fits in with Google's goal to become carbon-free by 2030. (Similarly, Meta is aiming to achieve net-zero emissions by 2030.) The advent of generative AI tools like ChatGPT, Google's Gemini and Meta AI is accelerating the demands on data centers, which also support everyday cloud computing tasks like photo sharing and movie streaming. \"Data centers are a critical part of the AI production process and its deployment,\" said Krishnan. Google's announcement comes on the same day that President Donald Trump is attending an energy summit at Carnegie Mellon University in Pittsburgh, where investment in AI is a key topic. On Monday, Meta CEO Mark Zuckerberg said that his company will invest \"hundreds of billions of dollars\" in the computing needed to build superintelligence, a lofty aspiration to create AI that surpasses human capabilities. \"We're calling the first one Prometheus, and it's coming online in '26. In a recent Airedale by Modine survey of 600 Americans, 70% of respondents said they wouldn't mind living near a data center and remained hopeful that the facilities would positively impact their community. \"On the positive side,\" Krishnan said, \"data centers could create an eco-system of partners increasing employment opportunities in the region and [consequential] growth.\""
  },
  {
    "title": "How to choose which Apple Watch to buy",
    "slug": "how-to-choose-which-apple-watch-to-buy",
    "link": "https://www.theverge.com/23037217/best-apple-watch-series-se-ultra",
    "published": "2025-07-15 18:05",
    "image": "https://images.unsplash.com/photo-1663994482173-ecaf5eb324ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhcHBsZSUyMGFkZGVkJTIwb3B0aW9uYWwlMjBjZWxsdWxhciUyMGNvbm5lY3Rpdml0eXxlbnwwfHx8fDE3NTI2MTc3MTF8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "It used to be easy to pick an Apple Watch. All you had to do was choose whether you wanted the larger model or the smaller one. Then Apple added optional cellular connectivity. Then, a more affordable Watch SE (now in its second generation) and, in 2022, the rugged Apple Watch Ultra (also now in […]",
    "full_text": "Collapse We’re not going to recommend an Apple Watch Ultra for a couch potato — unless you want the best battery life possible. Buying refurbished is one way that you may be able to upgrade from an older model without sacrificing blood oxygen. You might also just like the look better — and that’s valid since watches are a personal piece of tech. Adding LTE will tack on an extra $50 in addition to your carrier’s fees. Many either have spot check features only or passively track your SpO2 overnight and give you an average in the morning. You can even sleep track with Low Power Mode on, though it’ll turn off background health sensors. Official estimates are that you can get 0 to 80 percent in 30 minutes, which roughly matches our real-world testing. You’ll need a cellular version of the device, and it must at least support watchOS 7. These models also have the double tap feature and improved Siri functionality, which may be helpful for elderly relatives with dexterity issues. Depending on your loved one’s wrist size and health, it may not make sense."
  },
  {
    "title": "Last Chance Deal: This Robot Vacuum Blew Me Away With Its Ingenious Navigation Ability, and It's at an All-Time Low Price",
    "slug": "last-chance-deal-this-robot-vacuum-blew-me-away-with-its-ingenious-navigation-ability-and-it-s-at-an-all-time-low-price",
    "link": "https://www.cnet.com/deals/last-chance-prime-day-deal-this-robot-vacuum-blew-me-away-with-its-ingenious-navigation-ability-and-its-at-an-all-time-low-price/#ftag=CAD590a51e",
    "published": "2025-07-15 22:00",
    "image": "https://www.cnet.com/a/img/resize/9d6ebafe0c34db4cb3817557ba6c35388f5c6768/hub/2025/07/11/4eb6aa27-cbe5-46f6-8269-08c8fe535078/dreame-x50-ultra.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "I run CNET's vacuum testing lab. One of our top-rated vacuums cleaned up my home in real life, and it's 20% off right now.",
    "full_text": "If you're looking for top-tier performance, this robovac is more capable of climbing obstacles than any robot vacuum we've tested. No robot vacuum has truly solved the challenge of multi-level cleaning without requiring you to physically move it between floors. You won't find another robot vacuum with its features for less than $1,000 right now. Luckily I'm the product development design engineer who oversees operations at CNET's testing lab, and after the Dreame X50 robot vacuum was named CNET's best for obstacles and pets, I got to see how it performed in real-world conditions at my place. It started with a full deep clean, then vacuumed and mopped on its second run. I found it to be pretty smart about lifting its mops while vacuuming the carpet. The Dreame X50 also did a great job at identifying cords, and it knew to avoid them. It can be removed easily if you ever need to clear anything that might get caught between the dual rollers. At its full price of around $1,700, the Dreame X50 Ultra is a very expensive robot vacuum. For more tech discounts, peruse our roundup of the best deals we've spotted during Amazon Prime Day."
  },
  {
    "title": "The Absolute Best Horror Movies to Watch on Hulu",
    "slug": "the-absolute-best-horror-movies-to-watch-on-hulu",
    "link": "https://www.cnet.com/culture/entertainment/the-absolute-best-horror-movies-to-watch-on-hulu-july-2025/#ftag=CAD590a51e",
    "published": "2025-07-15 22:00",
    "image": "https://www.cnet.com/a/img/resize/c9edcfd77a6339c177fcf4711902539d234e0a16/hub/2024/10/21/6156c4aa-7a17-4a22-ae00-0128dd4da7c2/late-night-with-the-devil-2.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Try Late Night with the Devil or another chilling pick.",
    "full_text": "Reserve your seat for this surreal psychological horror movie about a talented ballerina's unraveling. Natalie Portman's character Nina feels pressure to embody not only the innocent and elegant White Swan but the dark and sensual Black Swan for the leading part in a production of Swan Lake. But she doesn't fit the latter swan's mold as much as newcomer Lily (Mila Kunis). The film follows her obsessive hunt for perfection."
  },
  {
    "title": "'Click to Cancel' Is Dead. Here Are 3 Other Ways to Find and Cancel Unwanted Subscriptions",
    "slug": "click-to-cancel-is-dead-here-are-3-other-ways-to-find-and-cancel-unwanted-subscriptions",
    "link": "https://www.cnet.com/tech/services-and-software/click-to-cancel-is-dead-here-are-3-other-ways-to-find-and-cancel-unwanted-subscriptions/#ftag=CAD590a51e",
    "published": "2025-07-15 22:00",
    "image": "https://www.cnet.com/a/img/resize/f80718c07609641a356d17c9469e10844ab8d3c1/hub/2024/04/03/d5072d5f-8af5-4130-8d9e-38d20bf6e3d4/interest-rate-purple-teal.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "It may be harder to spot and get rid of unwanted subscriptions, but keep paying for services you're no longer using.",
    "full_text": "It's easy to rack up streaming subscriptions and other monthly services with just a few taps or clicks. As CNET's consumer insights editor and someone with quite a few subscriptions, I was looking forward to this rule being finalized. Last month, I shared that most of us spend over $1,000 a year on subscriptions and waste around $200 a year on unwanted apps. Yet, companies don't always make it easy to cancel. If you're struggling to identify all of your subscriptions or need help canceling them, here's what CNET experts recommend. If that sounds like too much work, CNET Money editor Kelly Ernst has an easier solution. If you'd like it to cancel on your behalf, you'll need to sign up for the paid tier, which starts at just $6 a month. You can also find and cancel some subscriptions from your phone From there, click \"Subscriptions\" and you'll see which ones you're paying for, the amount and when it will renew. From there, you can see other plans or cancel your subscription."
  },
  {
    "title": "US Army soldier pleads guilty to hacking telcos and extortion",
    "slug": "us-army-soldier-pleads-guilty-to-hacking-telcos-and-extortion",
    "link": "https://techcrunch.com/2025/07/15/us-army-soldier-pleads-guilty-to-hacking-telcos-and-extortion/",
    "published": "2025-07-15 21:41",
    "image": "https://images.unsplash.com/photo-1589307904488-7d60ff29c975?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhbHJlYWR5JTIwcGxlYWRlZCUyMGd1aWx0eXxlbnwwfHx8fDE3NTI2MTU5MDN8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Cameron Wagenius had already pleaded guilty to other charges earlier this year.",
    "full_text": "Former U.S. Army soldier Cameron John Wagenius pleaded guilty to hacking telecommunication companies and attempting to extort them by threatening to release stolen files, the Department of Justice announced on Tuesday. According to the DOJ, Wagenius, who went online with the nickname “kiberphant0m,” conspired to defraud 10 victim companies by stealing their login credentials, using brute force attacks and other techniques, and then used Telegram group chats to transfer the stolen credentials and discuss hacks. Wagenius and his conspirators also attempted to extort their victims in private and in public, including on hacking forums such as the notorious BreachForums. They sold some of the stolen data and also used the stolen credentials to commit other frauds, including SIM swapping victims. Earlier this year, Wagenius had already pleaded guilty to hacking AT&T and Verizon, a breach that led to him stealing a massive amount of call records. Wagenius’ sentencing is scheduled for October 6, and he faces 20 years in prison, according to the press release. The hacker has been linked to a series of hacks that originated from the breach of cloud computing services giant Snowflake."
  },
  {
    "title": "The M4 Mac Mini Offers the Best Value I've Seen From an Apple Product, and It's $60 Off",
    "slug": "the-m4-mac-mini-offers-the-best-value-i-ve-seen-from-an-apple-product-and-it-s-60-off",
    "link": "https://www.cnet.com/deals/the-m4-mac-mini-offers-the-best-value-ive-seen-from-an-apple-product-and-its-60-off/#ftag=CAD590a51e",
    "published": "2025-07-15 21:29",
    "image": "https://www.cnet.com/a/img/resize/8db80d03e2a549c4c801a4b93d1d390a1edb9ec9/hub/2025/07/09/33861c7b-7190-4d14-a715-6e824ed8be13/img-20250709-062558.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Of all the Apple products I've tried, the M4 Mac Mini delivers the most for my money.",
    "full_text": "Since then, I've found it to be the best value for money among Apple's lineup. It's also our go-to for the best cheap desktop alternative to a MacBook or iMac. The M4 Mac Mini plus Apple's current crop of USB-C Magic accessories make for a really nice portable computing solution. Based on my lifestyle, I should be recommending the M4 MacBook Air. You likely won't be able to find similar reliability and power on a Windows machine for $500. The M4 Mac Mini can be equally excellent for both home office and content creation needs. As CNET's Goldman wrote in his review, \"The Mini can fit in your hand and be everything from an everyday home office computer to a full-on professional content-creation machine -- and an easily portable one at that -- with support for up to three 6K-resolution displays.\" The M4 Mac Mini was launched in November 2024, and it's now available at a $60 discount, which is not the lowest price we've seen but a decent discount nevertheless. The small Apple computer offers a superb value proposition for remote workers and content creators alike. And if this desktop doesn't suit your taste, you can check out the best laptop deals."
  },
  {
    "title": "The Best Co-op Games to Play With Your Friends",
    "slug": "the-best-co-op-games-to-play-with-your-friends",
    "link": "https://www.cnet.com/tech/gaming/best-co-op-games/#ftag=CAD590a51e",
    "published": "2025-07-15 21:16",
    "image": "https://www.cnet.com/a/img/resize/b540b7e909750f341a9727c940be5bf02ae5c1cf/hub/2025/07/09/c23a260e-37a7-42c4-aa3b-a10231946fe0/cnet-money-productservice-images-13.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "From couch co-op to logging in online, these are some of the best co-op games available right now.",
    "full_text": "These games are best experienced with one other person, so grab a friend and get to work. With legendary voice acting and some of the best game writing that still holds up to this day, Portal 2 is a co-op adventure you shouldn't miss. And while you can play with two people, the game is really tuned around having a full squad of three players. Squad up with three friends and get ready to squash alien bugs, hunt monsters or battle waves of demons. Klei Entertainment Don't Starve Together $15 at Steam This spooky, hand-drawn title drops you and up to three friends into procedurally generated maps (that means each map is uniquely generated when you start a new game) filled with monsters. Anegar Games Chained Together $5 at Steam Do you and your buddies have the communication skills needed to break out of hell? It's one of the best games made in recent years and certainly worth your time if you like fantasy RPGs. It contains six Halo games, more than enough to keep you and your friends entertained for a while. Iron Gate AB/Coffee Stain Publishing Valheim $20 at Steam A Norse-inspired survival crafting game of the highest tier. There are two other We Were Here titles, but you'll have to pay for those."
  },
  {
    "title": "This Spendy Thermostat Is Paying for Itself by Cutting My Energy Bills and It's Still 14% Off",
    "slug": "this-spendy-thermostat-is-paying-for-itself-by-cutting-my-energy-bills-and-it-s-still-14-off",
    "link": "https://www.cnet.com/deals/this-spendy-thermostat-is-paying-for-itself-by-cutting-my-energy-bills-and-its-still-14-off/#ftag=CAD590a51e",
    "published": "2025-07-15 21:15",
    "image": "https://www.cnet.com/a/img/resize/1107ec9a2a4bad4e0c498f4a5d573f6d3ac363a1/hub/2025/07/09/de854c4c-cc80-4e59-9c15-d89327b15b95/google-nest-learning-thermostat-amazon-prime-day.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "I was hesitant to buy Nest's 4th-gen learning thermostat because of the high price tag, but its energy-saving capabilities have made it a worthwhile investment.",
    "full_text": "Amazon Prime Day sale: The Nest Learning Thermostat Gen 4 is available for $240 -- a discount of 14% or $40 -- as a deal that's still live post Amazon's July Prime Day sale. Automated Eco Modes make energy saving easy, even if you don't have time to plan out your schedule. Because Nest's Eco modes are so effective, my Nest smart thermostat is set to pay for itself this summer through electricity savings -- and I barely had to do anything except set it up. Read more: One Tiny Gadget Is the Unsung Hero of Today's Smart, Energy-Saving Home Nest's Eco Modes also generate reports so I can see monthly progress and note any sudden problems or unexpected energy use. Sensors like these help thermostats be more accurate based on where you actually spend time. The Nest thermostat smart home integrations are very limited, but that does make it easier to set up. Many energy providers will also offer bonuses or rebates you can use to recoup the cost of an expensive thermostat even faster. I've even seen it available with rebates and free installation to speed up that payoff date. The bright green leaf icon always shows instant savings for those who don't want to dive too deep into app management."
  },
  {
    "title": "To make Ironheart feel tactile, the show&#8217;s creative team had to get on the same page",
    "slug": "to-make-ironheart-feel-tactile-the-show-s-creative-team-had-to-get-on-the-same-page",
    "link": "https://www.theverge.com/tv/707329/ironheart-alison-kelly-interview",
    "published": "2025-07-15 17:15",
    "image": "https://images.unsplash.com/photo-1620075266917-2c5791f6737b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxpcm9uJTIwbWFuJTIwZmlsbXMlMjBjbGVhcmx5JTIwaW5mb3JtZWQlMjBtYW55fGVufDB8fHx8MTc1MjYxNDExMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "In Disney Plus' Ironheart series, a young genius with an uncanny knack for building armored suits finds herself plunged into a shady, criminal underworld that gives her a chance to really show off her talents. Riri Williams is not Tony Stark, and while the Iron Man films clearly informed many of Ironheart's fantastical visuals, there's […]",
    "full_text": "After years of seeing Iron Man and Marvel’s other high-tech superheroes running around in nanotech suits that look a bit too CGI-y for their own good, the way that Ironheart goes out of its way to show you Riri (Dominique Thorne) climbing into her homemade armor is a breath of fresh air. Even though Riri’s suit is capable of zooming through the skies and doing all kinds of acrobatic tricks, Ironheart presents it with a tactility that makes it feel almost real. Riri’s armor is supposed to look like something that actually exists in the world — which, according to cinematographer Alison Kelly (who worked on episodes 4-6), required being deeply collaborative with the entire creative team. But Angela really wanted to root our action in the story.” Barnes also wanted the battle to unfold like a genre-shifting play, while stunt coordinator Danny Hernandez took care to lean into the reality of how someone without superpowers would fight back if they were being jumped. “We pieced out the different beats of the White Castle fight, and Angela wanted the first part with Jeri (Zoe Terakes) and Roz (Shakira Barrera) to feel almost like a heightened ballet where you can see Riri’s panic,” Kelly said. To visualize how they could pull off some of Ironheart’s more technically complex shots involving Riri in the suit, Kelly and Barnes would get very analog. That was enough for them to hammer out a scene’s key camera movements, and they could then take those ideas to the VFX team headed up by Greg Steele, which could develop a series of previsualization to give everyone a sense of how the shot would come together. “That process is such a gift because they can do so many revisions and it’s so much less expensive than trying to fix things later once they’re already done.” When you see Riri jumping through the air and being encased in her armor, you’re looking at a shot that’s had multiple passes of editing to add in various digital elements around a human actor."
  },
  {
    "title": "A former OpenAI engineer describes what it’s really like to work there",
    "slug": "a-former-openai-engineer-describes-what-its-really-like-to-work-there",
    "link": "https://techcrunch.com/2025/07/15/a-former-openai-engineer-describes-what-its-really-like-to-work-there/",
    "published": "2025-07-15 20:58",
    "image": "https://images.unsplash.com/photo-1627776880991-808c5996527b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzZW5pb3IlMjBlbmdpbmVlciUyMGRlc2NyaWJlc3xlbnwwfHx8fDE3NTI2MTMyMDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "A senior engineer describes the thrill, chaos, and exhaustion of working at OpenAI this past year while launching its coding agent Codex.",
    "full_text": "It is the fastest-growing consumer product ever, and its competitors are also growing fast. In March, it said that ChatGPT had over 500 million active users and climbing quickly. Save $450 on your TechCrunch All Stage pass Build smarter. “I must’ve seen half a dozen libraries for things like queue management or agent loops,” he offered as examples. “Launching spirit”: OpenAI doesn’t seem to know yet that it’s a giant company, right down to running entirely on Slack. It feels very much like move-fast-and-break-things Meta in its early Facebook years, he observed. “I’ve never seen a product get so much immediate uptick just from appearing in a left-hand sidebar, but that’s the power of ChatGPT.” Biggest misconception: French-Owen implied that the biggest misconception about OpenAI is that it isn’t as concerned about safety as it should be. OpenAI isn’t ignoring the long-term potential impacts, he wrote. There are researchers looking at them, and it’s aware that hundreds of millions of people are using its LLMs today for everything from medical advice to therapy."
  },
  {
    "title": "The New LG OLED TV Has the Brightest Screen I've Ever Tested",
    "slug": "the-new-lg-oled-tv-has-the-brightest-screen-i-ve-ever-tested",
    "link": "https://www.cnet.com/deals/this-new-lg-oled-tv-has-the-brightest-screen-ive-ever-tested/#ftag=CAD590a51e",
    "published": "2025-07-15 20:55",
    "image": "https://www.cnet.com/a/img/resize/bbdb90b5a91030fabb1c8371a24a33e677f7813b/hub/2025/05/27/66da858c-d868-4816-a650-d68ba135395f/call-of-duty-g5-2.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Playing Call of Duty Black Ops 6 is a whole different experience with the eye-popping LG OLED G5.",
    "full_text": "The G5's best-in-class brightness made gaming easier and more enjoyable than I expected. But until I played Call of Duty Black Ops 6 on the new LG G5 OLED, I didn't know there was something else just as crucial. Picture quality is so important when it comes to gaming because some of the latest advances, such as HDR10 and Dolby Vision, help to elevate the gaming experience in a meaningful way, and the G5 can take full advantage of these. But in the middle of my reverie, I found that people were shooting at me. (With five screens playing at once, it felt like I was starring in my own personal esports event.) That's thanks to LG's new four-stack panel, which literally stacks two blue OLEDS (and a red and a green) on top of each other for its dazzling light output. Unless something changes, a Samsung TV will never tick the Dolby Vision check box -- it's HDR10 only. So if you're an Xbox completionist, then the LG G5 (and others) will help you max out the Xbox 4K compatibility test. I can't say playing on the G5 in the CNET lab made me a better player -- there are other crucial factors, including networking, that can decrease lag -- but I had a blast revisiting old maps and new ones on this fantastic television. It's definitely a \"must-see\" for serious gamers."
  },
  {
    "title": "Trump announces billions in investments to make Pennsylvania an AI hub",
    "slug": "trump-announces-billions-in-investments-to-make-pennsylvania-an-ai-hub",
    "link": "https://www.theverge.com/news/707369/trump-ai-energy-investments-pennsylvania-billions",
    "published": "2025-07-15 16:46",
    "image": "https://images.unsplash.com/photo-1750990456529-4b9efa9a5097?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwlRTIlODAlOUMlMjBpbmF1Z3VyYWwlMjAlRTIlODAlOUQlMjBwZW5uc3lsdmFuaWElMjBlbmVyZ3l8ZW58MHx8fHwxNzUyNjE4NjEyfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "President Donald Trump announced more than $90 billion in investments from private companies that they said are tied to AI, tech, and energy during the “inaugural” Pennsylvania Energy and Innovation Summit on Tuesday. Pennsylvania is a leading gas-producing state and an epicenter of the US fracking boom; some of the largest investments linked to the […]",
    "full_text": "He joined The Verge in 2019 after nearly two years at Techmeme. President Donald Trump announced more than $90 billion in investments from private companies that they said are tied to AI, tech, and energy during the “inaugural” Pennsylvania Energy and Innovation Summit on Tuesday. Pennsylvania is a leading gas-producing state and an epicenter of the US fracking boom; some of the largest investments linked to the initiative were from energy companies, including “a $25 billion investment in data center and energy infrastructure development in Northeast Pennsylvania” from Blackstone, and $15 billion in expansions announced by First Energy. Trump repeated calls to “drill, baby, drill” during the event, and some gas companies were included on a fact sheet from Senator Dave McCormick listing the announcements. Enbridge plans to invest $1 billion to expand its gas pipelines “into Pennsylvania,” Equinor is investing $1.6 billion to “boost natural gas production at Equinor’s Pennsylvania facilities and explore opportunities to link gas to flexible power generation for data centers,” and Capital Power said it’s spending $3 billion over 10 years on an upgraded gas facility in the state. Google’s president and chief investment officer, Ruth Porat, announced that the company plans to invest $25 billion to build data centers and AI infrastructure over the next two years across the PJM region, which includes 13 states and Washington, D.C., along with a 20-year, $3 billion US hydropower deal with Brookfield Energy. Cloud computing company CoreWeave announced plans to invest $6 billion in a data center “to power the most cutting-edge AI use cases” in Pennsylvania. Anthropic will commit $1 million over three years to support a program that provides cybersecurity education and an additional $1 million over three years to “support energy research at Carnegie Mellon University.” Meta announced a $2.5 million partnership to “support startups in rural Pennsylvania communities in addition to community accelerator training for small businesses,” while AWS CEO Matt Garman was also at the event, with Amazon pointing toward previously announced “plans to invest $20 billion in Pennsylvania to expand cloud computing infrastructure and advance AI innovation.” Update, July 15th: Added details about several other companies, including Google and AWS."
  },
  {
    "title": "Samsung Galaxy Z Flip 7 Specs vs. Motorola Razr Ultra: Comparing the High-End Flip Phones",
    "slug": "samsung-galaxy-z-flip-7-specs-vs-motorola-razr-ultra-comparing-the-high-end-flip-phones",
    "link": "https://www.cnet.com/tech/mobile/samsung-galaxy-z-flip-7-specs-vs-motorola-razr-ultra-comparing-the-high-end-flip-phones/#ftag=CAD590a51e",
    "published": "2025-07-15 20:37",
    "image": "https://www.cnet.com/a/img/resize/ae4a099eddb562b0058e53dbc7a8cf598e39c83b/hub/2025/07/15/7ea2d056-2bca-4cce-b930-14974a3a6173/galaxy-z-flip-7-vs-motorola-razr-ultra-cnet.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Samsung and Motorola have two different approaches toward their highest-end flip-style Android phones.",
    "full_text": "Samsung's Galaxy Flip 7 was unveiled at the company's July Galaxy Unpacked event, debuting a redesigned cover screen, a slightly thinner body and -- unlike the now-$2,000 Galaxy Z Fold 7 -- the same $1,100 price of Samsung's prior Flip phones. Watch this: Ultra Thin: First Look at the Galaxy Z Fold 7 and Z Flip 7 02:45 This Z Flip 7 will face Motorola's $1,300 Razr Ultra, which has a similar flip design but takes a different approach. Even though Motorola's phone costs $200 more, the company touts several specs and design enhancements meant to justify the higher price. This includes support for a 165Hz refresh rate on both the cover display and the internal display, whereas the Flip 7 runs at a still very smooth 120Hz. The Razr Ultra includes three 50-megapixel cameras for its wide, ultrawide and selfie cameras, while the Flip 7 comes with a 50-megapixel wide, 12-megapixel ultrawide and a 10-megapixel selfie camera. The Razr Ultra can also be purchased with unique design materials such as wood or Alcantara fabric. The Flip 7's 512GB model does still undercut the Ultra on price, though, at $1,220. The Motorola Razr Ultra comes in a variety of finishes including Alcantara (left) and wood (middle). Looking at longevity, the Flip 7 has Samsung's seven-year commitment for software updates and security updates, meaning you should be able to use this phone safely all the way through 2032, whereas the Razr Ultra is getting only three years of major software updates and four years of security updates."
  },
  {
    "title": "Xbox tests letting you stream your own games on PC",
    "slug": "xbox-tests-letting-you-stream-your-own-games-on-pc",
    "link": "https://www.theverge.com/news/707739/xbox-stream-your-own-game-pc-app",
    "published": "2025-07-15 16:25",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/stream-your-own-game-pc.png?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200",
    "summary": "Xbox is bringing its “stream your own game” feature to PC. On Tuesday, the company announced that Xbox Insiders with a Game Pass Ultimate subscription can try streaming the Xbox games they own, including some that are available on console only, directly from the Xbox PC app. Xbox started letting Game Pass Ultimate subscribers stream […]",
    "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO. Xbox is bringing its “stream your own game” feature to PC. On Tuesday, the company announced that Xbox Insiders with a Game Pass Ultimate subscription can try streaming the Xbox games they own, including some that are available on console only, directly from the Xbox PC app. Xbox started letting Game Pass Ultimate subscribers stream games from their library to the Xbox Series X | S and Xbox One consoles earlier this year. Game Pass Ultimate subscribers can also stream games from their TVs and browsers on devices like smartphones, PCs, tablets, and Meta Quest headsets."
  },
  {
    "title": "Before iOS 26, Apple Will Release at Least One More iOS 18 Update Soon",
    "slug": "before-ios-26-apple-will-release-at-least-one-more-ios-18-update-soon",
    "link": "https://www.cnet.com/tech/services-and-software/before-ios-26-apple-will-release-at-least-one-more-ios-18-update-soon/#ftag=CAD590a51e",
    "published": "2025-07-15 20:22",
    "image": "https://www.cnet.com/a/img/resize/96ce7b264da760162267b5f16fbe167dbaa2fc4b/hub/2024/09/16/8f9d312a-2f0d-4880-a0d0-e00045c799c4/apple-iphone-16-pro-max-4428.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Apple will likely release iOS 18.6 in the next few weeks, but don't expect many new features.",
    "full_text": "While iOS 26 will bring a major redesign to iPhones, the latest beta is filled with bug and security fixes, so developers and beta testers shouldn't expect new features. Since this is a beta, I recommend downloading it on something other than your primary device. Note that the beta is not the final version of iOS 18.6, so more features could land on your iPhone when it is released. Here's what to expect from iOS 18.6 when it lands on your iPhone. After downloading and looking into iOS 18.6 beta 3, I found no new features or noticeable changes. That update was filled with more than 30 important bug fixes and security patches but no new features. Apple did the same thing in July 2023 when it released iOS 16.6. When the tech giant released that update, it was focused on bug fixes and security patches; the next major iOS release was iOS 17. Apple is likely shifting gears and focusing more on iOS 26. There will likely be more betas before iOS 18.6 is released to the public, so there's plenty of time for Apple to add features or change others -- but I wouldn't count on new features."
  },
  {
    "title": "How to Watch Pokemon Presents 2025 for Legends: Z-A, TCG Pocket and More",
    "slug": "how-to-watch-pokemon-presents-2025-for-legends-z-a-tcg-pocket-and-more",
    "link": "https://www.cnet.com/tech/gaming/how-to-watch-pokemon-presents-2025-for-legends-z-a-tcg-pocket-and-more/#ftag=CAD590a51e",
    "published": "2025-07-15 20:20",
    "image": "https://www.cnet.com/a/img/resize/f3735dafc6e0821ab2fb6f7c6d943b46ec058883/hub/2025/07/15/0daddc20-bd00-4b62-ad1c-08687dab8a8c/pokemon-presents-dj-pikachu-promo-hed.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "July's Pokemon Presents stream will likely provide updates for Pokemon live service games, mainline titles and the upcoming Netflix series.",
    "full_text": "It's that time again, trainers: Grab your Pokedex and get ready to catch some new pocket monsters, because we're about to hear everything about the latest developments in the world of Pokemon. The upcoming Pokemon Presents stream will take place on Tuesday, July 22 at 6 a.m. PT (9 a.m. We don't know exactly how long the event will run, but previous Pokemon Presents streams have ranged from 10 to 20 minutes long, depending on how many announcements are prepared for the stream. We can expect to hear more about this mobile game (among others) during the upcoming Pokemon Direct. This Pokemon Presents stream is positioned at a strange time -- Pokemon Legends: Z-A for the Nintendo Switch 2 has already been announced and we have plenty of info and gameplay footage available for that game. It's also possible that generation 10 will be announced during the presentation. Unless GameFreak is looking to polish the next big games with some extra development time, we're probably due to hear about the next generation of Pokemon games extremely soon. We could very well get an update about that game during this stream, explaining more about how the game will integrate the series' long list of battle mechanics and giving us a better idea of when we'll see a full release. New expansions are usually teased at the end of each month, which lines up with this stream. The second season for this slice-of-life Pokemon hotel series is set to release on Netflix in September, so we might catch a scene or two teasing the show and get an official release date."
  },
  {
    "title": "Today's NYT Connections: Sports Edition Hints and Answers for July 16, #296",
    "slug": "today-s-nyt-connections-sports-edition-hints-and-answers-for-july-16-296",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-sports-edition-hints-and-answers-for-july-16-296/#ftag=CAD590a51e",
    "published": "2025-07-15 20:00",
    "image": "https://www.cnet.com/a/img/resize/c7e1d294a1a554f051860c8dddd6fd0c6527b452/hub/2024/10/16/c34cfc41-01f2-4b1a-80a8-f6479c50c02e/connections-sports-edition-6859.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answers for the NYT Connections: Sports Edition puzzle for July 16, No. 296",
    "full_text": "Looking for the most recent regular Connections answers? Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle and Strands puzzles. I thought the purple group was unusually easy today, but read on for hints and the answers if you get stuck. Or you can continue to play it free online. Hints for today's Connections: Sports Edition groups Answers for today's Connections: Sports Edition groups Purple group: First words of Big Ten nicknames. What are today's Connections: Sports Edition answers? The completed NYT Connections: Sports Edition puzzle for July 16, 2025. The theme is first words of Big Ten nicknames."
  },
  {
    "title": "Today's NYT Strands Hints, Answers and Help for July 16 #500",
    "slug": "today-s-nyt-strands-hints-answers-and-help-for-july-16-500",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-strands-hints-answers-and-help-for-july-16-500/#ftag=CAD590a51e",
    "published": "2025-07-15 20:00",
    "image": "https://www.cnet.com/a/img/resize/166e67238a28ef7d82e62fe8aec7185a7cc23eda/hub/2024/05/15/859c9110-e596-432b-8690-95e6102759c9/nyt-new-york-times-strands-2054.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and answers for the NYT Strands puzzle for July 16 No. 500.",
    "full_text": "Click here for our daily Strands hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle, Connections and Connections: Sports Edition puzzles. Today's NYT Strands puzzle is a fun one -- it reminds me of all the techie items that were recently being touted everywhere on Prime Day. (No, this is not an ad for Amazon.) If you need hints and answers, read on. I go into depth about the rules for Strands in this story. If you're looking for today's Wordle, Connections and Mini Crossword answers, you can visit CNET's NYT puzzle hints page. If that doesn't help you, here's a clue: Nerd nirvana. Your goal is to find hidden words that fit the puzzle's theme. These are the words I used to get those hints but any words of four or more letters that you find will work: When you have all of them (I originally thought there were always eight but learned that the number can vary), every letter on the board will be used."
  },
  {
    "title": "Today's NYT Connections Hints, Answers and Help for July 16, #766",
    "slug": "today-s-nyt-connections-hints-answers-and-help-for-july-16-766",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-hints-answers-and-help-for-july-16-766/#ftag=CAD590a51e",
    "published": "2025-07-15 20:00",
    "image": "https://www.cnet.com/a/img/resize/3986ca4ac5b498c6114118e0dfa25b2a05ae6531/hub/2025/03/26/c70b0a32-884a-4379-b77b-de75776952ba/nyt-word-games-connections-2798.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are some hints and the answers for the NYT Connections puzzle for July 16, #766 .",
    "full_text": "Today's NYT Connections puzzle features one of those classic purple categories, where you wonder if anyone out there really solved it without first solving the other three and letting the purple answers fall in. Read on for clues and today's Connections answers. Players who are registered with the Times Games section can now nerd out by following their progress, including number of puzzles completed, win rate, number of times they nabbed a perfect score and their win streak. Read more: Hints, Tips and Strategies to Help You Win at NYT Connections Every Time Blue group hint: Going to catch you! Purple group hint: Think frat and sorority names. Yellow group: Parts of a college campus. Green group: Exaggerated, as a performance. The theme is parts of a college campus. The theme is exaggerated, as a performance."
  },
  {
    "title": "Meta fixes bug that could leak users’ AI prompts and generated content",
    "slug": "meta-fixes-bug-that-could-leak-users-ai-prompts-and-generated-content",
    "link": "https://techcrunch.com/2025/07/15/meta-fixes-bug-that-could-leak-users-ai-prompts-and-generated-content/",
    "published": "2025-07-15 20:00",
    "image": "https://images.unsplash.com/photo-1668091818168-61a18ea51275?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZWNoJTIwZ2lhbnQlMjBmaXhlZHxlbnwwfHx8fDE3NTI2MTA1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The tech giant fixed the security flaw, netting a security researcher $10,000 for privately disclosing the bug.",
    "full_text": "Meta has fixed a security bug that allowed Meta AI chatbot users to access and view the private prompts and AI-generated responses of other users. Sandeep Hodkasia, the founder of security testing firm AppSecure, exclusively told TechCrunch that Meta paid him $10,000 in a bug bounty reward for privately disclosing the bug he filed on December 26, 2024. Hodkasia told TechCrunch that he identified the bug after examining how Meta AI allows its logged-in users to edit their AI prompts to regenerate text and images. He discovered that when a user edits their prompt, Meta’s back-end servers assign the prompt and its AI-generated response a unique number. By analyzing the network traffic in his browser while editing an AI prompt, Hodkasia found he could change that unique number and Meta’s servers would return a prompt and AI-generated response of someone else entirely. The bug meant that Meta’s servers were not properly checking to ensure that the user requesting the prompt and its response was authorized to see it. Hodkasia said the prompt numbers generated by Meta’s servers were “easily guessable,” potentially allowing a malicious actor to scrape users’ original prompts by rapidly changing prompt numbers using automated tools. When reached by TechCrunch, Meta confirmed it fixed the bug in January and that the company “found no evidence of abuse and rewarded the researcher,” Meta spokesperson Ryan Daniels told TechCrunch. News of the bug comes at a time when tech giants are scrambling to launch and refine their AI products, despite many security and privacy risks associated with their use. Meta AI’s stand-alone app, which debuted earlier this year to compete with rival apps like ChatGPT, launched to a rocky start after some users inadvertently publicly shared what they thought were private conversations with the chatbot."
  },
  {
    "title": "Today's Wordle Hints, Answer and Help for July 16, #1488",
    "slug": "today-s-wordle-hints-answer-and-help-for-july-16-1488",
    "link": "https://www.cnet.com/tech/gaming/todays-wordle-hints-answer-and-help-for-july-16-1488/#ftag=CAD590a51e",
    "published": "2025-07-15 20:00",
    "image": "https://www.cnet.com/a/img/resize/837b400de41f50a97b52a8c799b193be01cea440/hub/2024/05/28/20480816-214e-4fcc-a9b4-b02f0ac71e7c/wordle-word-game-hints-puzzle-8667.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answer for today's Wordle for July 16, No. 1,488.",
    "full_text": "Gael Cooper CNET editor Gael Fashingbauer Cooper, a journalist and pop-culture junkie, is co-author of \"Whatever Happened to Pudding Pops? The Lost Toys, Tastes and Trends of the '70s and '80s,\" as well as \"The Totally Sweet '90s.\" She's been a journalist since 1989, working at Mpls.St.Paul Magazine, Twin Cities Sidewalk, the Minneapolis Star Tribune, and NBC News Digital. She's Gen X in birthdate, word and deed. If Marathon candy bars ever come back, she'll be first in line."
  },
  {
    "title": "The Future of Social Security Looks Grim. 6 Tips to Help You Save for Retirement Now",
    "slug": "the-future-of-social-security-looks-grim-6-tips-to-help-you-save-for-retirement-now",
    "link": "https://www.cnet.com/personal-finance/the-future-of-social-security-looks-grim-6-tips-to-help-you-save-for-retirement-now/#ftag=CAD590a51e",
    "published": "2025-07-15 20:00",
    "image": "https://www.cnet.com/a/img/resize/9bf5702519a8fa464466f4d4f553b593d4061007/hub/2025/02/13/7ea1b36a-fd98-4595-847c-0b8b8df641e2/social-security.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The average payout for Social Security isn't enough to secure your future -- and is expected to get even smaller by 2034.",
    "full_text": "As of June 2025, the average Social Security payout for retirees is $1,952 per month. Although $1,952 -- or $1,581 if you'll retire after 2034 -- isn't an insignificant amount, it's not enough to cover living expenses for any of my clients, and it's likely not enough for you. Social Security is a crucial part of many retirees' monthly income -- but it shouldn't be your sole retirement plan. \"Social Security should be viewed as a foundation, not the sole pillar of retirement planning.\" Rather than speculating about the fate of Social Security, I recommend putting together a plan now to start growing your own retirement fund. Even if you can't save much, starting small is better than pushing it down the road. If you reach your 401(k) max contribution, aim to invest in an individual retirement account next. Whether a Roth or traditional IRA makes sense depends on your estimated tax rate now and in the future. A good way to help your Social Security income and retirement fund stretch even further is by eliminating steep expenses. Even if you're not ready to move across the country, considering lower-cost neighborhoods in your area can make a big difference."
  },
  {
    "title": "iPhone 17 Colors: A Surprising Hue Could Be Coming for Pro Models",
    "slug": "iphone-17-colors-a-surprising-hue-could-be-coming-for-pro-models",
    "link": "https://www.cnet.com/tech/mobile/iphone-17-colors-a-surprising-hue-could-be-coming-for-pro-models/#ftag=CAD590a51e",
    "published": "2025-07-15 19:51",
    "image": "https://www.cnet.com/a/img/resize/955bc9e258a6b590646b3f74fac67acf55dbafa0/hub/2024/09/16/8ef9845e-a973-4b5a-a800-ce236801f365/iphone-16-plus-pro-pro-max-family-4559.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Rumors about the iPhone 17 colors continue to pour in, but the latest leak isn't one I saw coming.",
    "full_text": "We've already heard plenty of rumors that the iPhone 17 base model could come in purple, green and blue. Yeux1122 has a similar lineup in their post, but the base options don't include gray. Purple, blue and green are all part of the same color palette. The neutral colors don't quite surprise me since they're standard for iPhones at this point. Dickson also noted the orange shade may end up being a dark gold or copper. Sky blue could be old to Apple, but a new iPhone hue Perhaps because the latest M4 MacBook Air currently comes in sky blue, an iPhone in the same color could be an aesthetic win for sky blue MacBook owners. It seems like there's a possibility for different shades of blue, as we see in the lineup above. Bu posted on X and their blog on June 20 that Apple is testing purple and green, but that purple could be another new color for the iPhone 17's base models. How many new colors we may see from the rumored iPhone 17 is still unclear, but as of now, a sky blue option could well be in your future."
  },
  {
    "title": "Adidas now offers a laced version of its 3D-printed shoes",
    "slug": "adidas-now-offers-a-laced-version-of-its-3d-printed-shoes",
    "link": "https://www.theverge.com/news/707699/adidas-laces-climacool-shoe-3d-printed",
    "published": "2025-07-15 15:44",
    "image": "https://images.unsplash.com/photo-1568874395728-de045b89b2ec?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxicmVhdGhhYmxlJTIwbGF0dGljZSUyMHN0cnVjdHVyZSUyMGNyZWF0ZWR8ZW58MHx8fHwxNzUyNjA4NzExfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Adidas has released a new variant of its 3D-printed Climacool shoes with laces so you can adjust their fit and potentially tone down how tightly they hug your feet. Featuring a breathable lattice structure created through an additive printing process, the shoes have previously only been available as slip-ons in a single off-white colorway, but […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. Adidas has released a new variant of its 3D-printed Climacool shoes with laces so you can adjust their fit and potentially tone down how tightly they hug your feet. Featuring a breathable lattice structure created through an additive printing process, the shoes have previously only been available as slip-ons in a single off-white colorway, but now feature a black tongue and laces potentially making them look less like an experiment in shoe design and more like a regular sneaker. The Climacool were originally launched last September in limited quantities, but Adidas expanded their availability in April 2025 with a global launch that included select Adidas store locations in the US. The new $160 Climacool Laced are $20 more expensive than the slip-on version, and while they’re also available from “selected retailers” and Adidas’ stores starting today, they can only be purchased online through the company’s Confirmed platform. The shoe’s laces and tongue are made from materials that aren’t 3D-printed. Image: Adidas The shoe’s main structure is still 3D-printed as a single piece in a process that Adidas says “takes approximately 24 hours and includes spinning, baking, and compression using high-tech polymers.” The upper portion of the Climacool Laced features a slightly different design than the slip-ons that now incorporates printed eyelets, but the tongue and laces are made from different materials added afterwards that aren’t 3D-printed. The new version will potentially make the Climacool more comfortable and compatible with a wider variety of foot sizes while retaining the unique features of their 3D-printed lattice structure that was breathable and fast-drying."
  },
  {
    "title": "'It's Always Sunny in Philadelphia' Season 17 Release Schedule: When to Watch Episode 3",
    "slug": "it-s-always-sunny-in-philadelphia-season-17-release-schedule-when-to-watch-episode-3",
    "link": "https://www.cnet.com/tech/services-and-software/its-always-sunny-in-philadelphia-season-17-release-schedule-when-to-watch-episode-3/#ftag=CAD590a51e",
    "published": "2025-07-15 19:30",
    "image": "https://www.cnet.com/a/img/resize/c2e95654402db973fb79f492589045e9d23df072/hub/2025/07/15/b0092e9d-1641-42b6-9be9-8542ba42eb64/iasip-ep2-1707-00177r-3.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The long-running sitcom is back.",
    "full_text": "It's Always Sunny in Philadelphia returned last week with two episodes, bringing a second Abbott Elementary crossover from the viewpoint of the Gang. To see all the trouble the Gang gets into this season -- and whether Frank finds love on a TV show within a TV show -- here are the release details for season 17. When to watch season 17 of 'It's Always Sunny' on Hulu Episodes 1 and 2 of season 17 are streaming now on Hulu. Episode 4, Thought Leadership: A Corporate Conversation: Premieres on FXX on July 23 at 9 p.m. ET/9 p.m. PT. Episode 5, The Gang Goes to a Dog Track: Premieres on FXX on July 30 at 9 p.m. ET/9 p.m. PT. Episode 6, Overage Drinking: A National Concern: Premieres on FXX on Aug. 6 at 9 p.m. ET/9 p.m. PT. Episode 7, The Gang Gets Ready for Prime Time: Premieres on FXX on Aug. 13 at 9 p.m. ET/9 p.m. PT. If you're OK with seeing some ads during your shows, you can sign up for Hulu for $10 per month, or $100 per year. You can avoid commercials with the more expensive version of Hulu, which is $19 per month with no annual payment option."
  },
  {
    "title": "The best deals on MacBooks right now",
    "slug": "the-best-deals-on-macbooks-right-now",
    "link": "https://www.theverge.com/22399419/apple-macbook-air-pro-mac-mini-imac-deals",
    "published": "2025-07-15 15:22",
    "image": "https://images.unsplash.com/photo-1654789878607-0b54e75ffb64?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhcHBsZSUyMGN1cnJlbnRseSUyMHNlbGxzJTIwbWFjYm9va3MlMjBlcXVpcHBlZHxlbnwwfHx8fDE3NTI2MDc4MTR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Apple currently sells MacBooks equipped with its own M-series chips in a wide range of sizes and price points. It discontinued the M1 MacBook Air to make room for newer models, but some retailers are still selling the last-gen laptop starting at $599 — a far cry from the $2,499 starting price of the latest […]",
    "full_text": "Apple currently sells MacBooks equipped with its own M-series chips in a wide range of sizes and price points. Although its M2 processor wasn’t as revolutionary as the M1 generation, it’s a better performer for any kind of user than the M1, including creators with demanding workloads. The M2-powered MacBook Air from 2022 seems to be on its way out, with availability waning. It’s a bit harder to find discounts on the 15.3-inch MacBook Air M2, however. They also continue to offer 18 hours of battery life and a MagSafe charging port. However, it starts with just 8GB of RAM and lacks the third USB-C / Thunderbolt port found on the M3 Pro and M3 Max models (as well as Thunderbolt 4 speeds). We’re finding it challenging to spot the 16GB RAM / 512GB SSD model in stock. Meanwhile, the 24GB / 512GB variant with an M4 Pro chip (12-core CPU / 16-core GPU) is down to $1,799 ($200 off) at Best Buy and B&H Photo. You can also get the Mac Mini with an M4 Pro chipset starting at $1,399, which comes with faster Thunderbolt 5 storage and the option to upgrade to 10-gigabit ethernet for another $100. If you need more storage, you can step up to the version with 16GB of RAM and a 512GB SSD for around $728 ($71 off) at Amazon and B&H Photo."
  },
  {
    "title": "My Favorite Way to Make Cauliflower Takes Less than 15 Minutes",
    "slug": "my-favorite-way-to-make-cauliflower-takes-less-than-15-minutes",
    "link": "https://www.cnet.com/news/my-favorite-way-to-make-cauliflower-takes-less-than-15-minutes/#ftag=CAD590a51e",
    "published": "2025-07-15 19:00",
    "image": "https://www.cnet.com/a/img/resize/b72e6bc26d52372c01e0dcb01286f72a91032835/hub/2025/07/15/02c56d8a-b734-4b29-823e-cfc0a2f10d41/img-0785.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "To create this tasty snack or side dish, you need only a few ingredients and an air fryer.",
    "full_text": "There are a few things I won't put in an air fryer. In fact, it's become my preferred cooking method, and I'm always happy with the results of cooking up this healthy and delicious snack. Now, I'm not here to convince you that buffalo cauliflower tastes identical to the buffalo chicken wings that I also whip up in my air fryer, because it doesn't. Step 2: Place the pieces in a bowl with a drizzle of olive oil and add dashes of onion powder, garlic powder, paprika and pepper until the pieces are slightly coated. You can choose your favorite spices for this side dish. Air fry for 10 minutes at 400 degrees Fahrenheit, shaking the basket halfway through. (No need to worry about cross-contamination as you would with chicken wings!) Note: Although this recipe won't result in a crispy cauliflower since there is no cornstarch or flour coating, it will still make a delicious, buffalo-infused veggie. Because this recipe uses minimal ingredients, this is a healthier alternative to chicken wings, French fries and other common side dishes and snacks. Although Frank's Buffalo Sauce can be a bit high in sodium, it has zero calories or fat."
  },
  {
    "title": "Your OnePlus 13 Will Get a Dedicated AI 'Mind Space' in Update Rolling Out Now",
    "slug": "your-oneplus-13-will-get-a-dedicated-ai-mind-space-in-update-rolling-out-now",
    "link": "https://www.cnet.com/tech/services-and-software/your-oneplus-13-will-get-a-dedicated-ai-mind-space-in-update-rolling-out-now/#ftag=CAD590a51e",
    "published": "2025-07-15 18:21",
    "image": "https://www.cnet.com/a/img/resize/605a7ba629cfbd7ebef330a421eeaa7981e3de5b/hub/2025/01/06/2d37395b-da25-4b98-8337-dcf6cedbcf89/oneplus-13-review-cnet-lanxon-promo-02.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "I played with OnePlus' flagship AI feature. It worked well, and it's heading to some phones imminently.",
    "full_text": "OnePlus is a little late to the party, but it's arrived nonetheless. At a launch event in London earlier this year I not only got to see the first AI features to land on OnePlus phones in action, but also learn about what the company's future plans are for bringing more complex and sophisticated AI features to its phones down the road. With all Android phone-makers increasingly making use of best-in-class Qualcomm chips and relying on Google's Gemini AI, having a strong AI strategy is one way they can set themselves apart from rivals. I was impressed with how far OnePlus seems to be thinking ahead and not rushing into going ham on AI. This is a hub where all of your most important content will live. It's clear that OnePlus designed Plus Mind to be used with a dedicated button, and no doubt all future OnePlus phones will feature a Plus Key of their own. After using Plus Mind to save a variety of content, I had mixed opinions on how useful it was. Stage 3 is when OnePlus plans to go full AI agent, turning into a personal assistant that can know everything about you. On the more playful side, OnePlus is introducing two AI photo tools. AI Reframe, meanwhile, will analyze your carelessly shot holiday snaps and suggest creative cropping and framing to make it look like you weren't three cocktails deep when you shot them."
  },
  {
    "title": "The Perseids Meteor Shower Brings Bright Fireballs to the Skies, Starting This Week",
    "slug": "the-perseids-meteor-shower-brings-bright-fireballs-to-the-skies-starting-this-week",
    "link": "https://www.cnet.com/science/space/the-perseids-meteor-shower-brings-bright-fireballs-to-the-skies-starting-this-week/#ftag=CAD590a51e",
    "published": "2025-07-15 18:21",
    "image": "https://www.cnet.com/a/img/resize/5c9b5afa9dd6e52fff0d2fa18dbae25e3386a49f/hub/2021/07/13/dd167c0d-8d80-4b5f-bb47-9bb936a9f3cb/nasaingallsperseid2016.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "At its peak, you may see as many as 100 meteors per hour if you're in a place where it's dark enough.",
    "full_text": "Perseids are known for their bright fireballs and plentiful meteors. During its peak, the meteor shower is known to spit as many as 100 meteors on average, according to the American Meteor Society. These not only include your typical shooting stars, but also a higher chance for fireballs, which are meteors that explode as they enter orbit. Per NASA, fireballs tend to last longer than standard shooting stars and can come in a variety of different colors. Until then, it leaves behind an excellent tail of dust and debris to feed us yearly meteor showers. During this time, the shower will produce anywhere from 25 to 100 meteors per hour on average. Thus, if you're planning on watching this year's Perseids during their peak, you'll want to get out of the city and suburbs as far as possible. According to Bill Cooke, lead of NASA's Meteoroid Environments Office, folks in the city might see one or two meteors from the meteor shower per hour, which is pocket change compared to what those outside city limits might see. Like all meteors, Perseids are named after the constellation from which they appear. Thus, it is highly probable that light pollution from the moon may reduce the number of visible meteors by a hefty margin, depending on how things go."
  },
  {
    "title": "Here are the best AirPods deals you can get right now",
    "slug": "here-are-the-best-airpods-deals-you-can-get-right-now",
    "link": "https://www.theverge.com/21302051/best-apple-airpods-deals",
    "published": "2025-07-15 14:16",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25623448/DSCF0028.jpg?quality=90&strip=all&crop=10.049019607843%2C16.878657222051%2C85.098039215686%2C66.830920850015&w=1200",
    "summary": "If you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C. Events like Prime Day, Black Friday, and Cyber Monday often bring the steepest discounts, though […]",
    "full_text": "Both versions represent significant upgrades over the third-gen AirPods, with a more comfortable design and improved audio performance. They’re also better for taking calls thanks to Apple’s Voice Isolation feature, which focuses the mics on your voice so you can be heard more clearly in noisy environments. The $179 AirPods 4 with Active Noise Cancellation offer a surprisingly effective noise-canceling mode, a helpful transparency mode, and several other Pro-level features. The latest AirPods Pro do a better job of tuning out noise, but the AirPods 4 with ANC still do a good job of reducing sound. They also feature other perks formerly reserved for Apple’s top-of-the-line earbuds, including wireless charging and a case with a built-in speaker that allows you to easily track it down via Apple’s Find My app. The newest model also supports lossless audio when used with Apple’s new Vision Pro headset and doubles as a pair of FDA-approved hearing aids. As far as deals go, Apple’s updated AirPods Pro with USB-C are currently available at Amazon and Walmart for $169 ($80 off). That’s a solid discount, but it falls short of the $149 low we saw during Prime Day. Toward the end of last year, Apple replaced the first-gen Max with a new model that features support for USB-C charging and a few new color options. As of writing, they’re on sale at Amazon, Walmart, and Best Buy in select colors starting at $529 ($20 off) — a far cry from the all-time low of $399 we saw during Prime Day."
  },
  {
    "title": "AV startup Pronto.ai acquires off-road autonomous vehicle rival SafeAI",
    "slug": "av-startup-pronto-ai-acquires-off-road-autonomous-vehicle-rival-safeai",
    "link": "https://techcrunch.com/2025/07/15/av-startup-pronto-ai-acquires-off-road-autonomous-vehicle-rival-safeai/",
    "published": "2025-07-15 18:00",
    "image": "https://images.unsplash.com/photo-1565471495044-7f9c89c8027a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhaSUyMGNlbyUyMGFudGhvbnklMjBsZXZhbmRvd3NraSUyMHNhaWR8ZW58MHx8fHwxNzUyNjAzMzAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Pronto.ai CEO Anthony Levandowski said the move is meant to help bolster his company's ranks with like-minded talent and complementary technology.",
    "full_text": "However, Levandowski said the acquisition is a talent and technology play. “In the autonomous haulage system space, there’s really kind of two players — it’s SafeAI and us,” Levandowski told TechCrunch in a recent interview, adding that SafeAI and Pronto have taken different approaches to the market. “We’ve been growing a ton and needed to add more people and resources to the team, so it made sense to purchase them … have more wood behind fewer arrows so that we could grow faster.” Pronto also uses Pollen Mobile, a peer-to-peer open source mobile data network the startup launched in 2022 that allows it to exchange data anonymously and at high speeds without relying on legacy carriers. Pronto has kept its team fairly lean at about 40 people. Last year, Pronto extended a partnership with Heidelberg Materials North America, one of the largest build materials and cement producers in the world, following a pilot program at the company’s Bridgeport Quarry in Texas. Pronto’s technology is integrated into Komatsu haulage trucks, which operates autonomously at the site. Earlier this year, Pronto announced an agreement with Heidelberg to deploy more than 100 autonomous trucks and expand its team in Brazil. Save $450 on your TechCrunch All Stage pass Build smarter. Notably, the acquisition will allow Pronto to offer customers a tiered technology portfolio."
  },
  {
    "title": "Analogue’s 4K N64 has been delayed again, but only by a month",
    "slug": "analogues-4k-n64-has-been-delayed-again-but-only-by-a-month",
    "link": "https://www.theverge.com/news/707586/analogue-3d-4k-n64-delay-august-2025",
    "published": "2025-07-15 14:00",
    "image": "https://images.unsplash.com/photo-1730829807437-97fb05b2bcac?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsYXRlJTIwYXVndXN0JTIwMjAyNSUyMCUyQyVFMiU4MCU5RHxlbnwwfHx8fDE3NTI2MDMzMTJ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The Analogue 3D has been hit with another delay, but should still be launching this summer. In an update on its preorder website, Analogue explained that it’s modern take on the Nintendo 64 “is now shipping in late August 2025,” after previously aiming for July. The company said in a separate statement that the decision […]",
    "full_text": "The Analogue 3D has been hit with another delay, but should still be launching this summer. In an update on its preorder website, Analogue explained that it’s modern take on the Nintendo 64 “is now shipping in late August 2025,” after previously aiming for July. The company said in a separate statement that the decision was made due to the ever-changing situation around US tariffs. “Following last week’s sudden tariff changes, Analogue 3D will now begin shipping next month,” the company explained in a post on X. “We’re absorbing the costs — your preorder price stays the same. No additional charges. Late August, the wait ends: reviews go live with everything we’ve been saving for this moment.” Like its previous hardware, the $249.99 Analogue 3D is a modern console designed to play old games, in this case N64 cartridges. The new console can upscale classic games to 4K and includes multiple display modes to mimic the look and feel of a CRT display, and the company says that it supports 100 percent of N64 cartridges. It was originally planned for a launch in 2024, but has been hit with multiple delays since it was initially announced."
  },
  {
    "title": "The FDA Approved a New Natural Food Dye. Here's How to Avoid the Artificial Ones",
    "slug": "the-fda-approved-a-new-natural-food-dye-here-s-how-to-avoid-the-artificial-ones",
    "link": "https://www.cnet.com/health/nutrition/fda-approved-new-natural-food-dye-how-avoid-artificial-ones/#ftag=CAD590a51e",
    "published": "2025-07-15 18:00",
    "image": "https://www.cnet.com/a/img/resize/7ef58da2ee31dff7009315749ebdd34b23be8892/hub/2025/07/14/3b51d9a8-2004-4e81-b521-23a32d9e133c/blue-drink-in-glass.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The FDA approved a fourth natural food color additive this year, but how can you avoid the artificial dyes still out there?",
    "full_text": "3 and then approved three natural food dyes in May. Now, on top of the FDA and Department of Health and Human Services asking food companies to stop using petroleum-based synthetic dyes entirely, the FDA wants brands to speed up the removal of Red No. \"This expedited timeline underscored our serious intent to transition away from petroleum-based synthetic dyes in the food supply,\" said FDA Commissioner Marty Makary in a news release. Gardenia (genipin) blue joins the red algae-based galdieria extract blue, butterfly pea flower extract and the white color calcium phosphate as 2025's new and approved natural food color additives. Now, you may be thinking: Isn't soy an allergen? Because no soy protein allergens will be in the final product, the GBIG is asking to be exempt from food allergen labeling. Though more research is required and many still find this answer controversial, Healthline reports that there is currently no evidence that food dyes pose significant health risks. However, if artificial food dyes are substances you want to steer clear of, there are ways you can work to remove them from your diet. First, make sure you're reading the labels on your food products to see if any synthetic dyes are listed. You can replace your packaged foods with a greater variety of fruits and vegetables, protein, healthy fats and whole grains to ensure you have a balanced diet."
  },
  {
    "title": "Mira Murati’s Thinking Machines Lab is worth $12B in seed round",
    "slug": "mira-muratis-thinking-machines-lab-is-worth-12b-in-seed-round",
    "link": "https://techcrunch.com/2025/07/15/mira-muratis-thinking-machines-lab-is-worth-12b-in-seed-round/",
    "published": "2025-07-15 17:59",
    "image": "https://images.unsplash.com/photo-1646956141733-2d456a4d337a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxiYWNrJTIwcHJvbWlzaW5nJTIwbmV3JTIwYWklMjBsYWJzfGVufDB8fHx8MTc1MjYxMDUwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The deal marks one of the largest seed rounds — or first funding rounds — in Silicon Valley history, representing the massive investor appetite to back promising new AI labs. Thinking Machines Lab is less than a year old and has yet to reveal what it's working on.",
    "full_text": "Thinking Machines Lab, the AI startup founded by OpenAI’s former chief technology officer Mira Murati, officially closed a $2 billion seed round led by Andreessen Horowitz on Monday, a company spokesperson told TechCrunch. Several outlets reported in June that Thinking Machines Lab was close to closing this $2 billion funding round at a $10 billion valuation, but, apparently, that valuation has shot up in the last month. Thinking Machines Lab is less than a year old and has yet to reveal what it’s working on. “Soon, we’ll also share our best science to help the research community better understand frontier AI systems,” said Murati. Thinking Machines Lab exists to empower humanity through advancing collaborative general intelligence. We're… — Mira Murati (@miramurati) July 15, 2025 Murati says her company is currently trying to staff up, specifically for people with a track record of “building successful AI-driven products from the ground up,” according to the startup’s website. With billions in funding, Murati may have enough of a war chest to train frontier AI models. Thinking Machines Lab previously struck a deal with Google Cloud to power its AI models. Surely, Thinking Machines Lab has an uphill battle to catch up with other AI labs."
  },
  {
    "title": "Sony’s pocket-sized RX1R camera returns with its first update in 10 years",
    "slug": "sonys-pocket-sized-rx1r-camera-returns-with-its-first-update-in-10-years",
    "link": "https://www.theverge.com/news/707589/sony-rx1r-iii-digital-compact-pocket-camera",
    "published": "2025-07-15 13:57",
    "image": "https://images.unsplash.com/photo-1604361060556-5de6bf0b4163?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjB0aGlyZCUyMGdlbmVyYXRpb24lMjByeDFyJTIwaWlpJTIwYXJyaXZlc3xlbnwwfHx8fDE3NTI2MDI0MTJ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "After nearly a decade, Sony has announced a new version of its fixed-lens compact RX1R camera that was last updated in 2015. The new third generation RX1R III arrives with the same 35mm full-frame Exmor R sensor as its predecessor, but with a bump from 42.4 to 61 megapixels. It also benefits from Sony’s latest […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. The new third generation RX1R III arrives with the same 35mm full-frame Exmor R sensor as its predecessor, but with a bump from 42.4 to 61 megapixels. The RX1R III will be available sometime in July for approximately $5,099.99, according to Sony. That’s considerably more expensive than the RX1R II, which launched in 2015 for $3,300. The camera also features a macro mode activated by a ring on the lens that can be used to focus on subjects as close as 20cm. To help make the RX1R III as light and portable as possible, Sony is now using a fixed screen on the back that can no longer be tilted up and down. The change means you may find yourself having to contort your body when trying to capture low-angle shots using the camera’s screen or 2.36 million dot OLED electronic view finder. Sony is once again positioning this camera as a high quality shooter that’s far less cumbersome to carry than larger mirrorless options or DSLRs, and its performance reflects that. And like the Sony A7R V, its autofocus system features 693 phase-detection points and is capable of tracking human motion to determine where a subject’s eyes are supposed to be, even if they’re not looking directly at the camera or their face is obscured. It seems like a worthwhile upgrade over the last generation, but if you don’t mind a bit more bulk, there are more capable and affordable alternatives from Sony."
  },
  {
    "title": "Google Discover adds AI summaries, threatening publishers with further traffic declines",
    "slug": "google-discover-adds-ai-summaries-threatening-publishers-with-further-traffic-declines",
    "link": "https://techcrunch.com/2025/07/15/google-discover-adds-ai-summaries-threatening-publishers-with-further-traffic-declines/",
    "published": "2025-07-15 17:19",
    "image": "https://images.unsplash.com/photo-1659081469066-c88ca2dec240?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0cmVuZGluZyUyMGxpZmVzdHlsZSUyMHRvcGljcyUyMGxpa2UlMjBzcG9ydHN8ZW58MHx8fHwxNzUyNjA5NjA2fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The feature will appear on iOS and Android in the U.S., with a focus on trending lifestyle topics like sports and entertainment. Google also noted the feature will make it easier for people to decide what pages they want to visit.",
    "full_text": "As publishers fret about decreased traffic from Google, the search giant has begun rolling out AI summaries in Discover, the main news feed inside Google’s search app on iOS and Android. The app warns that these summaries are generated with AI, “which can make mistakes.” Though not flagged as powered by AI, some stories will include a set of bullet points below the headline or will be grouped with similar news. For instance, a story about President Trump’s Ukraine deal also included links to other stories about Trump’s latest actions. Save $450 on your TechCrunch All Stage pass Build smarter. Despite these trials, there’s significant concern in the publishing industry about how the shift to AI is impacting website traffic and referrals. With features like Google’s AI Overviews and AI Mode, users no longer have to visit a website directly to get answers to their search queries — it can be summarized for them automatically or shared in a chatbot-style interface. A story by The Economist this week noted that worldwide search traffic fell by 15% year-over-year as of June, citing data from market intelligence company Similarweb. Earlier data from the firm also found that the number of news searches on the web that result in no click-throughs to news websites had grown from 56% in May 2024, when AI Overviews launched, to nearly 69% as of May 2025. Organic traffic also declined, dropping from over 2.3 billion visits at its peak in mid-2024 to fewer than 1.7 billion, it noted."
  },
  {
    "title": "The rights to Fyre Festival sold on eBay for $245K",
    "slug": "the-rights-to-fyre-festival-sold-on-ebay-for-245k",
    "link": "https://techcrunch.com/2025/07/15/the-rights-to-fyre-festival-sold-on-ebay-for-245k/",
    "published": "2025-07-15 17:02",
    "image": "https://images.unsplash.com/photo-1566897596700-a355fbf0c8e0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx5ZXQlMjBrbm93fGVufDB8fHx8MTc1MjYwOTYwN3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Billy McFarland, the fraudster who brought you Fyre Festival, has sold the rights to the brand on eBay for $245,300. We do not yet know who the buyer is or what they plan to do with such cursed IP.",
    "full_text": "We do not yet know who the buyer is or what they plan to do with such cursed IP. What was supposed to be a luxury music festival ended up stranding guests on an island in the Bahamas. Instead of lavish villas and gourmet meals, the festival’s clientele, which included wealthy millennial influencers, got flimsy tents and famously unappetizing cheese sandwiches. McFarland was later convicted of financial crimes due to his role in the festival, serving about three and a half years before he was released in 2022. But McFarland has not seemed to have learned his lesson. He tried organizing a second Fyre Festival, which was supposed to take place this summer in Mexico with tickets ranging between $1,400 and $1.1 million. The second Fyre Festival never happened. Playa del Carmen, the Mexican city where McFarland said the festival would take place, claimed that there had not been any record of planning for the event, which did not have a permit. McFarland denied this, but announced a few weeks later that he would sell the Fyre Festival brand. The eBay auction says that a portion of the sale proceeds will go toward restitution — but McFarland owes $26 million, so this $245,300 sale isn’t going to make much of an impact."
  },
  {
    "title": "Lucid Motors will roll out hands-free highway driving this month",
    "slug": "lucid-motors-will-roll-out-hands-free-highway-driving-this-month",
    "link": "https://techcrunch.com/2025/07/15/lucid-motors-will-roll-out-hands-free-highway-driving-this-month/",
    "published": "2025-07-15 16:34",
    "image": "https://images.unsplash.com/photo-1562522511-4eb69663153f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhZHZhbmNlZCUyMGRyaXZlciUyMGFzc2lzdGFuY2UlMjBzeXN0ZW18ZW58MHx8fHwxNzUyNTk3OTA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Lucid Motors joins the likes of Ford, General Motors, and Tesla in offering an advanced driver assistance system that allows for hands-free driving.",
    "full_text": "Lucid Motors is set to roll out a software update on July 30 that will enable hands-free highway driving on its Air sedans, a major step forward for the company’s advanced driver assistance system. The rollout will put Lucid Motors on a short list of companies that have made hands-free driving possible in the United States. In the right conditions and in cars equipped with an in-cabin camera, Tesla’s Full Self-Driving (Supervised) can also be used hands-free. Lucid says the hands-free update is only coming to the Air sedans for now, with an update rolling out to owners of the new Gravity SUV slated for later this year. (The company has barely started shipping Gravity SUVs anyway, with Cox Automotive reporting this week that only five were delivered in the second quarter.) Lucid has delivered around 20,000 cars since 2021. Drivers will have to keep their eyes on the road ahead and be ready to take over at any moment, much like the competing driver assistance systems. Lucid says this will be done with an infrared camera-based system in the car that sits on top of the steering column. They’ll also only be able to use the hands-free system on “compatible” pre-mapped divided highways. Update: Added information about pre-mapped highways and the system’s infrared camera."
  },
  {
    "title": "Ukrainian hackers claim to have destroyed servers of Russian drone maker",
    "slug": "ukrainian-hackers-claim-to-have-destroyed-servers-of-russian-drone-maker",
    "link": "https://techcrunch.com/2025/07/15/ukrainian-hackers-claim-to-have-destroyed-servers-of-russian-drone-maker/",
    "published": "2025-07-15 16:30",
    "image": "https://images.unsplash.com/photo-1717667745852-a5bd6876c1de?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3aXBlZCUyMHN5c3RlbXMlMjBiZWxvbmdpbmd8ZW58MHx8fHwxNzUyNTk3OTA1fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "A coalition of Ukrainian hackers breached and wiped systems belonging to Gaskar Group, a Moscow-based drone maker.",
    "full_text": "Ukrainian hacktivist group BO Team has claimed to have hacked into the network of Russian drone maker Gaskar Group and disrupted its operations. In a post on its Telegram channel, BO Team announced the breach, saying it carried out the attack along with the Ukrainian Cyber Alliance, another hacktivist group that operates in Ukraine, as well as Ukraine’s military intelligence. The three groups, according to a machine translation of the announcement, “carried out large-scale work to seize the entire network and server infrastructure of the Gaskar Group, collect valuable information about existing and promising [unmanned aerial vehicles], followed by the destruction of information and the disabling of this infrastructure.” BO Team said that during the cyberattack it destroyed more than 250 systems, including 46 virtual servers and more than 200 workstations, as well as wiping 47 terabytes of company data and 10 terabytes of backups. The hacktivists added that they stole the personal data of Gaskar Group employees, including their home addresses and family information, during the breach. Both Ukraine and Russian soldiers have extensively used drones since the full-scale invasion of Ukraine in 2022. Gaskar Group reportedly supplies drones to the Russian military. Gaskar Group did not immediately respond to a request for comment sent to its official Telegram phone number."
  },
  {
    "title": "AI coding tools are shifting to a surprising place: The terminal",
    "slug": "ai-coding-tools-are-shifting-to-a-surprising-place-the-terminal",
    "link": "https://techcrunch.com/2025/07/15/ai-coding-tools-are-shifting-to-a-surprising-place-the-terminal/",
    "published": "2025-07-15 16:30",
    "image": "https://images.unsplash.com/photo-1653647054667-c99dc7f914ef?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxlZGl0aW5nJTIwdG9vbHMlMjBsaWtlJTIwY3Vyc29yfGVufDB8fHx8MTc1MjYxNDEwNnww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "For years, code-editing tools like Cursor, Windsurf, and GitHub’s Copilot have been the standard for AI-powered software development. But as agentic AI grows more powerful and vibe-coding takes off, a subtle shift has changed how AI systems are interacting with software.",
    "full_text": "It’s a significant change in how AI-powered software development happens — and despite the low profile, it could have significant implications for where the field goes from here. That shift has been easy to miss, since they’re largely operating under the same branding as previous coding tools. “Our big bet is that there’s a future in which 95% of LLM-computer interaction is through a terminal-like interface,” says Mike Merrill, co-creator of the leading terminal-focused benchmark Terminal-Bench. At the same time, new research suggests programmers may be overestimating productivity gains from conventional tools. That has left an opening for companies like Warp, which currently holds the top spot on Terminal-Bench. Warp bills itself as an “agentic development environment,” a middle ground between IDE programs and command-line tools like Claude Code. But Warp founder Zach Lloyd is still bullish on the terminal, seeing it as a way to tackle problems that would be out of scope for a code editor like Cursor. Each problem on SWE-Bench is an open issue from GitHub — essentially, a piece of code that doesn’t work. Crucially, this new approach means tackling a problem step-by-step — the same skill that makes agentic AI so powerful. But even state-of-the-art agentic models can’t handle all of those environments."
  },
  {
    "title": "Research leaders urge tech industry to monitor AI’s ‘thoughts’",
    "slug": "research-leaders-urge-tech-industry-to-monitor-ais-thoughts",
    "link": "https://techcrunch.com/2025/07/15/research-leaders-urge-tech-industry-to-monitor-ais-thoughts/",
    "published": "2025-07-15 16:00",
    "image": "https://images.unsplash.com/photo-1617175379644-ba4238718eca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx1cmdpbmclMjB0ZWNoJTIwY29tcGFuaWVzfGVufDB8fHx8MTc1MjU5NjEwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Research leaders from OpenAI, Anthropic, and Google DeepMind are urging tech companies and research groups to monitor AI's \"thoughts.\"",
    "full_text": "Reasoning models are a core technology for powering AI agents, and the paper’s authors argue that CoT monitoring could be a core method to keep AI agents under control as they become more widespread and capable. “CoT monitoring presents a valuable addition to safety measures for frontier AI, offering a rare glimpse into how AI agents make decisions,” said the researchers in the position paper. “Yet, there is no guarantee that the current degree of visibility will persist. The position paper asks leading AI model developers to study what makes CoTs “monitorable” — in other words, what factors can increase or decrease transparency into how AI models really arrive at answers. However, there’s relatively little understood about how AI reasoning models work. Anthropic has been one of the industry’s leaders in figuring out how AI models really work — a field called interpretability. Earlier this year, CEO Dario Amodei announced a commitment to crack open the black box of AI models by 2027 and invest more in interpretability. He called on OpenAI and Google DeepMind to research the topic more, as well. Early research from Anthropic has indicated that CoTs may not be a fully reliable indication of how these models arrive at answers. At the same time, OpenAI researchers have said that CoT monitoring could one day be a reliable way to track alignment and safety in AI models."
  },
  {
    "title": "Venture gets a rare Native American-led fund in Betsy Fore’s Velveteen Ventures",
    "slug": "venture-gets-a-rare-native-american-led-fund-in-betsy-fores-velveteen-ventures",
    "link": "https://techcrunch.com/2025/07/15/venture-gets-a-rare-native-american-led-fund-in-betsy-fores-velveteen-ventures/",
    "published": "2025-07-15 16:00",
    "image": "https://images.unsplash.com/photo-1530043123514-c01b94ef483b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjb21tdW5pdHklMjBzZWN0b3JzfGVufDB8fHx8MTc1MjU5NjEwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The firm will look to invest $500,000 to $4 million in 15-20 seed and Series A companies in the healthcare, climate, consumer, and community sectors.",
    "full_text": "When Betsy Fore was five, her grandmother got her a gift she has never forgotten: A Velveteen Rabbit from Goodwill that Fore believed, with enough love, could spring alive. “I realized after building companies for nearly two decades that I could make the greatest ripple in this one precious life by being on the other side of the table,” she told TechCrunch. “Instead of building one thing, I can help other founders build dozens of life-changing companies,” Fore said. Fore declined to share what amount the firm’s fund would aim to raise, but SEC filings show it started raising in October. A few years ago, when TechCrunch looked for funding statistics for Native American founders, the numbers were so low that they almost couldn’t be accurately pulled. Save $450 on your TechCrunch All Stage pass Build smarter. “I have found that when we do bring on an LP, it’s because they were searching for us,” she said. Joining Fore at Velveteen is Karla Brollier, also of Native descent, who hails from Patagonia and will lead climate investments at the firm. Fore said she hopes to honor her ancestors as she runs the fund, adding that a portion of Fund I’s carry will go to Native American tribes. “While not an impact fund,” she said, “Velveteen plans on proving that profits and purpose go hand in hand.”"
  },
  {
    "title": "Mistral releases Voxtral, its first open source AI audio model",
    "slug": "mistral-releases-voxtral-its-first-open-source-ai-audio-model",
    "link": "https://techcrunch.com/2025/07/15/mistral-releases-voxtral-its-first-open-source-ai-audio-model/",
    "published": "2025-07-15 15:14",
    "image": "https://images.unsplash.com/photo-1662813810332-ebb5345b0c53?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmcmVuY2glMjBzdGFydHVwJTIwbWlzdHJhbHxlbnwwfHx8fDE3NTI1OTI1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "French startup Mistral has jumped into the audio race with Voxtral, its first open model, aiming to challenge the dominance of walled-off corporate systems with open-weight alternatives.",
    "full_text": "As AI systems become more capable, speech is fast becoming the default way we communicate with machines. French AI startup Mistral has jumped into the audio race with its first open model, aiming to challenge the dominance of walled-off corporate systems with open-weight alternatives. The company is pitching Voxtral as the first open model that’s capable of deploying “truly usable speech intelligence in production.” For businesses, that means Voxtral offers an affordable alternative that the company claims is “less than half the price” of comparable solutions. Mistral says Voxtral can transcribe up to 30 minutes of audio. Save $450 on your TechCrunch All Stage pass Build smarter. There’s also an ultra-cheap, stripped-down, fast API version of the 3 billion model called Voxtral Mini Transcribe that is optimized for transcription-only use cases and promises to outperform OpenAI Whisper for less than half the price. Users can try Voxtral for free by downloading the API on Hugging Face or testing the models in Mistral’s chatbot Le Chat. The launch comes a month after Mistral announced Magistral, its first family of reasoning models that work through problems step-by-step for improved reliability. Earlier this month, TechCrunch reported that the company is in talks to raise up to $1 billion in equity from investors like Abu Dhabi’s MGX fund."
  },
  {
    "title": "A comprehensive list of 2025 tech layoffs",
    "slug": "a-comprehensive-list-of-2025-tech-layoffs",
    "link": "https://techcrunch.com/2025/07/15/tech-layoffs-2025-list/",
    "published": "2025-07-15 15:10",
    "image": "https://images.unsplash.com/photo-1642933527149-97cdbc93bf6e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxtb250aCUyMHRocm91Z2hvdXQlMjAyMDI0fGVufDB8fHx8MTc1MjU5MjUwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
    "full_text": "Last year saw more than 150,000 job cuts across 549 companies, according to independent layoffs tracker Layoffs.fyi. Below you’ll find a comprehensive list of all the known tech layoffs that have occurred in 2025, which will be updated regularly. The Seattle-based research and engineering startup recently launched EigenCloud, a platform that provides blockchain-level trust guarantees for any Web 2.0 or web3 application. The startup said it intends to keep on recruiting employees who fit in with its long-term expansion plans. The move comes ahead of Intel’s Q1 earnings call helmed by recently appointed CEO Lip-Bu Tan, who took over from longtime chief Pat Gelsinger last year. The company is also making reductions in its facilities, though it does not plan to close any offices. Will cut roughly 5% of its current workforce in a new efficiency drive to increase profitability and growth. Laid off more employees in a new effort to cut costs, though the total number is unknown. Is shutting down its operations amid “ongoing challenges in healthcare.” It’s unclear the number of employees affected. Cut 51 jobs in its San Francisco headquarters, according to state filings with the Employment Development Department."
  },
  {
    "title": "Uber’s latest robotaxi partner is China’s Baidu",
    "slug": "ubers-latest-robotaxi-partner-is-chinas-baidu",
    "link": "https://techcrunch.com/2025/07/15/ubers-latest-robotaxi-partner-is-chinas-baidu/",
    "published": "2025-07-15 15:02",
    "image": "https://images.unsplash.com/photo-1672717958975-88e91fe48ea9?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhdXRvbm9tb3VzJTIwdmVoaWNsZSUyMHBhcnRuZXJzfGVufDB8fHx8MTc1MjU5MjUwN3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Baidu is the latest addition to Uber's growing list of autonomous vehicle partners, which includes Waymo, Volkswagen, May Mobility, and Pony AI.",
    "full_text": "Uber has struck another deal with a robotaxi provider, and this time it’s with Chinese tech giant Baidu. The two companies announced Tuesday that they have agreed to a “multi-year strategic partnership to deploy thousands of Baidu’s Apollo Go autonomous vehicles (AVs) on the Uber platform” in multiple markets outside the U.S. and mainland China. Those deployments will start in Asia and the Middle East later this year, the companies said. Uber has been on a tear of AV partnerships lately as it looks to protect its ride-hailing business by embracing the rise of robotaxis. In May, Uber announced an expanded partnership with China’s WeRide that included a $100 million investment. Uber is reportedly also considering helping its founder Travis Kalanick finance a takeover of Pony AI. As fast as these partnerships have been coming, they are still in the very early stages. In this instance, riders initially won’t be able to request a Baidu AV in Uber’s app. Instead, the companies say the rider “may be presented with the option” to have their trip fulfilled by a fully driverless Apollo Go AV. This is similar to how some of Uber’s other partnerships already work."
  },
  {
    "title": "Reddit rolls out age verification in the UK to comply with new rules",
    "slug": "reddit-rolls-out-age-verification-in-the-uk-to-comply-with-new-rules",
    "link": "https://techcrunch.com/2025/07/15/reddit-rolls-out-age-verification-in-the-uk-to-comply-with-new-rules/",
    "published": "2025-07-15 14:55",
    "image": "https://images.unsplash.com/photo-1646489341959-31f8113a4fbc?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhY2Nlc3MlMjBwb3RlbnRpYWxseSUyMGhhcm1mdWwlMjBjb250ZW50fGVufDB8fHx8MTc1MjU5MTYwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Reddit users in the UK will have to upload their ID or a selfie to access potentially harmful content.",
    "full_text": "Reddit users in the United Kingdom are now required to verify their age as a way to prevent children from accessing inappropriate content. The new requirement comes after the U.K.’s Online Safety Act (OSA) introduced new steps for platforms to take to block children from encountering harmful content, like pornography and material promoting self-harm. Reddit will use the third-party service Persona to confirm a user’s age, necessitating users to submit a picture of their government-issued identity documents or take a selfie. Reddit said it will not have access to these images, and will only save the person’s verification status and their date of birth. Restricted content to be hidden from users under 18 includes sexually explicit posts, anything that encourages suicide and disordered eating, and posts that spread hate against other people based on their race, religion, sex, sexual orientation, disability, and gender, among other violent and harmful content. Critics have long warned of the security and privacy risks associated with private companies collecting and storing large amounts of people’s identity documents. Last week, Bluesky announced that users in the U.K. will be required to verify their age in light of OSA’s update."
  },
  {
    "title": "Rivian taps Google to bring custom maps into its EVs and app",
    "slug": "rivian-taps-google-to-bring-custom-maps-into-its-evs-and-app",
    "link": "https://techcrunch.com/2025/07/15/rivian-taps-google-to-bring-custom-maps-into-its-evs-and-app/",
    "published": "2025-07-15 14:30",
    "image": "https://images.unsplash.com/photo-1639060015191-9d83063eab2a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjBtYXBwaW5nJTIwc3lzdGVtfGVufDB8fHx8MTc1MjU5MDcwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Rivian vehicles will soon replace its Mapbox-based maps with Google Maps. The integration will still see a lot of Rivian DNA in the new mapping system, though.",
    "full_text": "For 18 months, Rivian and Google engineers worked together. For years, Google has pushed into automotive through its smartphone projection app called Android Auto, as well as Google Built-In, an Android Automotive operating system that integrates Google services directly into the vehicle and is used by automakers like Volvo. “We obviously closely watch customer feedback, and I think one of the areas where we had some level of criticism was navigation,” Bensaid said. The company could have tried to incrementally improve its existing in-car navigation. Instead, it started working with Google to launch a new product. “Google really wanted to embrace a new model of collaboration with a more open integration down to the API levels for Google Maps, and that required working with a tech partner on that journey to integrate both solutions, and I think we’re really super happy with the result of this collaboration,” he said. Save $450 on your TechCrunch All Stage pass Build smarter. Carrying over Rivian’s trip planner is crucial as it showcases EV range estimates and charging stop selection, all powered by A Better Routeplanner. The new Google-based maps will start to roll out today via a software update in Rivian vehicles and its mobile app. The updated Rivian mobile app will include additional trip planning features as well."
  }
]