[
  {
    "title": "Mistral releases Voxtral, its first open source AI audio model",
    "slug": "mistral-releases-voxtral-its-first-open-source-ai-audio-model",
    "link": "https://techcrunch.com/2025/07/15/mistral-releases-voxtral-its-first-open-source-ai-audio-model/",
    "published": "2025-07-15 15:14",
    "image": "https://images.unsplash.com/photo-1662813810332-ebb5345b0c53?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmcmVuY2glMjBzdGFydHVwJTIwbWlzdHJhbHxlbnwwfHx8fDE3NTI1OTI1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "French startup Mistral has jumped into the audio race with Voxtral, its first open model, aiming to challenge the dominance of walled-off corporate systems with open-weight alternatives.",
    "full_text": "As AI systems become more capable, speech is fast becoming the default way we communicate with machines. French AI startup Mistral has jumped into the audio race with its first open model, aiming to challenge the dominance of walled-off corporate systems with open-weight alternatives. The company is pitching Voxtral as the first open model that’s capable of deploying “truly usable speech intelligence in production.” For businesses, that means Voxtral offers an affordable alternative that the company claims is “less than half the price” of comparable solutions. Mistral says Voxtral can transcribe up to 30 minutes of audio. The company is offering up two variants of its “speech understanding models”. Save $450 on your TechCrunch All Stage pass Build smarter. There’s also an ultra-cheap, stripped-down, fast API version of the 3B model called Voxtral Mini Transcribe that is optimized for transcription-only use cases and promises to outperform OpenAI Whisper for less than half the price. The launch comes a month after Mistral announced Magistral, its first family of reasoning models that work through problems step-by-step for improved reliability. Earlier this month, TechCrunch reported that the company is in talks to raise up to $1 billion in equity from investors like Abu Dhabi’s MGX fund."
  },
  {
    "title": "A comprehensive list of 2025 tech layoffs",
    "slug": "a-comprehensive-list-of-2025-tech-layoffs",
    "link": "https://techcrunch.com/2025/07/15/tech-layoffs-2025-list/",
    "published": "2025-07-15 15:10",
    "image": "https://images.unsplash.com/photo-1642933527149-97cdbc93bf6e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxtb250aCUyMHRocm91Z2hvdXQlMjAyMDI0fGVufDB8fHx8MTc1MjU5MjUwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
    "full_text": "Last year saw more than 150,000 job cuts across 549 companies, according to independent layoffs tracker Layoffs.fyi. Below you’ll find a comprehensive list of all the known tech layoffs that have occurred in 2025, which will be updated regularly. The startup said it intends to keep on recruiting employees who fit in with its long-term expansion plans. The move comes ahead of Intel’s Q1 earnings call helmed by recently appointed CEO Lip-Bu Tan, who took over from longtime chief Pat Gelsinger last year. The company is also making reductions in its facilities, though it does not plan to close any offices. Will cut roughly 5% of its current workforce in a new efficiency drive to increase profitability and growth. Laid off more employees in a new effort to cut costs, though the total number is unknown. Is shutting down its operations amid “ongoing challenges in healthcare.” It’s unclear the number of employees affected. Cut 51 jobs in its San Francisco headquarters, according to state filings with the Employment Development Department. Announced in an internal memo that it will cut 5% of its staff targeting “low performers” as the company prepares for “an intense year.” As of its latest quarterly report, Meta currently has more than 72,000 employees."
  },
  {
    "title": "Google’s next Pixel Fold might be completely dust-proof",
    "slug": "googles-next-pixel-fold-might-be-completely-dust-proof",
    "link": "https://www.theverge.com/news/707353/google-pixel-10-pro-fold-10-water-dust-resistance-rumor",
    "published": "2025-07-15 11:09",
    "image": "https://images.unsplash.com/photo-1534414964648-2361434563f1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx1cGNvbWluZyUyMHBpeGVsJTIwMTAlMjBwcm8lMjBmb2xkJTIwY291bGR8ZW58MHx8fHwxNzUyNTkyNTEzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Google’s upcoming Pixel 10 Pro Fold could be the first dust-proof foldable. A new leak published by Android Headlines says the Pixel 10 Pro Fold may come with an IP68 rating, which would make it completely dust-tight and allow it to withstand continuous submersion in water. To compare, Samsung’s new Galaxy Z Fold 7 and […]",
    "full_text": "Previously, she was a writer and editor at MUO. Google’s upcoming Pixel 10 Pro Fold could be the first dust-proof foldable. A new leak published by Android Headlines says the Pixel 10 Pro Fold may come with an IP68 rating, which would make it completely dust-tight and allow it to withstand continuous submersion in water. To compare, Samsung’s new Galaxy Z Fold 7 and the Motorola Razer Ultra have an IP48 rating, which means the phones offer similar protection against submersion in water, but aren’t completely dust-proof. Instead, they’re only capable of sealing out objects 1mm and larger. Additionally, Android Headlines reports that the Pixel 10 Pro Fold could have a smaller gap between the cover display and the hinge, resulting in a slightly larger 6.4-inch outer screen when compared to 6.3 inches on last year’s model. The cover screen could also come with an upgraded 3,000 nits of peak brightness. Along with Google’s 3nm Tensor G5 processor and 16GB of RAM, Android Headlines says the Pixel 10 Pro Fold might have a new 1TB storage option, in addition to the 256GB and 512GB variants. Google is also rumored to include a 7 percent larger battery in its new foldable when compared to the Pixel 9 Pro Fold, but other than that, it seems like things may largely stay the same. A previous leak from Android Headlines revealed that the new foldable could have the same 8-inch inner display size as its predecessor, and may still be thicker than the ultra-slim Galaxy Z Fold 7."
  },
  {
    "title": "Uber’s latest robotaxi partner is China’s Baidu",
    "slug": "ubers-latest-robotaxi-partner-is-chinas-baidu",
    "link": "https://techcrunch.com/2025/07/15/ubers-latest-robotaxi-partner-is-chinas-baidu/",
    "published": "2025-07-15 15:02",
    "image": "https://images.unsplash.com/photo-1672717958975-88e91fe48ea9?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhdXRvbm9tb3VzJTIwdmVoaWNsZSUyMHBhcnRuZXJzfGVufDB8fHx8MTc1MjU5MjUwN3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Baidu is the latest addition to Uber's growing list of autonomous vehicle partners, which includes Waymo, Volkswagen, May Mobility, and Pony AI.",
    "full_text": "Uber has struck another deal with a robotaxi provider, and this time it’s with Chinese tech giant Baidu. The two companies announced Tuesday that they have agreed to a “multi-year strategic partnership to deploy thousands of Baidu’s Apollo Go autonomous vehicles (AVs) on the Uber platform” in multiple markets outside the U.S. and mainland China. Those deployments will start in Asia and the Middle East later this year, the companies said. Uber has been on a tear of AV partnerships lately as it looks to protect its ride-hailing business by embracing the rise of robotaxis. In May, Uber announced an expanded partnership with China’s WeRide that included a $100 million investment. Uber is reportedly also considering helping its founder Travis Kalanick finance a takeover of Pony AI. As fast as these partnerships have been coming, they are still in the very early stages. In this instance, riders initially won’t be able to request a Baidu AV in Uber’s app. Instead, the companies say the rider “may be presented with the option” to have their trip fulfilled by a fully driverless Apollo Go AV. This is similar to how some of Uber’s other partnerships already work."
  },
  {
    "title": "The Pro 3 is 8BitDo’s first controller with swappable buttons",
    "slug": "the-pro-3-is-8bitdos-first-controller-with-swappable-buttons",
    "link": "https://www.theverge.com/news/706967/8bitdo-pro-3-wireless-bluetooth-controller-tmr-swappable-buttons",
    "published": "2025-07-15 11:00",
    "image": "https://images.unsplash.com/photo-1751606801826-6e324d3caf08?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhc3ltbWV0cmljYWwlMjBqb3lzdGljayUyMGxheW91dCUyMGxpa2UlMjBuaW50ZW5kb3xlbnwwfHx8fDE3NTI1OTE2MTN8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "8BitDo has released a new version of its wireless Pro controller that was last updated in 2021. Many of 8BitDo’s recent controller releases, including the Ultimate 2, feature an asymmetrical joystick layout like Nintendo and Microsoft use. But the new Pro 3 mirrors the design of the PlayStation DualSense controller, with side-by-side sticks that are […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. 8BitDo has released a new version of its wireless Pro controller that was last updated in 2021. Many of 8BitDo’s recent controller releases, including the Ultimate 2, feature an asymmetrical joystick layout like Nintendo and Microsoft use. The 8BitDo Pro 2 launched at $49.99 four years ago, but the new Pro 3 is debuting with a slightly steeper $69.99 price. 8BitDo has also switched to using a 1,000mAh rechargeable battery for the Pro 3, and while the company says it offers up to 20 hours of gameplay on a full charge, it’s not removable. The Pro 3 includes a convenient charging dock that doubles as storage for its 2.4GHz dongle. When the controller dies, it can still be used while connected to a console via USB, and it will charge while you play. The Pro 3 launches in three different colors with matching charging docks. The Pro 3’s design is nearly identical to the Pro 2, but it’s gained a few extra buttons. Although the ergonomics are questionable, 8BitDo is also including a pair of arcade-style ball-top caps that can be attached to the Pro 3’s joysticks."
  },
  {
    "title": "Reddit rolls out age verification in the UK to comply with new rules",
    "slug": "reddit-rolls-out-age-verification-in-the-uk-to-comply-with-new-rules",
    "link": "https://techcrunch.com/2025/07/15/reddit-rolls-out-age-verification-in-the-uk-to-comply-with-new-rules/",
    "published": "2025-07-15 14:55",
    "image": "https://images.unsplash.com/photo-1646489341959-31f8113a4fbc?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhY2Nlc3MlMjBwb3RlbnRpYWxseSUyMGhhcm1mdWwlMjBjb250ZW50fGVufDB8fHx8MTc1MjU5MTYwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Reddit users in the UK will have to upload their ID or a selfie to access potentially harmful content.",
    "full_text": "Reddit users in the United Kingdom are now required to verify their age as a way to prevent children from accessing inappropriate content. The new requirement comes after the U.K.’s Online Safety Act (OSA) introduced new steps for platforms to take to block children from encountering harmful content, like pornography and material promoting self-harm. Reddit will use the third-party service Persona to confirm a user’s age, necessitating users to submit a picture of their government-issued identity documents or take a selfie. Reddit said it will not have access to these images, and will only save the person’s verification status and their date of birth. Restricted content to be hidden from users under 18 includes sexually explicit posts, anything that encourages suicide and disordered eating, and posts that spread hate against other people based on their race, religion, sex, sexual orientation, disability, and gender, among other violent and harmful content. Critics have long warned of the security and privacy risks associated with private companies collecting and storing large amounts of people’s identity documents. Last week, Bluesky announced that users in the UK will be required to verify their age in light of OSA’s update."
  },
  {
    "title": "Rivian taps Google to bring custom maps into its EVs and app",
    "slug": "rivian-taps-google-to-bring-custom-maps-into-its-evs-and-app",
    "link": "https://techcrunch.com/2025/07/15/rivian-taps-google-to-bring-custom-maps-into-its-evs-and-app/",
    "published": "2025-07-15 14:30",
    "image": "https://images.unsplash.com/photo-1639060015191-9d83063eab2a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjBtYXBwaW5nJTIwc3lzdGVtfGVufDB8fHx8MTc1MjU5MDcwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Rivian vehicles will soon replace its Mapbox-based maps with Google Maps. The integration will still see a lot of Rivian DNA in the new mapping system, though.",
    "full_text": "For 18 months, Rivian and Google engineers worked together. “We obviously closely watch customer feedback, and I think one of the areas where we had some level of criticism was navigation,” Bensaid said. The company could have tried to incrementally improve its existing in-car navigation. Instead, it started working with Google to launch a new product. “Google really wanted to embrace a new model of collaboration with a more open integration down to the API levels for Google Maps, and that required working with a tech partner on that journey to integrate both solutions, and I think we’re really super happy with the result of this collaboration,” he said. Save $450 on your TechCrunch All Stage pass Build smarter. Carrying over Rivian’s trip planner is crucial as it showcases EV range estimates and charging stop selection, all powered by A Better Routeplanner. The new Google-based maps will start to roll out today via a software update in Rivian vehicles and its mobile app. The updated Rivian mobile app will include additional trip planning features as well. Rivian said it added place photos, place descriptions and satellite view (with a Connect+ subscription), as well as the ability to see traffic and traffic incidents in the app."
  },
  {
    "title": "Rwazi raises $12M Series A to help companies with consumer insights and intelligence",
    "slug": "rwazi-raises-12m-series-a-to-help-companies-with-consumer-insights-and-intelligence",
    "link": "https://techcrunch.com/2025/07/15/rwazi-raises-12m-series-a-to-help-companies-with-consumer-insights-and-intelligence/",
    "published": "2025-07-15 14:30",
    "image": "https://images.unsplash.com/photo-1510168857767-25918342e7aa?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwxMiUyMG1pbGxpb24lMjBzZXJpZXN8ZW58MHx8fHwxNzUyNTkwNzA2fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Rwazi has raised a $12 million Series A led by Bonfire Ventures to help companies with market intelligence and consumer insights",
    "full_text": "Joseph Rutakanga spent eight years looking for tools to help companies gather consumer insight data. Now his startup, called Rwazi, has raised a $12 million Series A led by Bonfire Ventures to help companies with market intelligence and consumer insights. He founded the company in 2021 with co-founder Eric Sewankambo. At first, he thought to solve the issue by purchasing statistics from government trade agencies. The company previously raised a $4 million seed round in 2022, also led by Bonfire Ventures. Save $450 on your TechCrunch All Stage pass Build smarter. It currently pulls data from 190 countries, with customers primarily in the U.S. and Europe. Rwazi does have competition,n including from legacy consumer insights companies GFK and Ipsos. But Rutakangwa said Rwazi is different from its competitors because it doesn’t rely on modeled or inferred data. Instead, its own infrastructure allows for insight and execution; knowing what to do and what to do about it, he continued."
  },
  {
    "title": "Apple commits $500M to U.S.-based rare earth recycling firm MP Materials",
    "slug": "apple-commits-500m-to-u-s-based-rare-earth-recycling-firm-mp-materials",
    "link": "https://techcrunch.com/2025/07/15/apple-commits-500m-to-u-s-based-rare-earth-recycling-firm-mp-materials/",
    "published": "2025-07-15 14:25",
    "image": "https://images.unsplash.com/photo-1666317411591-924603dbe861?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZW9keW1pdW0lMjBtYWduZXQlMjBtYW51ZmFjdHVyaW5nJTIwbGluZXMlMjBzcGVjaWZpY2FsbHklMjBkZXNpZ25lZHxlbnwwfHx8fDE3NTI1ODk4MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The factory will develop a series of neodymium magnet manufacturing lines specifically designed for Apple products.",
    "full_text": "Apple is investing $500 million in MP Materials, the only fully integrated rare earth mining company currently operating in the United States, as part of a broader effort to strengthen the domestic rare earth supply chain. The tech giant announced on Tuesday that with this deal, it’s committed to buying American-made rare earth magnets developed at MP Materials’ flagship facility in Fort Worth, Texas. The factory will develop a series of neodymium magnet manufacturing lines specifically designed for Apple products. Apple says that once the American-made magnets are built, they will be shipped across the country and all over the world to help address increasing global demand for the material. The two companies will also collaborate to establish a rare earth recycling line in Mountain Pass, California. The facility will allow MP Materials to process recycled rare earth feedstock, including materials from used electronics and post-industrial scrap, and reuse it in Apple products. In addition, the companies will work together to develop novel magnet materials and processing technologies to enhance magnet performance. Apple says the commitment announced on Tuesday is part of its pledge to spend more than $500 billion in the U.S. over the next four years. The tech giant first used recycled rare earth elements in the Taptic Engine of iPhone 11 in 2019. Today, almost all magnets across its devices are made with 100 percent recycled rare earth elements."
  },
  {
    "title": "Form’s Smart Swim 2 goggles add heart rate tracking",
    "slug": "forms-smart-swim-2-goggles-add-heart-rate-tracking",
    "link": "https://www.theverge.com/news/707287/form-smart-swim-2-goggles-heart-rate-compass",
    "published": "2025-07-15 10:03",
    "image": "https://images.unsplash.com/photo-1582703350891-906632773eeb?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxvcmlnaW5hbCUyMHNtYXJ0JTIwc3dpbSUyMGdvb2dsZXN8ZW58MHx8fHwxNzUyNTg4OTEyfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Nearly six years after introducing its original smart swim googles, Form has announced an upgraded version called the Smart Swim 2. The goggles carry forward the same features as the original, including a built-in 72 x 40-pixel display showing a swimmer’s various performance metrics. However, they’re now smaller and lighter, and while battery life is […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. Nearly six years after introducing its original smart swim googles, Form has announced an upgraded version called the Smart Swim 2. The Smart Swim 2 goggles are available starting today through Form’s online store for $279. The company also offers a Pro version for $329 with upgraded lenses made from Corning’s Gorilla Glass 3 that are more scratch resistant. A new optical heart rate sensor means swimmers don’t need to wear other fitness trackers if that’s a metric they care about. Being able to see your heart rate in real time during a swim (in addition to metrics like distance, stroke count, and calories burned) is another new feature that will appeal to athletes and competitive swimmers. When swimming in a lake or river, the Smart Swim 2 goggles can help keep you on course by showing your current compass bearing. For those who prefer swimming in open bodies of water, the Smart Swim 2’s digital compass, which shows your current bearing on the goggle’s display, can help keep you swimming in a straight line or towards a specific destination without constantly having to break your stroke to check your progress. However, that SwimStraight feature is locked behind Form’s optional $9.99 per month Premium subscription, which also unlocks additional features that will appeal to athletes, such as guided workouts and training plans. But given the smaller design, which potentially makes the new version more comfortable to wear, that feels like a minor trade-off."
  },
  {
    "title": "Apple Reportedly Taps Samsung Display for First Foldable iPhone Screens",
    "slug": "apple-reportedly-taps-samsung-display-for-first-foldable-iphone-screens",
    "link": "https://www.cnet.com/tech/mobile/apple-reportedly-taps-samsung-display-for-first-foldable-iphone-screens/#ftag=CAD590a51e",
    "published": "2025-07-15 14:00",
    "image": "https://www.cnet.com/a/img/resize/20b2fb7b0bdf35a6e1e9142d3c25c02e60ebf437/hub/2025/01/06/5a045083-85ee-43a2-af24-06a565809210/samsung-display-demo-concept-flexible-oled-5234.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Screen mass production is supposed to begin in the fourth quarter of this year, so the foldable iPhone can go on sale in 2026.",
    "full_text": "As we saw earlier this year, Samsung Display knows folds. And apparently that innovation has led them to a major win -- producing crease-free displays for the iPhone's first foldable cellphone in 2026. Samsung Display (SDC), which is an entirely separate company from Samsung itself that produces screens for many other companies, will reportedly begin mass production of its flexible folding screens later this year in time for Apple's foldable iPhone launch in summer 2026, as reported by Korea JoongAng Daily. Rumors that Apple will launch its first folding iPhone, possibly called the iPhone Flip, in 2026 are growing stronger, but Tuesday's report seems to indicate that Apple will not be producing its crease-free screens in-house. Industry insider Ming-Chi Kuo says the move could mean that Apple is more confident in SDC to \"ensure stable mass production of the foldable iPhone in 2026.\" In a phone market increasingly populated with foldables, Apple has taken its time to do it right (and they'd better). And why not deploy a company like Samsung Display, which boasts innovations include a double-folding display and even stretchable screens."
  },
  {
    "title": "Facebook creators who steal and repost videos could lose their monetization",
    "slug": "facebook-creators-who-steal-and-repost-videos-could-lose-their-monetization",
    "link": "https://www.theverge.com/news/707244/facebook-meta-stolen-reposted-content",
    "published": "2025-07-15 09:40",
    "image": "https://images.unsplash.com/photo-1521866337281-e7207a7159c9?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxyZXBlYXRlZGx5JTIwcmV1c2UlMjBzb21lb25lJTIwZWxzZSUyMCVFMiU4MCU5OXxlbnwwfHx8fDE3NTI1ODgwMTJ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Facebook is cracking down on accounts that steal and repost content from other users in an effort to reduce spam in feeds. Meta announced on Monday that creators who repeatedly reuse someone else’s videos, photos, or text posts will lose access to Facebook monetization programs for “a period of time,” and see reduced distribution of […]",
    "full_text": "Facebook is cracking down on accounts that steal and repost content from other users in an effort to reduce spam in feeds. Meta announced on Monday that creators who repeatedly reuse someone else’s videos, photos, or text posts will lose access to Facebook monetization programs for “a period of time,” and see reduced distribution of their posts on the platform. “Too often the same meme or video pops up repeatedly — sometimes from accounts pretending to be the creator and other times from different spammy accounts,” the company explained in its blog post. Meta says it’s also exploring ways to give creators the credit they deserve, such as testing a feature that adds links directing viewers to the original content. There’s no mention of whether Meta will introduce features for reducing repetitive content on its Instagram and Threads platforms. The Facebook changes are part of a larger effort to tackle spam and make original content more visible in feeds. The site has already taken action against 500,000 accounts in the first half of 2025 that engaged in spammy behavior or fake engagement. YouTube is making a similar push to tackle spammy, reposted content, announcing last week that it was updating its policies regarding mass-produced and repetitive videos, which have become far easier to churn out en masse thanks to increasing access to generative AI tools. Meta says the incoming change is designed to address “unoriginal content,” and shouldn’t impact creators who “add their unique take” when they reshare content, add commentary in a reaction video, or join in on a viral trend. It also suggests creators avoid using “visible third-party watermarks and content that is visibly recycled from other apps or sources.”"
  },
  {
    "title": "DOGE staffer with access to Americans’ personal data leaked private xAI API key",
    "slug": "doge-staffer-with-access-to-americans-personal-data-leaked-private-xai-api-key",
    "link": "https://techcrunch.com/2025/07/15/doge-staffer-with-access-to-americans-personal-data-leaked-private-xai-api-key/",
    "published": "2025-07-15 13:40",
    "image": "https://images.unsplash.com/photo-1687529699742-a7e97c518dca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwlRTIlODAlOUMlMjByYWlzZXMlMjBxdWVzdGlvbnMlMjAlRTIlODAlOUR8ZW58MHx8fHwxNzUyNTg3MTA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The researcher who found the exposed key said it “raises questions” about how DOGE handles sensitive data.",
    "full_text": "In Brief A DOGE staffer with access to the private information on millions of Americans held by the U.S. government reportedly exposed a private API key used for interacting with Elon Musk’s xAI chatbot. Independent security journalist Brian Krebs reports that Marko Elez, a special government employee who in recent months has worked on sensitive systems at the U.S. Treasury, the Social Security Administration, and Homeland Security, recently published code to his GitHub containing the private key. The key allowed access to dozens of models developed by xAI, including Grok. Philippe Caturegli, founder of consultancy firm Seralys, alerted Elez to the leak earlier this week. Elez removed the key from his GitHub but the key itself was not revoked, allowing continued access to the AI models. “If a developer can’t keep an API key private, it raises questions about how they’re handling far more sensitive government information behind closed doors,” Caturegli told KrebsOnSecurity."
  },
  {
    "title": "China’s Geely is officially bringing its luxury EV startup Zeekr private",
    "slug": "chinas-geely-is-officially-bringing-its-luxury-ev-startup-zeekr-private",
    "link": "https://techcrunch.com/2025/07/15/chinas-geely-is-officially-bringing-its-luxury-ev-startup-zeekr-private/",
    "published": "2025-07-15 13:32",
    "image": "https://images.unsplash.com/photo-1746439324859-b182173a9790?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsdXh1cnklMjBldiUyMHN1YnNpZGlhcnklMjB6ZWVrciUyMHByaXZhdGV8ZW58MHx8fHwxNzUyNTg3MTA2fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "China’s Geely Auto is officially taking its luxury EV subsidiary Zeekr private, just over a year after the company debuted on the New York Stock Exchange.",
    "full_text": "China’s Geely Auto is officially taking its luxury EV subsidiary Zeekr private, just over a year after the company debuted on the New York Stock Exchange. The news comes two months after Geely offered to take Zeekr private, following President Donald Trump’s threats earlier this year to delist Chinese stocks from U.S. exchanges. When the merger closes, Zeekr shareholders will receive either $2.69 in cash per share or 1.23 newly issued Geely shares for each Zeekr share they own, per a regulatory filing. Holders of Zeekr American depositary shares (ADSs), which each represent 10 Zeekr shares, will receive either $26.87 in cash or 12.3 Geely shares, delivered as Geely ADSs. It’s a slightly higher offering than what Geely first proposed in May. Investors can choose between cash or stock options, except for certain Hong Kong retail investors, who will receive cash by default. Zeekr’s board has already approved the merger, which is expected to close in the fourth quarter of 2025. It’s not clear how Zeekr’s move to go private will affect its deal with Waymo to build purpose-built robotaxis for large-scale deployment in the U.S. Waymo is expected to launch its Zeekr vehicles in the Bay Area this year, some of which have been spotted testing on the roads of San Francisco. TechCrunch has reached out to Waymo for more information."
  },
  {
    "title": "ParadeDB takes on Elasticsearch as interest in Postgres explodes amid AI boom",
    "slug": "paradedb-takes-on-elasticsearch-as-interest-in-postgres-explodes-amid-ai-boom",
    "link": "https://techcrunch.com/2025/07/15/paradedb-takes-on-elasticsearch-as-interest-in-postgres-explodes-amid-ai-boom/",
    "published": "2025-07-15 13:24",
    "image": "https://images.unsplash.com/photo-1631864032962-950ceb71ba9a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0cmFuc2ZlciUyMGRhdGF8ZW58MHx8fHwxNzUyNTg2MjA1fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "ParadeDB built a Postgres extension that facilitates full-text search and analytics on Postgres without the need to transfer data.",
    "full_text": "Open source database management system Postgres is nearly 40 years old, but has recently started seeing explosive demand due to being very well-suited for AI applications. Despite this rise in popularity, search and analytics functionality remain limited. ParadeDB is an open source Postgres extension that facilitates full-text search and analytics directly in Postgres without users needing to transfer data to a separate source. Noël said that Elasticsearch works by moving data back and forth between itself and Postgres, which can work, but this system isn’t great for heavy workloads or processes that require frequent updating. “The two databases are not meant to work together. Save $450 on your TechCrunch All Stage pass Build smarter. Noël said the company wasn’t looking to raise capital, but when Craft reached out to ParadeDB after being recommended to them by Supabase, the Postgres developer platform that has raised nearly $400 million of venture capital, they thought the timing made sense. “The different strengths of Neon versus Crunchy [Data] were definitely debated between both companies and what would suit their companies best, but Postgres was their first goal in those acquisitions.” “We think building on Postgres is actually a meaningful shift, right?” Noël said. “Because that’s where the data is, and you can make a meaningful dent in Elasticsearch’s market share by meeting users where their data is, rather than building something that’s marginally faster or marginally cheaper.”"
  },
  {
    "title": "Apple cuts a deal for recycling rare earth magnets in the US",
    "slug": "apple-cuts-a-deal-for-recycling-rare-earth-magnets-in-the-us",
    "link": "https://www.theverge.com/news/707249/apple-rare-earth-magnet-mp-materials-recycling",
    "published": "2025-07-15 09:19",
    "image": "https://images.unsplash.com/photo-1647211547023-8d5a78f82332?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxyYXJlJTIwZWFydGglMjBtaW5pbmclMjBjb21wYW55JTIwYmFzZWR8ZW58MHx8fHwxNzUyNTg2MjEyfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Apple has announced a $500 million investment in MP Materials, a rare earth mining company based in the US. With the deal, the two companies will partner on the development of a rare earth magnet recycling line in Mountain Pass, California, allowing Apple to use reprocessed electronics and scrap material to build its products. The […]",
    "full_text": "Previously, she was a writer and editor at MUO. Apple has announced a $500 million investment in MP Materials, a rare earth mining company based in the US. With the deal, the two companies will partner on the development of a rare earth magnet recycling line in Mountain Pass, California, allowing Apple to use reprocessed electronics and scrap material to build its products. Apple has worked with MP Materials for almost five years to pilot the new recycling technology, though the companies haven’t shared any details about when the initiative will kick off. The new deal with MPMaterials also involves expanding the rare earth company’s Fort Worth, Texas factory with neodymium magnet manufacturing lines designed for Apple products. MP Materials expects production to “ramp up to support hundreds of millions of Apple devices.” It will also continue collaborating with Apple to improve magnet production and end-of-life recovery. The partnership comes just months after MP Materials announced a deal with the Saudi Arabian Mining Company to establish an alternative to China’s dominant rare earths supply chain, which was put at risk due to Trump’s tariffs. The US and China have since signed onto a rare earths export deal. “Rare earth materials are essential for making advanced technology, and this partnership will help strengthen the supply of these vital materials here in the United States,” Apple CEO Tim Cook said in the press release. “We couldn’t be more excited about the future of American manufacturing, and we will continue to invest in the ingenuity, creativity, and innovative spirit of the American people.”"
  },
  {
    "title": "What Tariffs? Smartphone Market Grows 1% as More Devices Incorporate AI",
    "slug": "what-tariffs-smartphone-market-grows-1-as-more-devices-incorporate-ai",
    "link": "https://www.cnet.com/tech/mobile/what-tariffs-smartphone-market-grows-1-as-more-devices-incorporate-ai/#ftag=CAD590a51e",
    "published": "2025-07-15 13:14",
    "image": "https://www.cnet.com/a/img/resize/863ef950a96028630b77620b002501c0e1aa4265/hub/2025/07/09/af8990f9-808d-452d-8f33-a78974de6e6a/samsung-galaxy-a36-smartphone.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Midrange devices like Samsung's Galaxy A36 are driving sales by letting people try AI without busting their budgets.",
    "full_text": "Tiffany Connors Editor Tiffany Wendeln Connors is a senior editor for CNET Money with a focus on credit cards. Previously, she covered personal finance topics as a writer and editor at The Penny Hoarder. She is passionate about helping people make the best money decisions for themselves and their families. She graduated from Bowling Green State University with a bachelor's degree in journalism and has been a writer and editor for publications including the New York Post, Women's Running magazine and Soap Opera Digest. When she isn't working, you can find her enjoying life in St. Petersburg, Florida, with her husband, daughter and a very needy dog."
  },
  {
    "title": "xAI says it has fixed Grok 4’s problematic responses",
    "slug": "xai-says-it-has-fixed-grok-4s-problematic-responses",
    "link": "https://techcrunch.com/2025/07/15/xai-says-it-has-fixed-grok-4s-problematic-responses/",
    "published": "2025-07-15 13:12",
    "image": "https://images.unsplash.com/photo-1711993429213-d1ca2233211a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx4YWklMjBzYXlzfGVufDB8fHx8MTc1MjU4NTMwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "xAI says it fixed the issue with Grok 4 where the model said its surname was \"mechahitler.\"",
    "full_text": "But the Grok account on X that runs off the model immediately showed there were some major issues: it started saying its surname was “Hitler”, tweeted antisemitic messages, and seemed to reference Elon Musk’s posts when asked about controversial topics, siding with the xAI owner’s views as a result. xAI soon afterwards apologized for Grok’s behavior. On Tuesday, the company said it has now addressed both issues. One was that if you ask it \"What is your surname?\" it doesn't have one so it searches the internet leading to undesirable results, such as when its searches picked up a viral meme… — xAI (@xai) July 15, 2025 Explaining what went wrong, xAI says when asked what its surname was, Grok searched the web and picked up on “a viral meme where it called itself ‘MechaHitler.’” As for why Grok was consulting Musk’s posts when asked about controversial topics, the company wrote, “The model reasons that as an AI it doesn’t have an opinion but knowing it was Grok 4 by xAI, searches to see what xAI or Elon Musk might have said on a topic to align itself with the company.” There are also a few new lines, telling the model that it should provide analysis of controversial topics using various diverse sources. Save $450 on your TechCrunch All Stage pass Build smarter. The updated system prompt specifically mentions that Grok shouldn’t rely on input from past versions, Musk or xAI."
  },
  {
    "title": "Google inks $3B deal to buy hydropower from Brookfield",
    "slug": "google-inks-3b-deal-to-buy-hydropower-from-brookfield",
    "link": "https://techcrunch.com/2025/07/15/google-inks-3b-deal-to-buy-hydropower-from-brookfield/",
    "published": "2025-07-15 13:05",
    "image": "https://images.unsplash.com/photo-1666618509094-64d78fa7c61d?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxicm9va2ZpZWxkJTIwcmVuZXdhYmxlJTIwZW5lcmd5JTIwcGFydG5lcnN8ZW58MHx8fHwxNzUyNTg1MzA1fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Google will pay more than $3 billion to source carbon-free hydropower from Brookfield Renewable Energy Partners' plants in Pennsylvania.",
    "full_text": "As it races to build ever larger data centers, Google on Tuesday said it has agreed to pay more than $3 billion to source carbon-free hydropower from Brookfield Asset Management’s company, Brookfield Renewable Energy Partners. The first contracts under the deal include 20-year power purchase agreements, the companies said, altogether amounting to $3 billion, for 670 megawatts of capacity from two hydropower plants in Pennsylvania. The deal is part of a broader framework agreement that will allow Google to source up to 3 gigawatts of capacity in total. The deal comes as Google and its hyperscaler rivals, Meta, Amazon, and Microsoft, seek to source power for their seemingly ever-expanding data centers that they use to house, train, and host the AI tools that underpin the tech sector’s current boom. This renewed demand for power has breathed new life into nuclear energy, boosted gas generation, and brought back focus on renewable energy. Google itself has committed tens of billions to making sure it won’t run out of power; Meta more or less bought a nuclear plant; and Microsoft has struck a deal to source power for 20 years from a nuclear plant next to another one that melted down nearly 50 years ago. Power aside, renewable energy also presents an attractive opportunity for these companies to continue working towards their net-zero targets even as their burgeoning data centers add to their carbon emissions. Brookfield Renewable Partners, which operates renewable energy plants in the U.S., said its two hydropower facilities in Pennsylvania, Holtwood and Safe Harbor, will be relicensed, upgraded, or overhauled to meet the new requirements. “This collaboration with Brookfield is a significant step forward, ensuring clean energy supply in the PJM region where we operate. Hydropower is a proven, low-cost technology, offering dependable, homegrown, carbon-free electricity that creates jobs and builds a stronger grid for all,” Amanda Peterson Corio, head of data center energy at Google, said in a statement."
  },
  {
    "title": "Motorola and Swarovski Tease an Aug. 5 Event That May Bring Crystals to a Phone",
    "slug": "motorola-and-swarovski-tease-an-aug-5-event-that-may-bring-crystals-to-a-phone",
    "link": "https://www.cnet.com/tech/mobile/motorola-and-swarovski-tease-an-aug-5-event-that-may-bring-crystals-to-a-phone/#ftag=CAD590a51e",
    "published": "2025-07-15 13:02",
    "image": "https://www.cnet.com/a/img/resize/1cfde51af616b1d4f4f4f39a1ce6bf4065493b1c/hub/2025/07/15/3aa0a004-3fa4-429a-9b7e-58c4e8174653/moto-buds-loop.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Motorola's already introduced wood and fabric to the Razr Ultra. Are crystals next?",
    "full_text": "Motorola may be ready to debut a new phone design that features crystals, as the company is teasing an Aug. 5 event that's set to expand its partnership with Swarovski. Motorola has announced the upcoming event on Tuesday with a teaser video that shows the recently released Moto Buds Loop with Swarovski crystals. Motorola has been particularly focused on combining fashionable colors and materials in recent years, with the $1,300 Razr Ultra including models that feature wood and Alcantara fabric finishes. If Motorola is indeed announcing a phone that features Swarovski crystals, it would likely be coming to either the Edge line or the foldable Razr series. The Razr would also be a likely option, since Motorola has already made a point to release it in multiple bold color choices. There are other, more niche efforts to combine luxury materials with mobile phones. More recently, RedMagic released a gaming phone that features gold and silver elements. The company Vertu has also been selling high-priced phones for several years, with more recent phones costing $3,500 and up. It's unknown how a Motorola phone featuring Swarovski crystals would cost, but the Moto Buds Loop earbuds are priced higher than Apple's more traditional $249 AirPods Pro 2. We'll find out more about the partnership in a few weeks."
  },
  {
    "title": "Auriga Space raises $6M to shoot rockets off an electromagnetic launch track",
    "slug": "auriga-space-raises-6m-to-shoot-rockets-off-an-electromagnetic-launch-track",
    "link": "https://techcrunch.com/2025/07/15/auriga-space-raises-6m-to-shoot-rockets-off-an-electromagnetic-launch-track/",
    "published": "2025-07-15 13:00",
    "image": "https://images.unsplash.com/photo-1683363520390-bbe428d9be58?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx1c2luZyUyMGVsZWN0cm9tYWduZXRpYyUyMGZvcmNlc3xlbnwwfHx8fDE3NTI1ODUzMDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Auriga Space wants to reimagine launch by using electromagnetic forces.",
    "full_text": "While U.S.-based companies are launching more payloads into orbit than ever before, they’re still limited by the inefficiency of conventional rockets. Those magnets will accelerate a small rocket to over six times the speed of sound. Beyond propellant savings, the entire ground-based architecture is entirely (and rapidly) reusable. “Less than 2% of the mass of the rocket is what gets into space,” Auriga founder and CEO Winnie Lai explained in a recent interview. But Lai argues that recent advancements in power electronics, especially being able to operate at higher voltages and higher powers, finally make the concept technologically and commercially viable. Auriga has raised $12.2 million across VC and DOD grants to-date. The company has performed some initial studies on the survivability of satellite components under high-G loads that indicate they can survive higher Gs than standard testing assumed, Lai said. Auriga will go to market first with hypersonic ground testing: this most recent direct-to-phase II Small Business Innovation and Research grant from AFWERX (the company’s second) will be used to commercialize an indoor, lab-scale track called Prometheus early next year, and an outdoor accelerator for full-scale hypersonic test articles called Thor. Prometheus and Thor aim to fill that gap and provide a market capability that is sorely lacking: customers will be able to perform multiple tests on the same test article under different flight conditions, at a lower cost and higher cadence than what’s currently available. “I think that should be the case for space as well.”"
  },
  {
    "title": "Joby Aviation doubles pilot eVTOL facility capacity as it races to launch air taxis",
    "slug": "joby-aviation-doubles-pilot-evtol-facility-capacity-as-it-races-to-launch-air-taxis",
    "link": "https://techcrunch.com/2025/07/15/joby-aviation-doubles-pilot-evtol-facility-capacity-as-it-races-toward-air-taxi-launch/",
    "published": "2025-07-15 13:00",
    "image": "https://images.unsplash.com/photo-1749034924858-2009e20ac306?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjb21tZXJjaWFsaXplJTIwZWxlY3RyaWMlMjBhaXIlMjB0YXhpc3xlbnwwfHx8fDE3NTI1ODUzMDd8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Joby Aviation has doubled the size and production capacity of its pilot manufacturing facility in Marina, California as it races to commercialize electric air taxis by early next year.",
    "full_text": "Joby Aviation has doubled the size and production capacity of its pilot manufacturing facility in Marina, California, as it races to commercialize eVTOLs (electric vertical takeoff and landing vehicles) by early next year. The now-435,500-square-foot facility will be able to produce 24 aircraft per year, and “nearly one” every other week once fully operational, according to Joby. The facility will also support federal certification, ground and flight testing, pilot training, and aircraft maintenance. TechCrunch has asked when Joby expects to produce vehicles at full capacity, as well as for updates on Joby’s first scaled facility in Dayton, Ohio, which would build up to 500 aircraft per year once it’s constructed Joby has enlisted engineers from its investor Toyota to help build both sites. Toyota in May closed the first, $250 million tranche of a previously announced $500 million investment into Joby. The news of Joby’s expanded pilot facility comes as the eVTOL company adds a sixth aircraft to its fleet. Joby says the aircraft earned its airworthiness certification within a week of completion. Joby went public through a SPAC merger in 2021. The company plans to launch commercial operations first in Dubai in early 2026, and in a U.S. city afterwards."
  },
  {
    "title": "How the low-vision community embraced AI smart glasses",
    "slug": "how-the-low-vision-community-embraced-ai-smart-glasses",
    "link": "https://www.theverge.com/the-vergecast/701018/ray-ban-meta-smart-glasses-be-my-eyes-ceo-accessibility-tech",
    "published": "2025-07-15 09:00",
    "image": "https://images.unsplash.com/photo-1723698496634-fb0d623aee99?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxiYW4lMjBtZXRhJTIwc21hcnQlMjBnbGFzc2VzfGVufDB8fHx8MTc1MjU4NTMxNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "It's easy to scoff at AI and ask, \"Who is actually asking for this?\" You might also think that smart glasses \"aren't worth it yet.\" But to the blind and low-vision community, the Ray-Ban Meta smart glasses and their AI features have been an absolute life-altering game-changer. And we need to talk about it. On […]",
    "full_text": "Before coming to The Verge, she worked for Gizmodo and PC Magazine. It’s easy to scoff at AI and ask, “Who is actually asking for this?” You might also think that smart glasses “aren’t worth it yet.” But to the blind and low-vision community, the Ray-Ban Meta smart glasses and their AI features have been an absolute life-altering game-changer. On this episode of The Vergecast, we’re going to dive deep into why accessible design is universal design. Jason initially reached out to Victoria after her Live AI hands-on, challenging the notion that the feature was a “solution looking for a problem to solve.” Jason shares how the tech has helped him live a more independent life, what he’s hoping to see improve, and how the blind and low-vision community has enthusiastically embraced the technology. After that, Victoria sits down with Be My Eyes CEO Mike Buckley. Be My Eyes is an app that pairs blind and low-vision users with sighted volunteers to help them go about their day. And finally, we have features reporter Mia Sato on to answer a spicy question about smart glasses from the Vergecast Hotline (call 866-VERGE11 or email vergecast@theverge.com). Specifically, do smart glasses belong in the bedroom? Want to learn more about everything in this episode? Here’s some links for further reading — and a cute pic of Jason’s guide dog Noel!"
  },
  {
    "title": "Cyberpunk 2077 is launching for Mac on July 17th",
    "slug": "cyberpunk-2077-is-launching-for-mac-on-july-17th",
    "link": "https://www.theverge.com/news/707106/cyberpunk-2077-mac-release-date",
    "published": "2025-07-15 09:00",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/Cyberpunk2077_macos_City_of_Future_EN.png?quality=90&strip=all&crop=0%2C8.1151832460733%2C100%2C83.769633507853&w=1200",
    "summary": "Cyberpunk 2077 is coming to macOS later this week, after it was originally set to debut in early 2025. Cyberpunk 2077: Ultimate Edition will officially be available for Apple silicon devices for the first time on July 17th, from Apple’s own Mac App Store, Steam, Epic Games Store, and GOG.com. CD Projekt Red has optimized […]",
    "full_text": "Cyberpunk 2077 is coming to macOS later this week, after it was originally set to debut in early 2025. Only some M1 and M2 Macs are supported, though — you’ll need a Mac with 16GB or more of unified memory to play Cyberpunk 2077, so base 8GB M1 and M2 chips won’t be compatible. There will be graphics presets that are optimized for each Apple silicon model, and more powerful Apple silicon chips will also fully support features like path tracing, which is a film-like full ray tracing mode that greatly improves lighting and occlusion in the game. AMD’s FSR upscaling and frame generation will also be available in Cyberpunk 2077 on Mac, helping the game feel more smooth with options like path tracing enabled. There will be MetalFX upscaling, too, alongside support for Apple’s Magic Mouse and Trackpad hardware. Apple and CD Projekt Red haven’t shared performance data for what to expect across different Apple silicon Mac configurations. If you own an Apple XDR display, or any other HDR monitor, you’ll get HDR support in Cyberpunk 2077, and there’s even spatial audio and head-tracking with Apple AirPods. Mac owners have technically been able to run Cyberpunk 2077 on their devices for a couple years now, thanks to Apple’s own Proton-like game porting tool. This official release means the game takes full advantage of Apple silicon and Apple’s native Metal graphics APIs, including its Tile-Based Deferred Rendering (TBDR) architecture. Cyberpunk 2077 debuts on Mac just as CD Projekt Red releases the latest 2.3 patch for the game, which includes additional cars and new photo mode features."
  },
  {
    "title": "EcoFlow says its new Ocean Pro is better than Tesla&#8217;s Powerwall",
    "slug": "ecoflow-says-its-new-ocean-pro-is-better-than-tesla-s-powerwall",
    "link": "https://www.theverge.com/news/707153/ecoflow-launches-ocean-pro-home-energy-system-tesla-battery-competitor",
    "published": "2025-07-15 09:00",
    "image": "https://images.unsplash.com/photo-1694889648009-7d463d711dfa?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmaXJzdCUyMHBlcm1hbmVudGx5JTIwaW5zdGFsbGVkJTIwd2hvbGV8ZW58MHx8fHwxNzUyNTg1MzE2fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "EcoFlow is powering up its first permanently installed whole-home energy solution for the US. The Ocean Pro system launches this week, featuring the new Ocean Pro Battery with 10kWh of storage expandable to 80kWh, and the Ocean Pro Inverter, which supports solar arrays of up to 40kWh. EcoFlow claims the system delivers 24kW of continuous […]",
    "full_text": "is a smart home reporter who’s been testing connected gadgets since 2013. EcoFlow is powering up its first permanently installed whole-home energy solution for the US. Ocean Pro will also work with EcoFlow’s new Smart Home Panel for more advanced energy monitoring and control capabilities. Ocean Pro’s support for 40kWh rooftop solar arrays is double that of the Tesla Powerwall 3, and it can handle eight batteries on one inverter, compared to only 3 for Tesla. “We have UL 9540B safety certification approval, which means it’s safe enough to be installed in the house,” Felipe Burga of EcoFlow said in an interview with The Verge. That modular solution uses its portable power products to create a battery wall and works with EcoFlow’s original smart home panel. The new Smart Home Panel features an LED screen that shows real-time energy use. But Burga says EcoFlow is fully committed to its expansion into the US. The market is going to shift, and we are very committed.” “They don’t want to depend on the monopoly that energy companies have become.”"
  },
  {
    "title": "Move Over Telsa Powerwall. EcoFlow Says This New Battery Is Better for Disaster-Prone Areas",
    "slug": "move-over-telsa-powerwall-ecoflow-says-this-new-battery-is-better-for-disaster-prone-areas",
    "link": "https://www.cnet.com/news/move-over-telsa-powerwall-ecoflow-ocean-pro-home-battery-backup-disaster-prone-areas/#ftag=CAD590a51e",
    "published": "2025-07-15 13:00",
    "image": "https://www.cnet.com/a/img/resize/61d6781ba01b28c41f669a24c2fce666a5bd8314/hub/2025/07/14/092b8d00-e601-43ee-bcc2-3795c55c4910/whole-home-power-car.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "EcoFlow's new Ocean Pro is a home power backup designed for homeowners in disaster-prone states and meant to challenge Tesla's Powerwall.",
    "full_text": "That means multiple layers of power backup options if one option fails. The Ocean Pro can be expanded to work with multiple batteries and inverters. During an outage, the Ocean Pro has a switchover of 10 milliseconds. Through the EcoFlow app, users can monitor their energy usage in real time and use AI-powered forecasting to predict weather, pricing trends and energy consumption so it can take over running their homes during times of high peak demand. EcoFlow says the Ocean Pro can give you savings of up to 118% a year on electricity costs. EcoFlow is also setting up its Virtual Power Plant network, which manages the energy you’re selling back based on real-time grid conditions and electricity prices. By design, the Ocean Pro will discharge power during peak pricing peak grid demand, letting your system optimize battery use and earning you additional income even when solar generation is limited. Each installation includes a free one-on-one energy consultation, app-based progress tracking and local support. Nearly 100 installation partners have signed up with EcoFlow ahead of the launch. The Ocean Pro is available in three finishes: aluminum, walnut wood and carbon fiber."
  },
  {
    "title": "Nearly Half of Americans Budget Based on Vibes. Should You?",
    "slug": "nearly-half-of-americans-budget-based-on-vibes-should-you",
    "link": "https://www.cnet.com/personal-finance/banking/nearly-half-of-americans-budget-based-on-vibes-should-you/#ftag=CAD590a51e",
    "published": "2025-07-15 13:00",
    "image": "https://www.cnet.com/a/img/resize/d1dffc83e16dc75defeab1a6537185573fc501d5/hub/2025/07/14/b401aaf1-e7ed-44ba-b7bf-a25924c7fe44/gettyimages-957351516.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Emotions affect how you approach money. Here's how to use that to your advantage.",
    "full_text": "Your feelings about the economy can help you set a smarter money strategy. A vibe check can help you evaluate lots of things, including your money strategy. A June study by Intuit Credit Karma found that 44% of Americans surveyed have done \"vibe-based budgeting.\" Here's what to keep in mind when factoring vibes into your financial strategy. It's important to follow the headlines and prepare when things are scary, and channeling your fears into action can help you create healthy money habits that will serve you for years to come. In addition to vibe-based budgeting, there are other social media trends that could offer guidance. Bonus: We've recommended some affordable, easy-to-use budgeting apps that can help with each strategy. It may feel awkward at first, but you might be surprised by how many people appreciate your honesty. If the economy's bad vibes are tanking your mental health, soft saving could be a good strategy. Instead of scrimping and saving everything you can for the future, you put some money toward savings while allowing yourself to invest in your quality of life in the here and now."
  },
  {
    "title": "Galaxy S25 Ultra vs. iPhone 16 Pro: Best Camera Phones Compared",
    "slug": "galaxy-s25-ultra-vs-iphone-16-pro-best-camera-phones-compared",
    "link": "https://www.cnet.com/tech/mobile/galaxy-s25-ultra-vs-iphone-16-pro-best-camera-phones-compared/#ftag=CAD590a51e",
    "published": "2025-07-15 12:01",
    "image": "https://www.cnet.com/a/img/resize/532cb296f07ad9bbd00d97f282998ef5f43cbcd5/hub/2025/01/25/db1638a3-f1b9-4979-8c0f-f5789293a7f6/galaxy-s25-ultra-vs-iphone-16-pro-max.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Both Apple and Samsung's top phones can take amazing photos. But which one does it best?",
    "full_text": "But when it comes to overall image quality, how do these two mobile titans compare? While images from the Galaxy S25 have been uploaded as taken, the iPhone's images have had to be converted through Adobe Lightroom, as our publishing platform doesn't support Apple's default HEIF image format. The iPhone's image is again brighter here and I prefer its colors too. But in this example, the iPhone has produced a weirdly warm-looking image that I really don't like. That's definitely worth keeping in mind if you frequently like to cram lots of friends into your group pics. I've taken many more images not included here that both support some of my conclusions and argue against them. Those looking for a more natural base image to apply your own filters and effects over will be better suited with the iPhone 16 Pro. And on those rare occasions you may want to push things further, the iPhone's digital zoom can still deliver sharp results. There are other things for photographers to consider too: Apple's ProRaw is superb and while the company's Photographic Styles can be good for adding a creative look to your images, Samsung's new tool for mimicking the color grade from example photos you feed it works surprisingly well -- I actually think I might get more use out of that overall. But for simple picture quality, you may as well toss a coin."
  },
  {
    "title": "The Promise of Li-Fi Technology: What Is It and Can It Change the Future of the Internet?",
    "slug": "the-promise-of-li-fi-technology-what-is-it-and-can-it-change-the-future-of-the-internet",
    "link": "https://www.cnet.com/home/internet/what-is-li-fi/#ftag=CAD590a51e",
    "published": "2025-07-15 12:00",
    "image": "https://www.cnet.com/a/img/resize/d7f6d9002f790ef4052a9bdd2e9e6b1a0e361049/hub/2024/08/21/ecda4cda-1052-4f8b-88c6-cd22c246c78a/gettyimages-513735354.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Li-Fi technology harnesses the power of light. Can it change the way you connect to the internet?",
    "full_text": "Alongside his team, German physicist Harald Haas founded this technology by discovering that light can be used for two-way data transmission. While this technology isn't perfect or in full use yet, there are some key things you should know: Speed : More data is carried out faster through light sources than with radio waves used by Wi-Fi. Limited range : Your connection will be confined to closed spaces since this technology relies on light sources. If you don't mind paying the hefty price to try out this technology, then go for it. pureLiFi's new LINXCW Bridge System aims to make broadband deployment easier for both fixed wireless providers and customers. We're already seeing how Li-Fi can be promising for 5G home internet and other fixed wireless connections. Li-Fi is promising, as we see increased interest among companies in introducing new products and funding research to develop the standard. However, it's worth noting that trying this product out may come with a steep price tag. Over 95% of online gamers complain about experiencing latency issues while gaming, per a Liquid Web report."
  },
  {
    "title": "Fed Up With the Economy? Try Revenge Saving",
    "slug": "fed-up-with-the-economy-try-revenge-saving",
    "link": "https://www.cnet.com/personal-finance/banking/fed-up-with-the-economy-try-revenge-saving/#ftag=CAD590a51e",
    "published": "2025-07-15 12:00",
    "image": "https://www.cnet.com/a/img/resize/7f38de78ecaba0e8189f093356346413ce2ae7d6/hub/2025/07/14/e5d0415b-e00c-49cb-8887-321037fb6308/gettyimages-2197048036.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Stick it to economic uncertainty with this money trend.",
    "full_text": "Every day, my LinkedIn is filled with posts from victims of the latest layoffs. That's why I'm all about a new trend called revenge saving. I emerged from lockdown eager to make up for lost time. Revenge spending was a way to regain control and relieve the pressure after going through tough times. Revenge saving can do the same thing, but it's much healthier for your finances. In addition to the usual things that could derail your finances, like a sudden medical bill or pricey home repair, the threat of a job loss and runaway inflation have many of us on shaky ground. The national average savings rate is a measly 0.38%, but today's top deposit accounts can offer rates 10 times that amount (or more). CD rates are fixed, so your interest rate won't go down, but you must keep your money in the account for the full term or face early withdrawal penalties. I've struggled with remembering to set aside money each month. I set up an automated transfer every payday from my checking account to my savings account, so a set amount is put away before I can touch it."
  },
  {
    "title": "PlayStation Plus Subscribers Can Play Cyberpunk 2077 and More Games Now",
    "slug": "playstation-plus-subscribers-can-play-cyberpunk-2077-and-more-games-now",
    "link": "https://www.cnet.com/tech/gaming/playstation-plus-subscribers-can-play-cyberpunk-2077-and-more-games-now/#ftag=CAD590a51e",
    "published": "2025-07-15 11:00",
    "image": "https://www.cnet.com/a/img/resize/da64e62a875edae1a6a3d6d5ce622fb5e5b4d348/hub/2020/12/08/d337b9f1-41a0-43d1-9240-3749de2209f6/cyberpunk-2077-banner-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Subscribers -- and their kids -- can also play other games on PlayStation Plus, like the Bluey game, now.",
    "full_text": "When CD Projekt Red launched Cyberpunk 2077 in 2020, the game was plagued by bugs and glitches. Since then, the company has provided free updates and patches to the game to make it a fun, engaging and award-winning experience. And some PlayStation Plus subscribers can now play this dystopian sci-fi roleplaying game. There are three PlayStation Plus tiers -- Essential ($10 a month), Extra ($15 a month) and Premium ($18 a month) -- and each gives subscribers access to games. However, only Extra and Premium tier subscribers can access the PlayStation Plus Game Catalog. Here are all the games Extra and Premium subscribers can play now. Note, Sony will add Abiotic Factor to the PS Plus Game Catalog on June 22. You can also play games from the show, like Keepy Uppy and Chattermax Chase. PS Plus Extra and Premium subscribers can play this game on July 22. For more on PlayStation Plus, here's what to know about the service and a rundown of PS Plus Extra and Premium games added in June."
  },
  {
    "title": "Drop Into Tony Hawk's Pro Skater 3 and 4, Now on Xbox Game Pass",
    "slug": "drop-into-tony-hawk-s-pro-skater-3-and-4-now-on-xbox-game-pass",
    "link": "https://www.cnet.com/tech/gaming/drop-into-tony-hawks-pro-skater-3-4-now-on-xbox-game-pass/#ftag=CAD590a51e",
    "published": "2025-07-15 11:00",
    "image": "https://www.cnet.com/a/img/resize/e38a610b0fd8c9f6fcc85ab19f85a74268fd54a8/hub/2025/07/01/c38145d6-14d7-48e8-bae7-d4e346606e68/thps-34-titledheroart-1920x1080-c0128887cfbdf11c3d2a-1900x1080.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "High on Life also returned to Xbox Game Pass.",
    "full_text": "The Tony Hawk games were some of my favorites when I was growing up. Read more: Play Classic Games From the '80s and '90s on Xbox Game Pass Now You can also check out what games Microsoft brought to the service in June, like Call of Duty: WWII. Tony Hawk is back to shred in new areas, perform gnarly tricks and bring you more great music along the way. This revamped version of Tony Hawk's Pro Skater 3 and 4 also brings new skaters to the roster. This version of the game also has graphical improvements, a rearranged soundtrack and other modern enhancements. This version of the classic RPG includes graphic improvements, character voiceover support and a new ability system. But each player gets to build the level as they play. For more on Xbox, discover other games available on Game Pass now, read our hands-on review of the gaming service and learn which Game Pass plan is right for you. You can also check out what to know about upcoming Xbox game price hikes."
  },
  {
    "title": "Amogy raises $80M to power ships and data centers with ammonia",
    "slug": "amogy-raises-80m-to-power-ships-and-data-centers-with-ammonia",
    "link": "https://techcrunch.com/2025/07/15/amogy-raises-80m-to-power-ships-and-data-centers-with-ammonia/",
    "published": "2025-07-15 11:00",
    "image": "https://images.unsplash.com/photo-1588422273146-c799447ccb81?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZWNobm9sb2d5JTIwZ2VuZXJhdGVzJTIwcG93ZXJ8ZW58MHx8fHwxNzUyNTc4MTA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Amogy's technology generates power from ammonia without pollution, making it a prime candidate for decarbonizing maritime shipping.",
    "full_text": "From tariffs to the recent reconciliation bill, climate tech startups have been grappling with a rapidly changing landscape. The round was led by the Korea Development Bank and KDB Silicon Valley LLC with participation from BonAngels Venture Partners, JB Investment, and Pathway Investment. Normally, hydrogen is difficult to transport — it’s flammable and prone to leaking — but a hydrogen carrier like ammonia makes it easier. Typically, operators will replace some percentage of coal with ammonia. Ammonia has found fertile ground in that industry because the International Maritime Organization, which regulates maritime shipping, is going to begin levying a carbon tax starting in 2027. Save $450 on your TechCrunch All Stage pass Build smarter. But in any place where ammonia is burned — whether that’s a power plant or a ocean-going ship — it needs to have at least some fossil fuel combusted alongside it. First, the company cracks three hydrogen atoms off each nitrogen atom. The first systems will be on the smaller side, capable of producing 500 kilowatts to one megawatt of electricity, though customers can deploy several in parallel to generate more power. Asian countries are setting standards for how much carbon pollution can result from ammonia production."
  },
  {
    "title": "Starlink vs. T-Mobile 5G Home Internet: Clash of the Broadband Disruptors",
    "slug": "starlink-vs-t-mobile-5g-home-internet-clash-of-the-broadband-disruptors",
    "link": "https://www.cnet.com/home/internet/starlink-vs-t-mobile-5g-home-internet/#ftag=CAD590a51e",
    "published": "2025-07-15 11:00",
    "image": "https://www.cnet.com/a/img/resize/72772c382207f8fc3be9ad62a346c004037ac6a7/hub/2022/06/10/16d7369f-976b-463f-9030-dcb4f6b66b79/starlink-tmobile-internet-broadband-4888.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Trying to choose between Starlink or 5G internet from T-Mobile? Here's what you need to know.",
    "full_text": "Both providers offer extensive wireless coverage in places where fiber and cable can't reach, making them a top option for rural communities. Since both ISPs often overlap in coverage, there's a good chance you'll have to choose one or the other. Both providers offer maximum speeds of over 200 megabits per second, unlimited data and latency low enough to support online gaming. CNET’s reviews of each provider further suggest that T-Mobile 5G Home Internet may be a better option if it's available. You can expect a maximum download speed of 415 megabits per second, making it an ideal option for internet in rural areas. Still, latency from either provider is low enough that you likely wouldn’t notice a difference between Starlink and T-Mobile. Even in areas largely serviceable for T-Mobile 5G Home Internet, availability can vary by address and the current network capacity. Starlink isn’t included in ACSI data, but an Ookla Speedtest Intelligence report from the first quarter of 2023 gives insight into customer reception and satisfaction. Starlink outperformed other ISPs exceptionally well in nonmetropolitan settings, which makes sense as the service is geared toward rural internet users. T-Mobile Home Internet doesn't offer a similar service tier, so customers may be more likely to experience speed issues during peak usage times or in areas with many users relying on the network."
  },
  {
    "title": "The EU is testing a prototype age verification app",
    "slug": "the-eu-is-testing-a-prototype-age-verification-app",
    "link": "https://www.theverge.com/news/699151/eu-age-verification-app-dsa-enforcement",
    "published": "2025-07-15 06:33",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/STK450_EU_E.jpg?quality=90&strip=all&crop=0%2C9.9676601489831%2C100%2C80.064679702034&w=1200",
    "summary": "The European Union is piloting a blueprint for age verification apps in Denmark, Greece, Spain, France, and Italy that aims to make it easier for online platforms to comply with rules that require them to protect minors. The app prototype was announced on Monday alongside guidelines that online platforms are recommended to adopt in order […]",
    "full_text": "The European Union is piloting a blueprint for age verification apps in Denmark, Greece, Spain, France, and Italy that aims to make it easier for online platforms to comply with rules that require them to protect minors. The app prototype was announced on Monday alongside guidelines that online platforms are recommended to adopt in order to comply with the bloc’s Digital Services Act (DSA). “Making sure our children and young people are safe online is of paramount importance to this Commission,” said EU tech policy leader Henna Virkkunen. “The guidelines on the protection of minors for online platforms, combined with the new age verification blueprint, are a huge step forward in this regard. Platforms have no excuse to be continuing practices that put children at risk.” The age verification app is designed to allow users to prove they are over 18 when accessing restricted adult content online, helping the EU to crack down on platforms that are failing to meet obligations under laws like the DSA, and enabling companies to adopt the bloc’s verification toolbox instead of developing their own. The EU Commission says that app users will retain full control over their personal information, such as their exact age or identity, and that the online content they view will remain private. It’s positioned as a temporary solution that will be superseded by the EU Digital Identity Wallet that’s expected to launch in 2026, which aims to provide a way for “European citizens, residents and businesses to prove who they are when accessing digital services” and a place to “safely store, share and sign important digital documents.” While the bloc’s DSA rulebook doesn’t impose specific age verification requirements, websites and online platforms are obligated to protect the “health, physical, mental, and moral development” of minors who use their services, and provide them with the “highest level of privacy, safety, and security.” The new guidance urges online platforms to address concerns around exposing children to harmful content, cyberbullying, unwanted interactions with strangers, and addictive design features. In May, the EU launched investigations into four large adult content websites — Pornhub, Stripchat, XNXX, and XVideos — over concerns that they were failing to have appropriate age verification tools in place to prevent children from accessing pornographic content."
  },
  {
    "title": "TechCrunch All Stage launches in Boston today — don’t miss what founders are learning",
    "slug": "techcrunch-all-stage-launches-in-boston-today-dont-miss-what-founders-are-learning",
    "link": "https://techcrunch.com/2025/07/15/techcrunch-all-stage-launches-in-boston-today-dont-miss-what-founders-are-learning/",
    "published": "2025-07-15 10:30",
    "image": "https://techcrunch.com/wp-content/uploads/2025/03/Early-Stage-2024-audience.jpg?resize=1200,800",
    "summary": "Today’s the day! TechCrunch All Stage is lighting up Boston’s SoWa Power Station at 7:30 a.m. ET sharp. The stages are set, the speakers are ready, and the startup community is gathering for one powerful day of insight, innovation, and momentum. In Boston and ready to scale your startup faster and more efficiently? There’s still […]",
    "full_text": "TechCrunch All Stage is lighting up Boston’s SoWa Power Station at 7:30 a.m. The Foundation Stage is your launchpad, packed with practical skills to help you build and grow from day one. All the Ways You Don’t Realize VCs Are Evaluating Your Company at Pre-Seed Learn how top startups like Datadog and Airbnb created markets, not just sized them. The New Rules of Growth-Stage Fundraising: How to Win at Raising a Series C & Beyond Rob Biederman of Asymmetric Capital Partners reveals 2025’s VC trends, from hot sectors to deal shifts. Learn what drives investments and how founders can align with today’s VC playbook. This roundtable explores how Agentic AI adds cognition to workflows, boosting automation and efficiency. Founder and exec Jeff Chow shares how to build inclusive, AI-powered tools that boost team communication. And don’t forget the Side Events happening across Boston through July 17."
  },
  {
    "title": "Here's Everything You Need to Know About Satellite Connectivity in Phones",
    "slug": "here-s-everything-you-need-to-know-about-satellite-connectivity-in-phones",
    "link": "https://www.cnet.com/tech/mobile/heres-everything-you-need-to-know-about-satellite-connectivity-in-phones/#ftag=CAD590a51e",
    "published": "2025-07-15 10:00",
    "image": "https://www.cnet.com/a/img/resize/fd814b50ae572b5803bc40cc5f964c483db28371/hub/2025/05/06/da9ef140-88d0-484d-80eb-db3b0ae4b234/satellite-phone-promo-image.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "With carriers constantly updating their satellite phone plans, here's all you need to know about satellite connectivity in phones, whether your phone has it and what \"satellite optimized\" means.",
    "full_text": "Some phones have satellite connectivity regardless of carrier for a period of time (like recent iPhones and the Pixel 9), while others require a specific carrier due to partnerships and hardware compatibility (like Galaxy S25 phones on Verizon). Google partnered with Skylo for its satellite service, which currently works only in the continental US and on Pixel 9 devices. Not only are these satellites hundreds of miles away in space, but they also orbit the Earth at a quick pace. You also want a direct view of the sky and to be away from tall trees or heavy foliage. One especially interesting aspect of T-Satellite, is that it's open not just to T-Mobile customers but those from other carriers as well. The service is free for now during its beta trial period, which ends on July 22. Once the full service launches in July, it will remain free for T-Mobile customers on Go5G Next or Experience More plans. It's unclear what happens after that, but Apple has previously extended satellite service for iPhone 14 owners. Emergency SOS might be one of the most important features to come out on any phone this year. Satellite connectivity is designed to be used as a fallback when Wi-Fi or cellular networks are not available."
  },
  {
    "title": "Reddit is rolling out age verification in the UK",
    "slug": "reddit-is-rolling-out-age-verification-in-the-uk",
    "link": "https://www.theverge.com/news/707125/reddit-age-verification-uk-online-safety",
    "published": "2025-07-15 05:30",
    "image": "https://images.unsplash.com/photo-1689360699708-ad1e82664f62?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhY2Nlc3NpbmclMjAlRTIlODAlOUMlMjBjZXJ0YWluJTIwbWF0dXJlJTIwY29udGVudCUyMCVFMiU4MCU5RCUyMHVubGVzc3xlbnwwfHx8fDE3NTI1NzI3MTZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Reddit users in the United Kingdom will now be blocked from accessing “certain mature content” unless they complete the platform’s new age verification process. Reddit announced on Monday that UK users will need to upload a selfie or a photo of their government ID in order to view content that’s restricted for under-18s by the […]",
    "full_text": "Reddit announced on Monday that UK users will need to upload a selfie or a photo of their government ID in order to view content that’s restricted for under-18s by the UK Online Safety Act (OSA), including abusive, violent, and sexually explicit materials. The age verification process is performed by Persona, a third-party provider that won’t have access to users’ Reddit data or retain photos for longer than seven days. Reddit says it also won’t have access to uploaded photos, and that it will only store birthdates and verification statuses so that users don’t need to re-verify their account. I managed to complete the process myself this morning using a selfie in under a minute, though the photo tool had some difficulty detecting when my face was correctly framed. “Reddit was built on the principle that you shouldn’t need to share personal information to participate in meaningful discussions,” Reddit said in its announcement. “While we still don’t want to know who you are on Reddit, there are certainly situations where it would be helpful if we knew a little more about you.” As such, the platform says it’s also introducing a global option for users to provide their birthdate “to help ensure that content and ads are age-appropriate,” and may roll out age verification requirements in other regions. Like a similar age check introduced on Bluesky last week, Reddit’s age verification mandate is being introduced to comply with rules under the OSA that require online platforms to implement measures that protect children from seeing harmful and age-inappropriate content by July 25th. “The UK’s online safety rules are coming into force and change is happening. Society has long protected youngsters from products that aren’t suitable for them, from alcohol to smoking or gambling,” Ofcom said in a statement to The Verge."
  },
  {
    "title": "Nextdoor redesigns app with AI recommendations, local news, and real-time emergency alerts",
    "slug": "nextdoor-redesigns-app-with-ai-recommendations-local-news-and-real-time-emergency-alerts",
    "link": "https://techcrunch.com/2025/07/15/nextdoor-redesigns-app-with-ai-recommendations-local-news-and-real-time-emergency-alerts/",
    "published": "2025-07-15 09:00",
    "image": "https://images.unsplash.com/photo-1670516771124-6e5f60dd9498?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwlRTIlODAlOUMlMjBuZXclMjBuZXh0ZG9vciUyMC4lRTIlODAlOUR8ZW58MHx8fHwxNzUyNTcwOTA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Neighborhood social app Nextdoor is launching a redesigned version of its service that it’s calling the “new Nextdoor.”",
    "full_text": "Neighborhood social app Nextdoor is launching a redesigned version of its service that it’s calling the “new Nextdoor.” The app is adding local news, real-time alerts, and an AI-powered feature called “Faves” that’s designed for discovering local businesses and spots. So this is the first time we’re letting third party publishers use our distribution.” Users will be able to discuss the news in a comments section under each post. These alerts will appear on a dynamic neighborhood map, allowing neighbors to have timely conversations about safety and preparedness. You need to get together with your neighbors and help save each other’s lives in some cases.” Tolia noted that these alerts are hyper-localized because Nextdoor is built on a geospatial platform. The new Faves feature displays curated lists of recommendations, and also lets you ask specific questions to get suggestions. You can ask questions like, “What is the best place to hike with kids?” and receive a quick, summarized response that pulls information from posts from real users on Nextdoor. Tolia noted that Nextdoor’s unique value is in digitizing and capturing local word-of-mouth, the kind of hyperlocal information that isn’t available through platforms like Google or ChatGPT, because you can only get it from direct conversations. “You can’t go to ChatGPT and ask that question, right?"
  },
  {
    "title": "A Recession Could Be Hiding in Plain Sight. Here’s the Best Advice to Prepare",
    "slug": "a-recession-could-be-hiding-in-plain-sight-heres-the-best-advice-to-prepare",
    "link": "https://www.cnet.com/personal-finance/banking/a-recession-could-be-hiding-in-plain-sight-heres-the-best-advice-to-prepare/#ftag=CAD590a51e",
    "published": "2025-07-15 09:00",
    "image": "https://www.cnet.com/a/img/resize/7050efedca8886d199f04bead0050e253f291336/hub/2025/04/18/5e7f9502-c831-4dc2-aa5e-c24ee08c4584/how-to-protect-your-money-in-a-recession.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Even with tariffs on pause, the economy is still fragile. Make these money moves before the next downturn hits.",
    "full_text": "It's why markets continue to etch new highs when most of us feel like we're walking a tightrope. \"You don’t want to find yourself relying on credit as your only tool for emergencies,“ Anat said. Saavedra recommends a high-yield savings account because it's liquid and provides solid returns on your balance. Part of building your financial safety net includes planning for job loss before it happens, said Countryman-Quiroz. Doing this prep work while employed can help you transition more easily into new roles or industries. While market downturns are unsettling, you don't always need to overhaul your investment strategy. Money market funds or CDs could be good options if you need more balance and less risk. Before tackling debt, Saavedra recommends having at least one month of living expenses saved in your emergency fund. Anat also recommends connecting with local mutual aid funds in your community and exploring ways to contribute resources or receive support. You could start researching mental health services in your area, particularly those offering sliding scale fees or affordable care."
  },
  {
    "title": "Today's NYT Connections Hints, Answers and Help for July 15, #765",
    "slug": "today-s-nyt-connections-hints-answers-and-help-for-july-15-765",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-hints-answers-and-help-for-july-15-765/#ftag=CAD590a51e",
    "published": "2025-07-15 09:00",
    "image": "https://www.cnet.com/a/img/resize/3986ca4ac5b498c6114118e0dfa25b2a05ae6531/hub/2025/03/26/c70b0a32-884a-4379-b77b-de75776952ba/nyt-word-games-connections-2798.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Find some spooky hints and the answers for the NYT Connections puzzle for July 15, #765.",
    "full_text": "Today's NYT Connections puzzle had some fun categories, and wasn't too tough. Read on for clues and today's Connections answers. Players who are registered with the Times Games section can now nerd out by following their progress, including number of puzzles completed, win rate, number of times they nabbed a perfect score and their win streak. Read more: Hints, Tips and Strategies to Help You Win at NYT Connections Every Time Yellow group hint: Simone Biles knows these well. Say the clue words out loud, pausing before and after each. The Connections editors love to group words together that are used in similar phrasing, like ____ Up. None of those words were in the same category. Break down any compound words and look for similarities. \"Rushmore\" was once in a puzzle where the connection was that each word started with the name of a rock band."
  },
  {
    "title": "Today's NYT Strands Hints, Answers and Help for July 15, #499",
    "slug": "today-s-nyt-strands-hints-answers-and-help-for-july-15-499",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-strands-hints-answers-and-help-for-july-15-499/#ftag=CAD590a51e",
    "published": "2025-07-15 09:00",
    "image": "https://www.cnet.com/a/img/resize/166e67238a28ef7d82e62fe8aec7185a7cc23eda/hub/2024/05/15/859c9110-e596-432b-8690-95e6102759c9/nyt-new-york-times-strands-2054.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Find hints and answers for the NYT Strands puzzle for July 15. (It might help if you participated in 4H.)",
    "full_text": "Today's NYT Strands puzzle reminds me of many happy days spent at the Minnesota State Fair. If you need hints and answers, read on. I go into depth about the rules for Strands in this story. If you're looking for today's Wordle, Connections and Mini Crossword answers, you can visit CNET's NYT puzzle hints page. If that doesn't help you, here's a clue: Summer festivities. Your goal is to find hidden words that fit the puzzle's theme. These are the words I used to get those hints but any words of four or more letters that you find will work: When you have all of them (I originally thought there were always eight but learned that the number can vary), every letter on the board will be used. To get more clue words, see if you can tweak the words you've already found, by adding an \"S\" or other variants. And if you find a word like WILL, see if other letters are close enough to help you make SILL or BILL."
  },
  {
    "title": "Today's Wordle Hints, Answer and Help for July 15, #1487",
    "slug": "today-s-wordle-hints-answer-and-help-for-july-15-1487",
    "link": "https://www.cnet.com/tech/gaming/todays-wordle-hints-answer-and-help-for-july-15-1487/#ftag=CAD590a51e",
    "published": "2025-07-15 09:00",
    "image": "https://www.cnet.com/a/img/resize/837b400de41f50a97b52a8c799b193be01cea440/hub/2024/05/28/20480816-214e-4fcc-a9b4-b02f0ac71e7c/wordle-word-game-hints-puzzle-8667.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Find hints and the answer for the July 15 Wordle puzzle. This one's just hard enough to break some streaks.",
    "full_text": "Today's Wordle puzzle might trip a lot of people up, and even break some streaks. The first letter isn't one that I see in a lot of starter words, and the word itself doesn't come quickly to my mind. If you need a new starter word, check out our list of which letters show up the most in English words. If you need hints and the answer, read on. If you don't want a spoiler, look away now. There are two vowels in today's Wordle answer. The two vowels in today's Wordle answer are next to each other. Today's Wordle answer can refer to imposing something that is unwelcome. (TRAIN, STERN and AUDIO are good.) Don't forget that letters can be used more than once."
  },
  {
    "title": "Student Loan Update: Here's What SAVE Borrowers Should Do Before Aug. 1",
    "slug": "student-loan-update-here-s-what-save-borrowers-should-do-before-aug-1",
    "link": "https://www.cnet.com/personal-finance/loans/student-loan-update-heres-what-save-borrowers-should-do-before-aug-1/#ftag=CAD590a51e",
    "published": "2025-07-15 08:45",
    "image": "https://www.cnet.com/a/img/resize/1b65910297c927b53c2582d54d7908da94423a3c/hub/2024/03/31/0542087b-4d30-41e2-ab6e-c62362925df6/fafsa-student-loan-purple.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "It may make sense to switch to another income-driven repayment plan, but you do not have to make the move by Aug. 1. Here's what to know.",
    "full_text": "Interest will restart for SAVE borrowers whose loans remain in a general forbearance on Aug. 1. You can look at your other income-driven repayment plan options using the Federal Student Aid loan simulator. Will my payments increase if I move from SAVE to another income-driven repayment plan? Many borrowers should brace for higher monthly payments after moving to a new repayment plan. Switching to another income-driven repayment plan like IBR could increase their monthly payment by nearly $100. You can use the Federal Student Aid Loan Simulator to estimate what your new monthly payment will look like. If you switch to IBR or another repayment plan, that doesn't mean your first monthly payment will hit in August. \"You can manually calculate the interest on your loans and make a prepayment in that amount each month.\" But he warned that interest may continue to accrue, which could dig you into a deeper hole. You can reach out to your servicer or review financial hardship options on the FSA website."
  },
  {
    "title": "Best MP3 Players for 2025",
    "slug": "best-mp3-players-for-2025",
    "link": "https://www.cnet.com/tech/mobile/best-mp3-player/#ftag=CAD590a51e",
    "published": "2025-07-15 08:40",
    "image": "https://www.cnet.com/a/img/resize/5e44550e7af5d5cfae604be7c2d73baed99e53cb/hub/2024/11/04/45711455-ab05-4576-a708-fb73c61b18da/hiby-r4-evangelion-2-of-6.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "An \"MP3\" or digital audio player can help you take the tunes offline or at the very least off your phone.",
    "full_text": "Or maybe you just want to skip streaming altogether and actually own your music again. Personally, I use these devices while hiking and for international travel including on planes. It's easy enough to put all your music, even high-res lossless audio formats up to 384 kHz at 32-bit, on a high-capacity microSD card so you don't lose quality on the music playback. Its interface is simple and it has plenty of power for big headphones. It's tiny and thanks to its MicroSD card slot, can store tons of music. Who shouldn’t buy it The tiny screen is a little difficult to use if you don't have very dexterous fingers. I wouldn't give this to an older person who might have trouble using the screen. Who shouldn’t buy it I've had the NW-A306 for a while and there are some noticeable drawbacks. ... Show more Get it now $398 at Amazon $239 at B&H Photo-Video $398 at Crutchfield Specs & Configurations Storage 32GB (internal), MicroSD Battery life (claimed) 36 hours DAC N/A Output power (claimed) 0.4–1.1mW @ 32Ω OS Android 12 Learn more Sony NW-A306 review Add to compare If you like what you hear, consider upgrading to a decent headphone DAC (that's \"digital to analog converter\") like the Audiofly Dragonfly or iFi Audio Go and a serious pair of wired headphones."
  },
  {
    "title": "If You Have a Headache, Experts Recommend Eating These 9 Foods",
    "slug": "if-you-have-a-headache-experts-recommend-eating-these-9-foods",
    "link": "https://www.cnet.com/health/nutrition/if-you-have-a-headache-experts-recommend-eating-these-9-foods/#ftag=CAD590a51e",
    "published": "2025-07-15 08:30",
    "image": "https://www.cnet.com/a/img/resize/15f14618d605e6ac0ebaf2b338f6d25920742d5e/hub/2025/06/13/f7600cfc-51ab-475f-b2dc-d414ce67ac86/person-cutting-watermelon.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "If you regularly experience headaches, add these foods to your diet to relieve the pain and uncomfortable symptoms.",
    "full_text": "Next time you have a headache, consider looking in your fridge or pantry for relief. Citing a 2021 randomized controlled trial, Church explains that because migraines are believed to involve inflammatory and vascular changes in the body, omega-3 fatty acids may help reduce their frequency or intensity when eaten regularly. Prostaglandins are hormone-like substances that impact bodily functions like inflammation, pain and menstrual cramps. \"Although clinical evidence of the acute dietary magnesium deficiency as a direct migraine trigger remains limited, scientists are investigating the involvement of intra- and extracellular magnesium levels in migraine pathogenesis,\" Daidone explains. She also cites a 2012 study in the Journal of Neural Transmission entitled \"Why all migraine patients should be treated with magnesium.\" \"Cinnamon contains a high amount of antioxidants that may also reduce headache frequency,\" Campbell explains. Though this high dose usually comes from supplementation, riboflavin-rich foods support the same metabolic processes in migraine prevention. Over a 5-year period, doctors at a neurology clinic in Israel treated 36 children and adolescents (average age 9) with severe daily or near-daily headaches who drank an average of 11 quarts of cola drinks per week,\" says Redwood. Nearly all cola drinks contain substantial amounts of caffeine (Chou and Bell, 2007).\" Note: 11 quarts of cola per week is extreme, and the average person doesn't consume this much caffeine."
  },
  {
    "title": "Best Debit Cards for Kids and Teens: Greenlight, BusyKid, Capital One and More",
    "slug": "best-debit-cards-for-kids-and-teens-greenlight-busykid-capital-one-and-more",
    "link": "https://www.cnet.com/personal-finance/credit-cards/best-debit-cards-for-kids-and-teens/#ftag=CAD590a51e",
    "published": "2025-07-15 08:05",
    "image": "https://www.cnet.com/a/img/resize/79bd33466f9ae1522116b3c8e888ae3331cec29b/hub/2025/04/24/117c636f-7fb5-47f9-b0b7-3d7c452efde1/gettyimages-1400704412.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "I picked a debit card for my teen that helped her learn about budgeting for a school trip.",
    "full_text": "The Greenlight Family Shield comes with account monitoring features and up to $1 million in identity theft coverage. Money Missions expand your child's financial literacy development with age-appropriate in-app videos, stories and quizzes. Step/CNET Photo Gallery 1/1 Step/CNET Best for building credit Step Card Step may be better suited for teens who are ready to level up their financial knowledge, as it provides access to investment tools and offers financial literacy training courses. It also offers 0.10% APY, so your child can earn some interest on their balance. But not all banks and credit unions offer accounts with debit card access for minors under the age of 13. A debit card designed for kids -- one with helpful educational tools and an intuitive interface -- can help teach them how to set savings goals, \"earn\" money from parents for completing chores or receive direct deposits from a real job once they begin receiving paychecks. If you're worried about overspending or poor money management, most debit cards designed for kids are connected to apps that have parental controls and protections so you can keep a close eye on your children's financial activities. Although the same security measures protect kid and adult debit cards, it bears repeating that any information you share about your child online increases their risk profile. Eligibility Many debit cards designed for children require personal information and a shared bank account. It's usually easier to get new products or good terms if you already have an established relationship with the financial institution."
  },
  {
    "title": "Don't Want to Upgrade to Windows 11? Microsoft Offers Free Windows 10 Security Updates",
    "slug": "don-t-want-to-upgrade-to-windows-11-microsoft-offers-free-windows-10-security-updates",
    "link": "https://www.cnet.com/tech/computing/dont-want-to-upgrade-to-windows-11-microsoft-offers-free-windows-10-security-updates/#ftag=CAD590a51e",
    "published": "2025-07-15 07:45",
    "image": "https://www.cnet.com/a/img/resize/8bfd5fd808a354e99900aff64134feee761d60b5/hub/2021/06/03/16eb8ce7-d883-473d-9c80-d34e2c54eb48/windows-10-logo.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "If you don't want to upgrade to Windows 11, you can still get support for a year, but it requires linking your OneDrive account to your PC.",
    "full_text": "Initially Microsoft was offering a one-year extended security update for $30, but we've got good news. Microsoft has added a free option, allowing you to stick with Windows 10 for another year. The ability to get free updates on Windows 10 is a pretty big deal because it is still the most widely used Windows OS, accounting for just over 53% of installs as of May 2025. That leaves millions of people without security support in just a few months unless they upgrade. So the cloud backup option gives users a way out without costing them any money. Anyone with a Microsoft account gets up to 5GB of storage for free. Windows 10 was released in July 2015, more than a decade ago. Per Microsoft's blog post, there are now three options for people who want to stay on Windows 10 and still receive security updates. Signing up for this option will guarantee updates until Oct. 13, 2026, although businesses will have the option to purchase up to three years of additional updates. There are myriad differences between the two operating systems, but Microsoft's string of unpopular decisions along with Windows 11 compatibility issues have kept the prior generation OS around a lot longer than it normally would be."
  },
  {
    "title": "Is Nano-Hydroxyapatite Toothpaste an Effective Fluoride Alternative? Dentists Weigh In",
    "slug": "is-nano-hydroxyapatite-toothpaste-an-effective-fluoride-alternative-dentists-weigh-in",
    "link": "https://www.cnet.com/health/personal-care/is-nano-hydroxyapatite-toothpaste-effective-fluoride-alternative-dentists-weigh-in/#ftag=CAD590a51e",
    "published": "2025-07-15 07:06",
    "image": "https://www.cnet.com/a/img/resize/b23f0b1e31c0a2c8413569872c46274154c6a210/hub/2025/07/11/6fbaf2cb-a00b-4a63-b302-405cd0aa4992/person-brushing-teeth.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "We consulted dentists to discover the potential benefits and side effects of fluoride-free, nano-hydroxyapatite toothpaste.",
    "full_text": "It is a type of calcium that makes up bones and teeth,\" says Lai. According to Dr. Daniela Eversgerd, a cosmetic dentist and the founder of Allure Dental, nano-hydroxyapatite was developed by NASA in the 1970s for astronauts dealing with bone and enamel loss during long periods of space travel. \"n-HA can actually fill microscopic cracks and help reverse or arrest early cavities,\" adds dentist Dr. Sandip Sachar. \"The particle size could get into space and work better than larger particles in micro-hydroxyapatite or fluoride,\" he explains. Fluorosis occurs when you get too much fluoride as a child, causing white or brown spots on the teeth. However, she states that this is speculative and not supported by any current clinical evidence. For my high-risk patients, I often recommend a combo toothpaste that includes both ingredients when appropriate.\" \"The best scientific evidence has shown that adding fluoride to community water supplies is safe and effective. All of the experts we consulted do recommend nano-hydroxyapatite toothpaste, but only for certain patients. However, she advises that patients with moderate to high cavity risk not fully abandon fluoride."
  },
  {
    "title": "Tesla finally enters India — nine years after Elon Musk first teased its debut",
    "slug": "tesla-finally-enters-india-nine-years-after-elon-musk-first-teased-its-debut",
    "link": "https://techcrunch.com/2025/07/14/tesla-finally-enters-india-nine-years-after-elon-musk-first-teased-its-debut/",
    "published": "2025-07-15 06:48",
    "image": "https://images.unsplash.com/photo-1591391258564-be184031cb21?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmaXJzdCUyMHNob3dyb29tfGVufDB8fHx8MTc1MjU2MjgwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Tesla has made its long-awaited entry into India with the opening of its first showroom in Mumbai.",
    "full_text": "Tesla has made its long-awaited entry into India with the opening of its first showroom — nine years after CEO Elon Musk first teased the move in April 2016 and following years of delays and shifting timelines in one of the world’s largest automotive markets. Tesla calls the showroom an “Experience Center” and has located it in Maker Maxity Mall in Bandra Kurla Complex, the central business district of Mumbai. The Model Y RWD comes with a price tag of ₹59,89,000 (approximately $68,000), while the long range RWD is priced at ₹67,89,000 (approx. The company is also offering a full self-driving add-on at ₹600,000 (approx. The country plans to have 30% of all its automotive sales be electric by 2030, though. Save $450 on your TechCrunch All Stage pass Build smarter. Musk has discussed Tesla’s plans several times in one-on-one meetings with Prime Minister Narendra Modi and his senior officials. Overall, Tesla’s China-made EV sales increased 16% year-over-year — which includes both domestic sales in China and exports to Europe and other markets. Similarly, Tesla’s sales in Europe declined by nearly 28% year-over-year in May for the fifth straight month, despite overall European car sales increasing by 1.9%. Moreover, Tesla’s global sales dipped 13% to 443,956 units in the second quarter."
  },
  {
    "title": "Meta is reportedly using actual tents to build data centers",
    "slug": "meta-is-reportedly-using-actual-tents-to-build-data-centers",
    "link": "https://techcrunch.com/2025/07/14/meta-is-reportedly-using-actual-tents-to-build-data-centers/",
    "published": "2025-07-15 05:25",
    "image": "https://images.unsplash.com/photo-1732027912131-3a10677b8449?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxnaWdhd2F0dCUyMGRhdGElMjBjZW50ZXIlMjBjYWxsZWQlMjBoeXBlcmlvbnxlbnwwfHx8fDE3NTI1NTc0MDN8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Meta and CEO Mark Zuckerberg are in a hurry to build their superintelligence tech. The company has been poaching AI researchers, while Zuckerberg announced on Monday that Meta is building a 5-gigawatt data center called Hyperion. The urgency is palpable. As SemiAnalysis reported last week and Business Insider noted, Meta is so eager to boost […]",
    "full_text": "In Brief Meta and CEO Mark Zuckerberg are in a hurry to build their superintelligence tech. The company has been poaching AI researchers, while Zuckerberg announced on Monday that Meta is building a 5-gigawatt data center called Hyperion. The urgency is palpable. As SemiAnalysis reported last week and Business Insider noted, Meta is so eager to boost its computing power that it’s literally erecting tents for temporary data center capacity while its facilities are still under construction. These are all signs that Meta wants to build up its AI capacity faster after falling behind competitors like OpenAI, xAI, and Google — and that Zuckerberg isn’t willing to wait for typical construction timelines to close the gap. “This design isn’t about beauty or redundancy. It’s about getting compute online fast!” SemiAnalysis said in its report. “From prefabricated power and cooling modules to ultra-light structures, speed is of the essence as there is no backup generation (ie, no diesel generators in sight),” it added. As for its Hyperion data center, Meta spokesperson Ashley Gabriel tells TechCrunch that it will be located in Louisiana and will likely have a capacity of 2 gigawatts by 2030."
  },
  {
    "title": "Nvidia is set to resume China chip sales after months of regulatory whiplash",
    "slug": "nvidia-is-set-to-resume-china-chip-sales-after-months-of-regulatory-whiplash",
    "link": "https://techcrunch.com/2025/07/14/nvidia-is-set-to-resume-china-chip-sales-after-months-of-regulatory-whiplash/",
    "published": "2025-07-15 04:36",
    "image": "https://images.unsplash.com/photo-1676658885396-b8f24b7af314?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0cnVtcCUyMGFkbWluaXN0cmF0aW9uJTIwaW1wb3NlJTIwcmVzdHJpY3Rpb25zfGVufDB8fHx8MTc1MjU1NDcwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Nvidia announced Monday that it’s filing applications to restart sales of its H20 artificial intelligence chips to China, capping a spasmodic few months that saw the Trump administration impose restrictions, then quickly reverse course after a high-profile dinner meeting. The company expects to receive U.S. government licenses soon and begin deliveries shortly after, according to […]",
    "full_text": "Nvidia announced Monday that it’s filing applications to restart sales of its H20 artificial intelligence chips to China, capping a spasmodic few months that saw the Trump administration impose restrictions, then quickly reverse course after a high-profile dinner meeting. Nvidia is also introducing a new “RTX Pro” chip designed specifically for the Chinese market, calling it “fully compliant” with regulations and ideal for digital manufacturing applications like smart factories and logistics. It’s specifically designed for “inference” tasks — running existing AI models for day-to-day applications — rather than training new AI systems from scratch. Chinese tech giants including ByteDance, Alibaba, and Tencent had been aggressively stockpiling these chips in the first three months of this year in anticipation of stricter export controls. The chip’s appeal lies partly in its superior memory bandwidth compared to Chinese alternatives, along with Nvidia’s widely-adopted software ecosystem that makes the hardware easier to deploy. The regulatory back-and-forth began in April when the Trump administration restricted H20 sales, potentially costing Nvidia $15 billion to $16 billion in revenue, judging by how much Chinese firms reportedly splashed out for them in the first quarter alone. The move targeted chips exceeding specific performance thresholds, including total memory bandwidth of 1,400 gigabytes per second or input/output bandwidth of 1,100 GB per second. Soon after CEO Jensen Huang attended a $1 million-per-head dinner at Trump’s Mar-a-Lago resort in early April, the administration paused the ban. According to NPR, the White House changed its mind after Nvidia promised new U.S. data center investments. Save $450 on your TechCrunch All Stage pass Build smarter."
  },
  {
    "title": "Today's NYT Mini Crossword Answers for Tuesday, July 15",
    "slug": "today-s-nyt-mini-crossword-answers-for-tuesday-july-15",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-mini-crossword-answers-for-tuesday-july-15/#ftag=CAD590a51e",
    "published": "2025-07-15 02:12",
    "image": "https://www.cnet.com/a/img/resize/16d2290ea5c9dc928db9624c275de45ff920b828/hub/2024/07/25/50d61b9b-1c76-4678-9a92-f6eca531f4a8/nyt-mini-crossword-234876.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are the answers for The New York Times Mini Crossword for July 15.",
    "full_text": "Back Services & Software All the news and tips you need to get the most out of services, apps and software you use every day."
  },
  {
    "title": "My Secret Weapon for Camping Is This Portable Projector That's 22% Off",
    "slug": "my-secret-weapon-for-camping-is-this-portable-projector-that-s-22-off",
    "link": "https://www.cnet.com/deals/my-secret-weapon-for-camping-is-this-portable-projector-thats-22-off/#ftag=CAD590a51e",
    "published": "2025-07-15 02:01",
    "image": "https://www.cnet.com/a/img/resize/538d04aaa14f78444f97636b7e0554bba43cbc73/hub/2025/05/29/16ca7517-696c-4d3c-abb9-a88dd5e52c37/anker-mars-3-air-04.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "I think Anker's Nebula Mars 3 Air makes a wonderful addition to any road trip, and you can save $130 on it right now.",
    "full_text": "I recently took an epic road trip through a land of giants, and there's only one compact projector I would take with me to complete my camping experience. If you want to watch a movie with the family while camping, and crowding around an iPad doesn't cut it -- this is the way to go. That means the image doesn't look washed out or flat. The side of my campervan makes for a decent impromptu projector screen. Something else you'll want to keep in mind: This projector doesn't show full frame with a USB-to-HDMI. While you wouldn't want to backpack with it, the Mars 3 Air is compact and shorter than my Jetboil MiniMo camp stove. The Mars 3 Air is the best all-around portable projector because it does most things well, some things really well and almost nothing wrong. There are two other options I want to talk about that might be better in certain situations. It also has Google TV built in, is battery powered, can double as a Bluetooth speaker and (unlike the Mars 3 Air) it can charge via USB-C. That means you can have longer viewing sessions between charges as long as you have a battery bank. It also has extremely loud fans, and the streaming options are far more limited."
  },
  {
    "title": "I Recommend This Budget Acer Laptop at Full Price, and It's an Even Better Value at $200 Off",
    "slug": "i-recommend-this-budget-acer-laptop-at-full-price-and-it-s-an-even-better-value-at-200-off",
    "link": "https://www.cnet.com/deals/i-recommend-this-budget-acer-laptop-at-full-price-and-its-an-even-better-value-at-200-off/#ftag=CAD590a51e",
    "published": "2025-07-15 01:29",
    "image": "https://www.cnet.com/a/img/resize/84bb146cb8bb9d7a6eb3fdcd0bec4f4b49577d7c/hub/2025/04/04/b8617b13-484b-4a5a-b972-3016144097f1/acer-aspire-14-ai.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Acer's 14 AI laptop is one of CNET's top-rated budget laptops of 2025. It's the cheapest Copilot Plus PC I've ever reviewed, and Costco members can get it for just $500 right now.",
    "full_text": "The Acer Aspire 14 AI is available for $500 at Costco Fast-forward two months, and it's now $500 at Costco, making it the cheapest Copilot Plus PC I've seen -- and a great value. It features the latest Intel Core Ultra Series 2 processor (codenamed Lunar Lake) that serves up competitive application and AI performance along with great battery life and a design that doesn't look all that different from Acer's pricier Swift laptops. Thanks to its Intel Core Ultra 5 CPU that has a neural processing unit capable of 40 trillion operations per second, the Aspire 14 AI hits the minimum requirement for Microsoft's Copilot Plus PC platform. Its AI processor can offload AI workloads -- constantly taking Windows Recall snapshots, blurring backgrounds for video calls and producing live translations -- to its NPU, keeping the CPU and GPU freed up for whatever primary task you're working on. You need to be careful when shopping for a low-cost laptop because many offerings are older models with previous-generation components that are discounted in an attempt to clear out inventory for newer units. Its integrated Intel GPU doesn't provide much in the way of 3D gaming, but the same can be said for any Copilot Plus PC, as I've yet to encounter one with dedicated graphics. It's a solidly constructed laptop, and you'd have to look closely to tell it apart from one of Acer's mainstream Swift laptops. And the efficient Intel Core Ultra CPU also allows the Aspire 14 AI to run for almost 19 hours on a single charge while also offering a bit of future-proofing with its AI capabilities. Plus, both offer even better battery life than the Aspire 14 AI."
  }
]