[
  {
    "title": "My Favorite All-in-One Kitchen Appliance Is on Sale for 20% Off",
    "slug": "my-favorite-all-in-one-kitchen-appliance-is-on-sale-for-20-off",
    "link": "https://www.cnet.com/deals/my-favorite-all-in-one-kitchen-appliance-is-on-sale-for-20-off/#ftag=CAD590a51e",
    "published": "2025-07-18 00:13",
    "image": "https://www.cnet.com/a/img/resize/a3d45c817657548aa4e54c220517d3580ad81f5e/hub/2025/05/20/8280b323-ca93-441b-bd1b-08585315fe39/rotated-1747771594-img-6203.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The clever Chefman Everything Maker can make breakfast sandwiches, grilled cheese, pizza, pancakes and more. Right now, it's marked down to just $48.",
    "full_text": "The nonstick cooking surfaces heat up quickly and cleanup takes minimal effort (a serious win in my book). The design is intuitive, easy to store upright (although I rarely put it away) and surprisingly durable. It's just a well-made, easy-to-use appliance that works every time. Right now, you can get a sweet 20% discount on the Everything Maker. The Concrete-hued version is also on sale for a few bucks more. I've found it particularly convenient for cooking breakfast foods like eggs and pancakes with the lid open, then switching to grilled sandwiches or quesadillas with the lid closed. I made a summer flatbread (with burrata, pesto and prosciutto) over the weekend and used the Everything Maker to lightly sear some peaches to add as a topping. The Everything Maker also comes with a digital cookbook featuring 16 chef-crafted recipes, which I've used as inspiration for trying new dishes beyond my usual routine. They run promotions regularly (in fact, my favorite blender is almost 20% off right now). If you're looking for other useful, fun gifts for your favorite hostess or the chef in your life, here are our favorite kitchen gifts under $50."
  },
  {
    "title": "Nintendo wants you to join its next mysterious Switch Online playtest",
    "slug": "nintendo-wants-you-to-join-its-next-mysterious-switch-online-playtest",
    "link": "https://www.theverge.com/news/709530/nintendo-switch-online-playtest-program-july-august-invitations-application",
    "published": "2025-07-17 19:52",
    "image": "https://images.unsplash.com/photo-1737268421191-9e893b9d665a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxteXN0ZXJpb3VzJTIwc3dpdGNoJTIwb25saW5lJTIwcGxheXRlc3R8ZW58MHx8fHwxNzUyNzk2ODA5fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Late last year, Nintendo hosted a mysterious Switch Online playtest, and on Thursday, the company announced that it would be doing another test as part of the “Nintendo Switch Online: Playtest Program” and that it will be opening applications soon. This second round will be a test of the “same service” as before. Last time, […]",
    "full_text": "He joined The Verge in 2019 after nearly two years at Techmeme. Late last year, Nintendo hosted a mysterious Switch Online playtest, and on Thursday, the company announced that it would be doing another test as part of the “Nintendo Switch Online: Playtest Program” and that it will be opening applications soon. This second round will be a test of the “same service” as before. Last time, Nintendo asked participants not to share details about the playtest, but leaks appeared anyway indicating that the test was for some kind of MMO-style game. Users can apply as individuals or as a group of up to four people “if everyone in the group meets the Application Qualifications,” according to Nintendo. You can prepare your application on Nintendo’s website from Friday, July 18th at 6PM ET to Monday, July 21st at 10:59AM ET. You can actually submit your application from Monday, July 21st at 11AM ET to Wednesday, July 23rd at 10:59AM ET, though Nintendo says applications will be accepted “on a first-come, first-served basis.” Nintendo expects to accept “as many as 40,000 participants worldwide,” a big jump from the 10,000 participants allowed for the October test. If you participated in that playtest, you can participate in this next one, too, Nintendo says. The playtest itself will run from Monday, July 28th at 9PM ET to Sunday, August 10th at 8:59PM ET."
  },
  {
    "title": "Subaru’s new Uncharted EV looks like an undercover Toyota C-HR",
    "slug": "subarus-new-uncharted-ev-looks-like-an-undercover-toyota-c-hr",
    "link": "https://www.theverge.com/news/709117/subaru-uncharted-ev-specs-toyota",
    "published": "2025-07-17 19:30",
    "image": "https://images.unsplash.com/photo-1581977325979-80749e97b0c7?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0aGlyZCUyMG1vZGVsJTIweWVhcnxlbnwwfHx8fDE3NTI3OTU5MDl8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Subaru doesn’t have the deepest bench when it comes to EVs. There’s the Solterra, now in its third model year, and the upcoming Trailseeker, which promises to be the Outback to the Solterra’s Impreza when it comes out in 2026. Now we can add a new member to the lineup. The 2026 Subaru Uncharted is […]",
    "full_text": "His work has appeared in The New York Daily News and City & State. With Uncharted, Subaru finally seems like it’s ready to pick up the pace on electrification. But with a heavy lift by Toyota, Subaru is making good on lost time. That said, Subaru is sticking to a pretty familiar template with the Uncharted. All that on top of Subaru’s finely tuned suspension for more refined handling. The Uncharted will come with a standard NACS charging port for access to Tesla Supercharger stations. Subaru claims 10–80 percent charging in under 30 minutes, thanks to battery preconditioning features. Inside, the 14-inch infotainment screen supports wireless Apple CarPlay and Android Auto connections. The center console features twin wireless charging pads that come standard on all trims. (A Subaru spokesperson didn’t respond to questions about the shared platform.)"
  },
  {
    "title": "Key Home Energy Tax Credits End This Year. Act Quickly if You're Considering Solar Panels, Experts Say",
    "slug": "key-home-energy-tax-credits-end-this-year-act-quickly-if-you-re-considering-solar-panels-experts-say",
    "link": "https://www.cnet.com/home/energy-and-utilities/key-home-energy-tax-credits-end-this-year-act-quickly-if-youre-considering-solar-panels-experts-say/#ftag=CAD590a51e",
    "published": "2025-07-17 23:15",
    "image": "https://www.cnet.com/a/img/resize/fd9587bcb8744d9203ecc1ed85b4dfe7c3b2d021/hub/2025/07/17/bec7580a-458b-43c7-aa18-4ffaa1aa8f4c/gettyimages-2224667276.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Incentives for heat pumps and other home energy and efficiency investments are also expiring early after changes made by Congress and President Trump.",
    "full_text": "A big federal tax credit for homeowners who get solar panels will end this year, meaning a window for significant savings on going solar is closing fast. The 30% credit has long been the biggest single incentive for residential solar panel adoption, and its expiration is a significant blow for what has been a fast-growing industry. For homeowners, its elimination significantly changes the calculus of whether solar panels make financial sense compared with paying utility electrical rates. It had previously been expected to run for nearly another decade, but congressional Republicans voted to end it early in a major tax and spending bill President Donald Trump signed this month. Interested in understanding the impact solar can have on your home? Enter some basic information below, and we’ll instantly provide a free estimate of your energy savings. The residential clean energy credit, which covers things like home batteries and geothermal heat pumps in addition to solar panels, has been around in some form or another since George W. Bush was president. \"This preemptive phasedown of these common-sense tax credits is a self-inflicted setback,\" he told me. \"These are the exact investments we should be leaning into, not preemptively eliminating.\" Should you rush to get solar panels before the tax credit expires?"
  },
  {
    "title": "How We Test Antivirus Software",
    "slug": "how-we-test-antivirus-software",
    "link": "https://www.cnet.com/tech/services-and-software/how-we-test-antivirus-software/#ftag=CAD590a51e",
    "published": "2025-07-17 22:55",
    "image": "https://gcp-assets-origin-fly.cnet.com/bundles/cnetcss/images/feeds/default.jpg",
    "summary": "This is the full process we use to test antivirus software and antivirus companies' cybersecurity suites.",
    "full_text": "Protecting your devices from viruses and other malware is incredibly important, but effective antivirus detection isn’t the only thing to consider when choosing security software. You also want to ensure that the program won’t slow your devices down or interfere with everyday tasks. Our testing processes are designed to help you find antivirus tools that meet all of these criteria. All antivirus testing is conducted on a Lenovo ThinkPad with an Intel i5 Processor and Windows 11. Antivirus tools are also installed on a Moto G Stylus 5G Android phone for basic interface testing. Cybersecurity companies that make all three of these user experiences pleasant and welcoming to folks without technical experience receive a 10/10 usability ranking. CNET doesn’t conduct security testing due to concerns about infecting devices on a shared internet connection. We also evaluate how the cybersecurity company’s additional tools protect users' privacy, with an emphasis on password managers and VPNs. We then contact the company through each method of communication to determine how fast and helpful its support representatives are. Antivirus companies with a ranking of 8.5 and above are considered for an Editors' Choice award."
  },
  {
    "title": "‘Utopian’ city California Forever announces huge tech manufacturing park",
    "slug": "utopian-city-california-forever-announces-huge-tech-manufacturing-park",
    "link": "https://techcrunch.com/2025/07/17/utopian-city-california-forever-announces-huge-tech-manufacturing-park/",
    "published": "2025-07-17 22:44",
    "image": "https://images.unsplash.com/photo-1703379715279-c20f53d91c91?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxob3N0JTIwNDAlMjBtaWxsaW9uJTIwc3F1YXJlJTIwZmVldHxlbnwwfHx8fDE3NTI3OTIzMDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Solano Foundry is a 2,100-acre manufacturing park that can host 40 million square feet of advanced tech manufacturing space.",
    "full_text": "In Brief California Forever announced on Thursday plans to build a massive manufacturing park called Solano Foundry, the newest addition to its master-planned “utopian” city backed by a group of Silicon Valley billionaires. Solano Foundry is 2,100 acres that can host 40 million square feet of advanced tech manufacturing space. The manufacturing park will be built as part of its planned walkable city with over 175,000 homes, CEO Jan Sramek said at the Reindustrialize conference in Detroit. Sramek tweeted that U.S. manufacturers can’t win by “building factories off of random freeway exits in the middle of nowhere. The best people don’t want to work there.” This site will offer expedited permitting, transportation for finished goods, and plenty of power from renewable energy, he said. The hope is that it will attract hardware, engineering, and AI talent from relatively nearby Silicon Valley. Solano County is about 40 miles northeast of San Francisco."
  },
  {
    "title": "The crypto industry got what it paid for",
    "slug": "the-crypto-industry-got-what-it-paid-for",
    "link": "https://www.theverge.com/politics/709483/crypto-week-genius-clarity-act-trump",
    "published": "2025-07-17 18:37",
    "image": "https://images.unsplash.com/photo-1647145122736-a34a66588d1f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxyZXByZXNlbnRhdGl2ZXMlMjBwYXNzZWQlMjB0aHJlZSUyMGJpbGxzfGVufDB8fHx8MTc1Mjc5MjMxMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The crypto industry is beginning to see a return on one of its most prescient investments: Donald Trump. On Thursday, the House of Representatives passed three bills that industry supporters believe will bring more legitimacy and predictability to the digital currency space - and that critics warn could enrich the president's own family and hand […]",
    "full_text": "The crypto industry is beginning to see a return on one of its most prescient investments: Donald Trump. With the summer recess looming, there’s a limited amount of time to pass two of the bills that still require a Senate vote, but one is already headed to Trump’s desk. Crypto Week, as House Republicans took to calling it, didn’t go as smoothly as hoped, with some hardline Republicans blocking a procedural step to advance the bills earlier on in the week. That kind of sway is exactly what crypto executives — who poured tens of millions into Trump’s election, loudly proclaimed their support for him, and contributed to his inaugural fund — paid for. “We are getting incredibly close to finally having clear rules for crypto to grow this industry in the United States of America,” Coinbase CEO Brian Armstrong wrote on X after the passage of the GENIUS and CLARITY Acts. Bipartisan supporters see it as a positive step to create guardrails for a burgeoning industry, but some Democrats who opposed the bill fear it would help funnel new investment into an area in which Trump’s own family has a direct stake through World Liberty Financial. The latter would prevent the Federal Reserve from issuing a central bank digital currency (CBDC), which could compete with existing digital currencies but whose skeptics think could be used for government surveillance. The CLARITY Act would outline rules around when digital assets could be treated as securities regulated by the Securities and Exchange Commission (SEC) or a commodity regulated by the Commodities Futures Trading Commission (CFTC). Trump successfully courted crypto money for his campaign on the promise that he would fire Gensler, and now the industry is seeing high dividends on this investment. They’ve gone from an era in which they were embattled by independent agencies to having the president himself help get industry-favorable legislation over the finish line."
  },
  {
    "title": "Here are the best Apple Watch deals available right now",
    "slug": "here-are-the-best-apple-watch-deals-available-right-now",
    "link": "https://www.theverge.com/21289209/best-apple-watch-deals",
    "published": "2025-07-17 18:19",
    "image": "https://images.unsplash.com/photo-1648991680226-796783b22903?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhcHBsZSUyMHdhdGNoJTIwc2VyaWVzJTIwMTAlMjBhbG9uZ3NpZGV8ZW58MHx8fHwxNzUyNzkxNDEwfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "In September, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means there are now more Apple Watch models on […]",
    "full_text": "Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means there are now more Apple Watch models on the market than ever before — and a lot more deals to be had. But with all of those options, which one should you pick? Other upgrades include an added depth and water temperature sensor, as well as a new FDA-cleared sleep apnea detection feature, the latter of which is also available on the last-gen Series 9 and Ultra 2. The 46mm variant, meanwhile, is on sale at Amazon and Walmart starting at $329 (also $10 off) — which is the second-best price we’ve seen on the larger configuration — while the LTE models can be had at Amazon and Walmart starting at around $379.99 ($120 off). Those omissions might take this out of the running for some people, but it still may be exactly what you’re after. Best of all, it starts at $249 for the 40mm Wi-Fi / GPS model, which is $30 less than the previous generation’s baseline cost. Thanks to Amazon Prime Day, we recently saw the Apple Watch Ultra 2 dip to as low as $649 ($150 off) in select configurations. You can also pick it up at retailers like Best Buy and Target in various configurations, though only for its full retail price of $799. While all of the Apple Watch models and colorways covered here are encased in aluminum (except the Ultra 2, which has a titanium build), Apple does make a more premium range built out of stainless steel and titanium. However, they start at much steeper prices of $699 and above."
  },
  {
    "title": "Wi-Fi Experts Reveal How Trump’s Budget Bill Could Slow Down Your Wi-Fi",
    "slug": "wi-fi-experts-reveal-how-trumps-budget-bill-could-slow-down-your-wi-fi",
    "link": "https://www.cnet.com/home/internet/wi-fi-experts-reveal-how-trumps-budget-bill-could-slow-down-your-wi-fi/#ftag=CAD590a51e",
    "published": "2025-07-17 22:05",
    "image": "https://www.cnet.com/a/img/resize/b5f9ff6c8c10352b3fcac2954b08a504e90733e1/hub/2024/03/29/dfcc5b4e-08da-4a65-aaaf-9637352de884/wifi-bad-connection.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The Federal Communications Commission will be required to auction off public airwaves on the 6GHz band used by the latest Wi-Fi routers.",
    "full_text": "That’s also where the bulk of data-hungry tasks like uploading, downloading and online gaming occur. So why does Trump’s Big Beautiful Bill trade Wi-Fi speeds for mobile? It’s like a highway going from two to four lanes -- traffic can flow more easily without hitting jams. But because 6GHz is relatively new, there aren’t as many devices operating on that band. Hitting that limit on the 6GHz band would mean different things for different applications, and it’s most likely to happen during the “internet rush hour,” or between 7 and 11 p.m.. “That's when you start to see latency and packet loss creep up,” Walker said. If your email comes 2 seconds later, you don’t even know. Mobile carriers are always extremely thirsty for more spectrum, but it’s unclear how much they really need 6GHz. There are a lot of ways the FCC can go with this spectrum auction, and there will certainly be plenty of lobbying by wireless carriers, Wi-Fi advocates and rural internet providers before the dust settles. But we all use these airwaves every day, and the FCC’s decisions will impact us one way or another."
  },
  {
    "title": "We Sure Watched a Lot of Old Netflix Hits in the First Half of the Year",
    "slug": "we-sure-watched-a-lot-of-old-netflix-hits-in-the-first-half-of-the-year",
    "link": "https://www.cnet.com/tech/services-and-software/we-sure-watched-a-lot-of-old-netflix-hits-in-the-first-half-of-the-year/#ftag=CAD590a51e",
    "published": "2025-07-17 21:50",
    "image": "https://www.cnet.com/a/img/resize/3e6b75e05d625212be1223f1a388b15301ca4dbf/hub/2019/08/09/f5fddaf9-8f5d-4075-9d02-7dcf3936ceed/lucifer-408-unit-00848r.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Lucifer and Money Heist killed it in viewership.",
    "full_text": "The findings represent engagement numbers for the first six months of 2025, which equate to about 99% of what was watched between January and June. The hit TV series Adolescence and the action film Back in Action, which starred Jamie Foxx (in his first on-screen role since his hospitalization) and Cameron Diaz, topped the charts. Surprisingly, some Netflix originals released in 2023 and earlier have shown staying power on the streaming service. TV shows Orange Is the New Black, Money Heist, Lucifer and Ozark clocked in over 100 million hours of viewing in the first half of the year, with fans binge-watching every season of each series. Stranger Things remains popular this year, too. Holiday action movie Red Notice (which stars Dwayne Johnson and Chris Evans) and family films Leo and We Can Be Heroes charted more than 20 million views in the first half of the year. Netflix's earnings report shows a revenue jump of 16%. The company's investment in live programming has also paid off, with shows like WWE Raw drawing over 280 million viewing hours since its premiere in January. Their \"local for local\" strategy, which invests in creating content tailored to cultures and regions outside the US, has also been working. Ms. Rachel and Sirens have also scored big so far."
  },
  {
    "title": "I Don't Think I Can Pull Off Wearing Meta's Oakley Glasses",
    "slug": "i-don-t-think-i-can-pull-off-wearing-meta-s-oakley-glasses",
    "link": "https://www.cnet.com/tech/computing/i-dont-think-i-can-pull-off-wearing-metas-oakley-glasses/#ftag=CAD590a51e",
    "published": "2025-07-17 21:48",
    "image": "https://www.cnet.com/a/img/resize/88988351aa8e50ca38c66b8237a2268fae2f2031/hub/2025/07/17/5d02ce5d-6205-4f9b-9c68-e3dcca5fc2d6/meta-oakley-hstn-selfie.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The sports-targeted Oakley HSTN glasses are here for the summer, promising better battery life. But am I sporty enough?",
    "full_text": "Meta's next designer line of smart glasses has arrived. They also promise boosts over the Ray-Bans, both in battery life and video-recording resolution. The $499 glasses are more expensive than Ray-Bans, though cheaper models will arrive later on this summer in a wider range of styles. The color is technically \"warm gray,\" which looks like white to me. He took one look and said, \"No.\" In fact, the whole design feels like it's trying to tell you the glasses are something unusual, a bit reminiscent of Snap's older Spectacles. Meta's Ray-Bans feel a lot more everyday understated to me. I haven't had a chance to test out the claims of longer battery life yet, which is the improvement I'm most curious about. Meta's second-gen Ray-Bans are pretty great to use, but run out of juice for me in just a few hours. If you love the style of Oakley glasses, these are worth a look."
  },
  {
    "title": "Netflix says it&#8217;s streamed 95 billion hours in 2025, and a lot of ads too",
    "slug": "netflix-says-it-s-streamed-95-billion-hours-in-2025-and-a-lot-of-ads-too",
    "link": "https://www.theverge.com/news/709288/netflix-q2-2025-earningsdouble-ad-revenue",
    "published": "2025-07-17 17:47",
    "image": "https://images.unsplash.com/photo-1639710994774-00424b10efc6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxxdWFydGVyJTIwZWFybmluZ3MlMjByZXN1bHRzJTIwcmVsZWFzZWR8ZW58MHx8fHwxNzUyNzg5NjEwfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Netflix says it’s on track to “double” its advertising revenue this year as the company continues ot build out its ad tech platform. The streaming giant shared the news as part of its second-quarter earnings results released on Thursday, which revealed that Netflix raked in $11.08 billion in revenue over the past few months, marking […]",
    "full_text": "In addition to its earnings report, Netflix also released viewership data for the first half of 2025. Netflix says users watched 95 billion hours on Netflix during this time, with Adolescence topping the chart as the most-watched series with 145 million views, followed by Squid Game seasons 2 and 3. The company first started testing its ad tech platform last year, and it has since rolled out to all markets where Netflix’s ad-supported plan is available. Netflix doesn’t say how it plans to keep its advertising revenue growing, but one way that competitors have chosen is to show people more ads. After forcing ad-supported streaming onto its existing members last year, Amazon Prime Video has since doubled the number of ads it shows during streams, according to a report from Adweek. An HBO Max support page spotted by PCWorld also revealed that it increased ads on the service’s Basic tier. In May, Netflix revealed that its ad-supported tier reaches more than 94 million users. During an earnings call on Thursday, Netflix co-CEO Greg Peters confirmed that the company will roll out interactive ads in the “second half” of 2025. The service also started rolling out its big homepage redesign on TV in May, which it says has reached around 50 percent of customers. As of its April earnings report, Netflix has stopped reporting how many subscribers it adds each quarter."
  },
  {
    "title": "These overpriced airport battery chargers have been recalled for a fire risk",
    "slug": "these-overpriced-airport-battery-chargers-have-been-recalled-for-a-fire-risk",
    "link": "https://www.theverge.com/news/709334/istore-recall-uscpsc-magnetic-wireless-power-bank",
    "published": "2025-07-17 17:32",
    "image": "https://images.unsplash.com/photo-1625464736517-9e580db23b80?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwwMDBtYWglMjBtYWduZXRpYyUyMHdpcmVsZXNzJTIwcG93ZXIlMjBiYW5rfGVufDB8fHx8MTc1Mjc4ODcxMHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "A company called iStore has issued a recall for its 5,000mAh Magnetic Wireless Power Bank (model IST-09991/W05) because its lithium ion battery can “overheat and ignite while charging,” posing a fire and burn risk. iStore has received three reports of the power banks exploding during charging, resulting in a minor burn for one user and […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. A company called iStore has issued a recall for its 5,000mAh Magnetic Wireless Power Bank (model IST-09991/W05) because its lithium ion battery can “overheat and ignite while charging,” posing a fire and burn risk. iStore has received three reports of the power banks exploding during charging, resulting in a minor burn for one user and around $15,000 of property damage, according to the US Consumer Product Safety Commission (CPSC). Approximately 8,520 of the power banks were sold in the US, plus an additional 6,400 in Canada, through the company’s online store and airport vending machines between February 2023 and May 2025. The magnetic power banks also feature a USB-C port for charging them back up. iStore warns consumers with a recalled unit to stop using the power bank immediately and properly dispose of it after submitting a claim for a refund by emailing two photos to recall@istore.co. As we’ve recommended before, sticking to reputable and known brands can help reduce the risk of power bank overheating issues. However, brands like Anker or Ugreen aren’t yet household names, and most consumers will probably assume that a power bank sold in an airport vending machine will be from a reputable company. Thousands of these power banks were purchased and potentially used on flights. Although the number of passengers who charged them while in the air was potentially low, there’s good reason to be especially alarmed by this recall given the history with battery fires on planes."
  },
  {
    "title": "Here's Your First Look at the Newest Emoji Coming Out This Fall",
    "slug": "here-s-your-first-look-at-the-newest-emoji-coming-out-this-fall",
    "link": "https://www.cnet.com/tech/services-and-software/heres-your-first-look-at-the-newest-emoji-coming-out-this-fall/#ftag=CAD590a51e",
    "published": "2025-07-17 21:26",
    "image": "https://www.cnet.com/a/img/resize/364643d771115c34db981845484991440360cc91/hub/2025/07/17/d46b800b-bd4d-4d29-bd36-92512853cd70/screenshot-2025-07-17-at-9-30-50am-1.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The Unicode Consortium announced the new emoji on World Emoji Day.",
    "full_text": "World Emoji Day is held every year on July 17 because that's the day on the 📅 calendar emoji. This year, the Unicode Consortium -- a non-profit devoted to developing, maintaining and promoting software standards and data -- used the day to announce the newest emoji. The upcoming emoji, which include a Sasquatch and an orca, will debut this September as part of Unicode 17.0. Here are the new emoji you can expect to see later this year. \"These new emoji have long-standing symbolic meanings, are visually distinctive and contain multitudes of expression,\" the Unicode Consortium wrote online. According to Unicode, the data files for these emoji will be made available this fall as part of Unicode 17.0. Then, the emoji will likely appear on your device in spring 2026. Most of the new emoji were proposed in November 2024. A landslide emoji was also proposed at the time, but it was not approved for the upcoming Unicode 17.0 launch. You can find those emoji now on your Android and iPhone devices, as well as across the internet."
  },
  {
    "title": "How to Get Free Marvel Rivals Skins With the College Perks Program",
    "slug": "how-to-get-free-marvel-rivals-skins-with-the-college-perks-program",
    "link": "https://www.cnet.com/tech/gaming/how-to-get-free-marvel-rivals-skins-with-the-college-perks-program/#ftag=CAD590a51e",
    "published": "2025-07-17 21:20",
    "image": "https://www.cnet.com/a/img/resize/b12e529e3297860370a13008f76043d563c59fd9/hub/2025/07/17/7d701c37-af1d-480d-81b0-c01d60694130/marvel-rivals-season-3-blade-and-phoenix.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The noble pursuit of a higher education can net you some free Marvel Rivals rewards. Here's how.",
    "full_text": "This is a good way to earn some free loot outside of events, Twitch drops and other promotions. The current Marvel Rivals college perk allows you to link your student email with your NetEase account to temporarily unlock 10 free costumes (and their associated MVP highlights) for use throughout Season 3. It's unclear whether additional college perks will be available in the future, though it's likely you'll at least be able to unlock a rotating wardrobe of trial skins through the program during future Marvel Rivals seasonal updates. Accessing the college perks is fairly straightforward and doesn't take more than a couple of minutes of your time, but it's tucked away in a menu you probably don't access all that often. Here's a step-by-step guide to unlock college perks on your Marvel Rivals account: The gear icon is located near your profile picture and player level. Detailed guide: Getting free Marvel Rivals skins and MVP animations through college perks In order to activate Marvel Rivals college perks for your NetEase account, you'll have to verify that you're in possession of an active student email address for a supported academic institution. It's one of the buttons next to your account picture and profile level. Voila -- just like that, you'll have access to college perks on your Marvel Rivals account."
  },
  {
    "title": "You can once again buy the AirPods 4 for less than $90",
    "slug": "you-can-once-again-buy-the-airpods-4-for-less-than-90",
    "link": "https://www.theverge.com/tech/709338/apple-airpods-4-active-noise-cancellation-deal-sale",
    "published": "2025-07-17 17:16",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/airpods4.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "We saw a ton of great Apple deals during Prime Day, most of which have disappeared. It’s okay if you missed out, though, as some of our favorite deals like the M2 MacBook Air have either stuck around or have returned, like the low price on Apple’s entry-level AirPods 4. Right now, you can pick […]",
    "full_text": "We saw a ton of great Apple deals during Prime Day, most of which have disappeared. It’s okay if you missed out, though, as some of our favorite deals like the M2 MacBook Air have either stuck around or have returned, like the low price on Apple’s entry-level AirPods 4. Right now, you can pick up a pair for just $89.99 ($40 off) at Amazon, Best Buy, and Walmart, which is $1 shy of their all-time best price. Alternatively, you can buy the model with active noise cancellation for $119.99 ($60 off) at Amazon and Walmart, which is also $1 shy of matching the Prime Day price. Related The best iPad deals you can get right now Regardless of which version of the AirPods 4 you purchase, these earbuds deliver more bass-rich sound than their respective predecessors. With an upgraded IP54 water and dust resistance rating, the AirPods 4 are also now as suitable for outdoor adventures as they are for sweaty gym sessions. Plus, the higher-end line offers a few other extra features not available for the entry-level pair. For instance, the more expensive AirPods 4 supports wireless charging and offers a transparency mode. And should you misplace them, they’re easier to locate thanks to support for Apple’s Find My app and the fact the case can emit sounds."
  },
  {
    "title": "Four iPhone 17 Pro Colors Leak, Including Action-Button Orange",
    "slug": "four-iphone-17-pro-colors-leak-including-action-button-orange",
    "link": "https://www.cnet.com/tech/mobile/four-iphone-17-pro-colors-leak-including-action-button-orange/#ftag=CAD590a51e",
    "published": "2025-07-17 21:08",
    "image": "https://www.cnet.com/a/img/resize/d4ff4c5fd4a3c75ab68c4e112bc06be7a2c59e7b/hub/2025/05/30/e70d5a3f-c91b-483d-9eba-cd5ae1be8ffa/03-iphone-17-rumor-images-pcmag-cpsd.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "These four new colors could make the iPhone 17 Pro lineup very distinctive.",
    "full_text": "As of Thursday, that's no longer the case thanks to another leak. And the iPhone 17 Pro lineup might be in for a much bolder selection of colors when it drops later this year. Spotted by 9to5 Mac, well-known leaker Majin Bu added a new post to their blog, complete with renders of the four new colors the iPhone 17 Pro lineup will potentially consist of, including a wild new orange option. I'm a sucker for an orange phone, so maybe we'll see even more in the future if Apple goes up to bat with the color this year. The iPhone 17 is rumored to receive multiple design changes when it arrives. Another change we could see is a bump in screen size for the baseline iPhone 17, bringing it up from 6.1 inches to line up with the 6.3-inch Pro model. What are the reported iPhone 17 Pro color options? It's lively but easy on the eyes and will likely satisfy those who've been wanting a more colorful iPhone Pro. Majin Bu says that Apple is currently testing another color for its devices but doesn't specify what device specifically, so if we do see another color drop, there's no guarantee it'll be for the Pro lineup. Apple representatives didn't immediately respond to a request for comment, but the company has traditionally unveiled its latest iPhone in September for a while now, so we may not have much longer to wait until we find out exactly what's in store for us this year."
  },
  {
    "title": "Anthropic tightens usage limits for Claude Code – without telling users",
    "slug": "anthropic-tightens-usage-limits-for-claude-code-without-telling-users",
    "link": "https://techcrunch.com/2025/07/17/anthropic-tightens-usage-limits-for-claude-code-without-telling-users/",
    "published": "2025-07-17 21:04",
    "image": "https://images.unsplash.com/photo-1725379447707-0a0386c7dbc8?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx1bmV4cGVjdGVkbHklMjByZXN0cmljdGl2ZSUyMHVzYWdlJTIwbGltaXRzfGVufDB8fHx8MTc1Mjc4NzgwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Claude Code users have been hit with unexpectedly restrictive usage limits. The problems, many of which have been aired on Claude Code’s GitHub page, seem to be concentrated among heavy users of the service, many of whom are on the $200-a-month Max plan.",
    "full_text": "Since Monday morning, Claude Code users have been hit with unexpectedly restrictive usage limits. “Your tracking of usage limits has changed and is no longer accurate,” one user complained. When reached for comment, an Anthropic representative confirmed the issues but declined to elaborate further. But Anthropic says the free user limit “will vary by demand” and does not set an absolute value. The result leaves users unable to plan around usage limits, since they have no clear idea of when their service will be restricted. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “The lack of communication just causes people to lose confidence in them.”"
  },
  {
    "title": "Meal Kits Have Gotten Cheap, but Are They Cheaper Than Groceries?",
    "slug": "meal-kits-have-gotten-cheap-but-are-they-cheaper-than-groceries",
    "link": "https://www.cnet.com/health/nutrition/meal-kits-have-gotten-cheap-but-are-they-cheaper-than-groceries/#ftag=CAD590a51e",
    "published": "2025-07-17 20:53",
    "image": "https://www.cnet.com/a/img/resize/cb4b92e177a5a20d34343e1403c784a5eb426b22/hub/2022/05/17/6bf0f712-cc90-45d7-9bb2-f9ca999c428e/screen-shot-2022-05-17-at-12-31-48-pm.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Groceries have never been more expensive, but meal kit prices have remained fairly stable. I did the math to see how much three popular meal kit companies cost when compared with food bought at the supermarket.",
    "full_text": "I put on my math hat to see if meal kits are actually a good deal in 2025. I chose basic, nonorganic items unless it was otherwise specified in the meal kit recipe. I picked steak and seafood recipes to compare since they represent the best value on most meal kit menus. Blue Apron typically offers at least one fairly high-end beef cut like sirloin steak with no added charge. HelloFresh offers one or two beef recipes per week, but they're usually a cheaper cut like chuck steak. Budget-friendly services including EveryPlate don't usually offer steak or seafood, which is how it keeps prices low. Blue Apron's seafood recipes including steak, salmon and trout prove to be an excellent value in 2025. I chose a barramundi recipe and chuck steak meal kit to compare with local grocery prices. EveryPlate's meal kit menus don't feature much in the way of steak or seafood so you can expect more budget-friendly proteins such as chicken, ground beef and pork chops. EveryPlate meals are also easy to make and satisfying, making it our top pick best cheap meal kit service."
  },
  {
    "title": "Google's Nest Aware Just Got Pricier. Here's How Much It'll Cost You",
    "slug": "google-s-nest-aware-just-got-pricier-here-s-how-much-it-ll-cost-you",
    "link": "https://www.cnet.com/home/security/googles-nest-aware-just-got-pricier-heres-how-much-itll-cost-you/#ftag=CAD590a51e",
    "published": "2025-07-17 20:52",
    "image": "https://www.cnet.com/a/img/resize/d9c03448385f12623df94f2f157da1745ddf954a/hub/2025/05/24/cf074f7f-f7b0-42c5-aca7-f0ca5db0664a/untitled-design-6.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The price jump likely has nothing to do with tariffs, CNET's home editor says.",
    "full_text": "Subscribers to Google's Nest Aware smart home system can expect a price increase starting next month. It could also go into effect after your promotional period, if you currently have a special limited-time offer. The Nest Aware subscription offers additional camera and security features for people with Nest doorbells, cameras, displays and speakers. The monthly subscription gives you access to your Nest camera's extended video history and sends real-time intelligent alerts about things like familiar face detection, sound events and smoke or carbon monoxide detection. Google announced the price hike after CNET's 2025 subscription survey recently found that 11% of US adults pay for security app subscriptions, and the average subscriber spends more than $1,000 on subscriptions a year. The last time Google increased its Nest Aware subscription prices was November 2023, before which the monthly subscription was just $6 per month, totaling $60 per year. Tyler Lacoma, CNET's home editor, said Nest isn't the only security company increasing prices this year -- but not because of tariffs. \"Arlo has also bumped up its secure cloud storage plan from $8 to $10 per month for a single camera,\" Lacoma said. Google didn't specify the reason for Nest Aware price increases. However, some Gemini features have come to Nest Aware subscriptions recently that could help the price increase make sense, including AI descriptions in your Google Home app of camera activity and AI video searching."
  },
  {
    "title": "This Emoji Won Most Popular New Emoji, but It Was Never Really a Contest",
    "slug": "this-emoji-won-most-popular-new-emoji-but-it-was-never-really-a-contest",
    "link": "https://www.cnet.com/tech/services-and-software/this-emoji-won-most-popular-new-emoji-but-it-was-never-really-a-contest/#ftag=CAD590a51e",
    "published": "2025-07-17 20:05",
    "image": "https://www.cnet.com/a/img/resize/96edbea74d5dddc2627fff7ea38ecd3c53242a75/hub/2025/07/16/4eab2874-4df4-4001-a56a-7c2d07ac12ea/emojipedia-blog-most-popular-new-emoji-2025.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The same emoji also won the award for the Most 2025 Emoji.",
    "full_text": "In my opinion, this year's winner for Most Popular New Emoji was bound to win. I mean, look at that beautiful emoji -- its expression says so much without any words. The emoji is countless people when they haven't had their morning cup of coffee, and it's also the face I make when someone I went to high school with tries to get me to join their multi-level marketing network. The splatter emoji shows a splash of an unknown liquid, and it's generally purple. While there's no known data on how people are using the shovel emoji, I can see this evolving into a way of saying you're going to bury someone, either beating them really badly in a fight or dropping a lot of scandalous dirt on them. I bet Scandal's Olivia Pope would have loved the shovel emoji. The upcoming Emoji 17.0 is set to be released later this year, and it will include emoji like an orca, a Sasquatch and a cartoonish fight cloud. It looks like someone's face viewed through a fisheye lens camera. This emoji's eyes are bulging, and it looks all around uncomfortable. The distorted face is a fine emoji, but I'm not really excited for it."
  },
  {
    "title": "AI-Powered Smart Devices Help Older Adults Age at Home, Survey Finds",
    "slug": "ai-powered-smart-devices-help-older-adults-age-at-home-survey-finds",
    "link": "https://www.cnet.com/tech/services-and-software/ai-powered-smart-devices-help-older-adults-age-at-home-survey-finds/#ftag=CAD590a51e",
    "published": "2025-07-17 20:00",
    "image": "https://www.cnet.com/a/img/resize/bbb2dc1411f0e293a3bbfe361094cb078c20f2b1/hub/2025/07/17/c8ce1202-9816-4276-a7ae-c043b0666e14/gettyimages-1408029589.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Despite trust in smart home tools and cameras, though, older people are generally skeptical of AI-generated material.",
    "full_text": "Older adults often find artificial intelligence smart home devices and voice assistants useful in helping them age in place, according to a new survey by the University of Michigan. More than half of people surveyed aged 50 and older have used generative AI tools they spoke or typed messages to, according to the National Poll on Healthy Aging, released by the U-M Institute for Healthcare Policy and Innovation. The Michigan survey, a telephone poll of 2,883 adults ages 50 to 97 across the US, looked not only at text-based chatbots like ChatGPT but also voice assistants like Amazon's Alexa and Apple's Siri. Most significantly, the survey found nearly all older adults want to be sure when they're receiving information generated by AI. \"Smart home devices frequently suggest using their latest features to watch over older relatives or help them live better lives,\" CNET smart home expert Tyler Lacoma said. \"AI face recognition, for example, can send alerts to a family member if it spots someone leaving their home or granny pod to go shopping. Just over half of them said they thought AI would do more harm than good. That split generally aligns with the results of a broader Pew survey from earlier this year, which found 51% of Americans were more concerned than excited about AI. That problem is significant, especially as more information-gathering tools like search engines are built primarily on AI. Experts advise that you should always double-check information before making an important decision."
  },
  {
    "title": "Today's NYT Connections: Sports Edition Hints and Answers for July 18, #298",
    "slug": "today-s-nyt-connections-sports-edition-hints-and-answers-for-july-18-298",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-sports-edition-hints-and-answers-for-july-18-298/#ftag=CAD590a51e",
    "published": "2025-07-17 20:00",
    "image": "https://www.cnet.com/a/img/resize/c7e1d294a1a554f051860c8dddd6fd0c6527b452/hub/2024/10/16/c34cfc41-01f2-4b1a-80a8-f6479c50c02e/connections-sports-edition-6859.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answers for the NYT Connections: Sports Edition puzzle for July 18, No. 298.",
    "full_text": "Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle and Strands puzzles. The purple group for today's Connections: Sports Edition might be a tough one. If you like baseball, have been paying attention to big games and know some famous sports names, then you'll do just fine with the rest of the puzzle. Purple group hint: Not DC, but the other one. Green group: Teams to lose their respective championships in 2025. Purple group: Teams and players who shares nicknames with Marvel characters. What are today's Connections: Sports Edition answers? The completed NYT Connections: Sports Edition puzzle for July 18, 2025. The theme is teams to lose their respective championships in 2025. The theme is teams and players who shares nicknames with Marvel characters."
  },
  {
    "title": "Today's NYT Strands Hints, Answers and Help for July 18 #502",
    "slug": "today-s-nyt-strands-hints-answers-and-help-for-july-18-502",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-strands-hints-answers-and-help-for-july-18-502/#ftag=CAD590a51e",
    "published": "2025-07-17 20:00",
    "image": "https://www.cnet.com/a/img/resize/166e67238a28ef7d82e62fe8aec7185a7cc23eda/hub/2024/05/15/859c9110-e596-432b-8690-95e6102759c9/nyt-new-york-times-strands-2054.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and answers for the NYT Strands puzzle for July 18 No. 502.",
    "full_text": "Click here for our daily Strands hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle, Connections and Connections: Sports Edition puzzles. Today's NYT Strands puzzle has a fun theme that made me laugh -- until I started unscrambling the answers, some of which are tough. If you need hints and answers, read on. I go into depth about the rules for Strands in this story. If you're looking for today's Wordle, Connections and Mini Crossword answers, you can visit CNET's NYT puzzle hints page. If that doesn't help you, here's a clue: Pull a rabbit out of your hat. Your goal is to find hidden words that fit the puzzle's theme. Every time you find three words of four letters or more, Strands will reveal one of the theme words. These are the words I used to get those hints but any words of four or more letters that you find will work: When you have all of them (I originally thought there were always eight but learned that the number can vary), every letter on the board will be used."
  },
  {
    "title": "Today's NYT Connections Hints, Answers and Help for July 18, #768",
    "slug": "today-s-nyt-connections-hints-answers-and-help-for-july-18-768",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-hints-answers-and-help-for-july-18-768/#ftag=CAD590a51e",
    "published": "2025-07-17 20:00",
    "image": "https://www.cnet.com/a/img/resize/3986ca4ac5b498c6114118e0dfa25b2a05ae6531/hub/2025/03/26/c70b0a32-884a-4379-b77b-de75776952ba/nyt-word-games-connections-2798.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are some hints and the answers for the NYT Connections puzzle for July 18, #768.",
    "full_text": "Looking for the most recent Connections answers? Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle, Connections: Sports Edition and Strands puzzles. Today's NYT Connections puzzle is all over the place. Read on for clues and today's Connections answers. Go there after you play to receive a numeric score and to have the program analyze your answers. Players who are registered with the Times Games section can now nerd out by following their progress, including number of puzzles completed, win rate, number of times they nabbed a perfect score and their win streak. Read more: Hints, Tips and Strategies to Help You Win at NYT Connections Every Time Yellow group hint: Order of things. Green group hint: Ah, I get it. Purple group hint: Eddy Grant sang about this avenue."
  },
  {
    "title": "Today's Wordle Hints, Answer and Help for July 18, #1490",
    "slug": "today-s-wordle-hints-answer-and-help-for-july-18-1490",
    "link": "https://www.cnet.com/tech/gaming/todays-wordle-hints-answer-and-help-for-july-18-1490/#ftag=CAD590a51e",
    "published": "2025-07-17 20:00",
    "image": "https://www.cnet.com/a/img/resize/837b400de41f50a97b52a8c799b193be01cea440/hub/2024/05/28/20480816-214e-4fcc-a9b4-b02f0ac71e7c/wordle-word-game-hints-puzzle-8667.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answer for today's Wordle for July 18, No. 1,490.",
    "full_text": "Gael Cooper CNET editor Gael Fashingbauer Cooper, a journalist and pop-culture junkie, is co-author of \"Whatever Happened to Pudding Pops? The Lost Toys, Tastes and Trends of the '70s and '80s,\" as well as \"The Totally Sweet '90s.\" She's been a journalist since 1989, working at Mpls.St.Paul Magazine, Twin Cities Sidewalk, the Minneapolis Star Tribune, and NBC News Digital. She's Gen X in birthdate, word and deed. If Marathon candy bars ever come back, she'll be first in line."
  },
  {
    "title": "Anker’s new charging station battles desktop clutter with two retractable USB-C cables",
    "slug": "ankers-new-charging-station-battles-desktop-clutter-with-two-retractable-usb-c-cables",
    "link": "https://www.theverge.com/news/709301/anker-nano-charging-station-usb-retractable",
    "published": "2025-07-17 15:55",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/anker1.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613",
    "summary": "The current trend in USB chargers isn’t adding more power or ports, it’s integrating charging cables that disappear when not in use. Anker was one of the first companies to release a charger with a built-in retractable USB-C cable last October, but its latest charger brings the same convenience to the desktop alongside three AC […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. The current trend in USB chargers isn’t adding more power or ports, it’s integrating charging cables that disappear when not in use. Nearly a year ago Anker released a desktop charger with a dial on the side that could be used to adjust the power output of its six USB ports, but at $169.99 it was expensive and required you to supply all your own cables. Anker’s new 7-in-1 Nano Charging Station can only charge four devices over USB, but at $89.99 it’s cheaper and potentially more versatile as you can add additional USB ports by plugging other power adapters into the back of it. The Nano Charging Station’s biggest selling point is its pair of 2.3-foot long USB-C cables that retract with a quick pull and keep their connectors securely stored using magnets. They’re joined by an additional USB-C and USB-A port on one side. The more expensive option can deliver up to 140W of power to a device, but the Nano maxes out at just 100W when nothing else is plugged in. If you’re charging two devices, the maximum power output drops to between 50W and 88W, depending on which ports are in use. To help ensure you don’t find out the hard way your laptop isn’t adequately charging when it suddenly dies, the charging station includes a 1.3-inch LCD display that shows how much power is being delivered to each connected device. Although the promises of a completely wireless world through technologies like Wi-Fi and Qi haven’t quite materialized yet, the recent proliferation of chargers and power banks with retractable cables is a suitable consolation prize while we wait for our truly cordless future to arrive."
  },
  {
    "title": "Peacock is raising its prices by $3",
    "slug": "peacock-is-raising-its-prices-by-3",
    "link": "https://www.theverge.com/news/709315/peacock-price-hike-nbcuniversal",
    "published": "2025-07-17 15:25",
    "image": "https://images.unsplash.com/photo-1645091246457-db3ae1e426d9?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmcmVlJTIwcHJlbWl1bSUyMHBsdXMlMjBwbGFufGVufDB8fHx8MTc1Mjc4MDYxMHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "A subscription to Peacock is about to cost more. NBCUniversal announced on Thursday that it’s raising the price of its ad-supported Peacock Premium from $7.99 to $10.99 per month, while its ad-free Premium Plus plan will go from $13.99 per month to $16.99 per month. News of the price hike was first reported by Vulture. […]",
    "full_text": "Previously, she was a writer and editor at MUO. NBCUniversal announced on Thursday that it’s raising the price of its ad-supported Peacock Premium from $7.99 to $10.99 per month, while its ad-free Premium Plus plan will go from $13.99 per month to $16.99 per month. News of the price hike was first reported by Vulture. For new customers, the price increase will go into effect on July 23rd. Existing subscribers will see the hike on or after August 22nd, depending on when their next bill is. Peacock’s yearly plans will see similar increases, with Peacock Premium now priced at $109.99 per year (up from $79.99) and Premium Plus costing $169.99 (up from $139.99). Peacock raised its prices by $2 in the lead-up to the 2024 Summer Olympics, an event it will continue to stream for at least another decade. It will also air NBA games later this year. Along with the price increase, NBCUniversal also announced that it’s going to test a new ad-supported Peacock “Select” tier for $7.99 per month ($79.99 / year). The plan will offer access to content from NBC and Bravo, as well as some other titles."
  },
  {
    "title": "Peacock Streaming Price Hike to Arrive This Month",
    "slug": "peacock-streaming-price-hike-to-arrive-this-month",
    "link": "https://www.cnet.com/tech/services-and-software/peacock-streaming-price-hike-to-arrive-this-month/#ftag=CAD590a51e",
    "published": "2025-07-17 19:25",
    "image": "https://www.cnet.com/a/img/resize/ec7571c7411656497e23bddfd4b5546e9b5c68e9/hub/2025/06/02/dab879c1-d6de-4b9c-a15e-a0a43b45ed87/lvilnd-s7-final-holding-hero-04.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Along with the price bump, the streamer is testing a new subscription tier.",
    "full_text": "We know many of you have been using your Peacock subscription these past few weeks with Love Island season 7 airing, but now it's time to get ready for another surprise: Peacock's hiking its prices. The streaming service announced on Thursday that the cost of its monthly and annual plans will increase beginning July 23 for new and returning customers. However, prices will increase in August for current subscribers. With a bump of $3 more each month for Peacock Premium and Peacock Premium Plus, the rates will climb from $8 to $11 for the ad-based option, and from $14 to $17 for the ad-free version. Existing customers will see the change in their bills on or after Aug. 22. Though Peacock raised its prices last year, these new rates put it on par with HBO Max and other rivals like Disney Plus, whose bundle offerings can help save money. The streamer also said that it's testing a new tier called Select, a cheaper offering with current programming from NBC and Bravo, along with a slate of library titles. Because it's positioned as Peacock's lowest-priced option at $8 per month ($80 a year), you'll have the choice to upgrade to either Premium or Premium Plus. Later this year, viewers will be able to stream NBA on NBC, Wicked: For Good, Jurassic World Rebirth and the Love Island reunion. And in 2026, cord-cutters can watch Super Bowl LX on Peacock."
  },
  {
    "title": "Razer’s new Pokémon collab is not very effective",
    "slug": "razers-new-pokemon-collab-is-not-very-effective",
    "link": "https://www.theverge.com/tech/709193/razer-pokemon-pc-gaming-accessories-keyboard-mouse-headset",
    "published": "2025-07-17 15:20",
    "image": "https://images.unsplash.com/photo-1528198083909-60c0bf5b0718?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0aGVtZWQlMjBibGFja3dpZG93JTIwdjQlMjB4JTIwa2V5Ym9hcmR8ZW58MHx8fHwxNzUyNzgwNjEwfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Razer's new Pokémon collaboration is a missed opportunity. The four PC gaming peripherals in this lineup are simply reskinned versions of products that already exist, and which cost $20 to $40 more than their all-black counterparts. You really should be getting more for your money here. For example, the themed BlackWidow V4 X keyboard should […]",
    "full_text": "Razer’s new Pokémon collaboration is a missed opportunity. The four PC gaming peripherals in this lineup are simply reskinned versions of products that already exist, and which cost $20 to $40 more than their all-black counterparts. You really should be getting more for your money here. For example, the themed BlackWidow V4 X keyboard should include at least one highly detailed custom keycap (switching out Alt for pokéball designs doesn’t cut it). Maybe the Kraken V4 X headset could have included themed pop filters of pokémon silhouettes. I’m just spitballing, which I guess is something that neither Razer nor The Pokémon Company did enough of during this collaboration."
  },
  {
    "title": "What's Free in the Epic Games Store This Week?",
    "slug": "what-s-free-in-the-epic-games-store-this-week",
    "link": "https://www.cnet.com/tech/gaming/list-of-free-games-on-the-epic-games-store-this-week/#ftag=CAD590a51e",
    "published": "2025-07-17 19:09",
    "image": "https://www.cnet.com/a/img/resize/7300b77c69ecc54811cd07594d452cf6636fe38e/hub/2024/10/17/e716b856-3543-4193-b4bc-cbc0f195156f/epic-games-store-fortnite-9994.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "This week's free game is a strategy game that has you leading your civilization into a brave new world. Will you succeed, or will you crash and burn?",
    "full_text": "There's no shame in that, especially when you consider the threat of tariffs looming and video game prices rising. Each week will be different, but you're guaranteed to at least get one free game. If you ask anyone to name a great game franchise, we're pretty sure that someone will mention Sid Meier's Civilization. Usually $80, Sid Meier’s Civilization VI Platinum Edition is available for free via the Epic Games Store. Usually $16, Legion TD 2 will be available for free via the Epic Games Store next week. Bus Simulator 21 Next Stop, Lego Star Wars: The Skywalker Saga (Dec. 5 to 12) Rumble Club Free Game of the Week Bonus; Freshly Frosted (June 20 to 27) Orwell: Keeping an Eye on You; Europa Universalis IV (Aug. 10 to 17) Kao the Kangaroo; Horizon Chase Turbo, Against All Odds (May 4 to 11) Shapez; Dying Light: The Following -- Enhanced Edition (April 6 to 13)"
  },
  {
    "title": "A New Study Finds That Walking 14 More Steps Per Minute Can Support Healthy Aging",
    "slug": "a-new-study-finds-that-walking-14-more-steps-per-minute-can-support-healthy-aging",
    "link": "https://www.cnet.com/health/fitness/new-study-finds-walking-14-more-steps-minute-support-healthy-aging/#ftag=CAD590a51e",
    "published": "2025-07-17 19:07",
    "image": "https://www.cnet.com/a/img/resize/365bcf96c6a8cd29bcb9164da6f77704245a9847/hub/2025/06/12/04c73944-343e-4eef-9012-234418cbbe92/gettyimages-2202993853.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "We reached out to personal trainers to discuss the health benefits of walking, and how you can take this low-impact workout to the next level.",
    "full_text": "If you've been under the impression that walking has no benefits and doesn't count as exercise, a brand new study might change your mind. Walking at a slow or leisurely pace (2 mph or less) is considered a light-intensity activity, which is likely to produce some health benefits compared to sedentary behavior, but not as many benefits as walking briskly. Harvard Health Publishing states that walking builds lower body strength, which improves balance. A 2013 study out of Cancer Epidemiology, Biomarkers & Prevention found that postmenopausal women who walked at least seven hours per week had a 14% lower risk of getting breast cancer than women who walked three hours or less every week. If you're currently walking 30 minutes a day, add more time in 10- or 15-minute intervals. Putsov recommends walking at least 45 minutes a day if your goal is weight loss. If you're currently walking 30 minutes a day, add more time in 10- or 15-minute intervals. Putsov recommends walking at least 45 minutes a day if your goal is weight loss. You may find music and podcasts helpful because they make time appear to pass more quickly. Parella says a walking buddy can increase your sense of accountability and make the experience more fun."
  },
  {
    "title": "No. Eggs Won't Impact Your Cholesterol and 17 Other Health Myths You Can Stop Believing",
    "slug": "no-eggs-won-t-impact-your-cholesterol-and-17-other-health-myths-you-can-stop-believing",
    "link": "https://www.cnet.com/health/common-health-myths-debunked/#ftag=CAD590a51e",
    "published": "2025-07-17 19:06",
    "image": "https://www.cnet.com/a/img/resize/8e45b9e3233c53ce4b51b36a2e15729fd2aaa04b/hub/2020/03/02/e28298c4-e69d-4535-a16a-8cb8de3e3be5/gettyimages-130409892.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Also, 10,000 steps a day isn't going to make you healthy.",
    "full_text": "Here are 18 of the most common health myths that everyone needs to stop believing right now. It's just not true for everyone: Researchers have found that certain nighttime exercises like yoga or weightlifting may have no impact whatsoever on your sleep quality, and for some people, exercising before bed can even result in better ZZZs. But walking 10,000 steps a day is not enough to get healthy for most people. Medical literature still contains much controversy about saturated fat and its relationship to cardiovascular diseases. The US Food and Drug Administration still recommends limiting (but not completely avoiding) saturated fat intake in the updated Dietary Guidelines for Americans, and to be safe, it's a good idea to follow their advice. As for any other health risks you believe about coffee, those probably aren't true either: Coffee isn't linked to any medical conditions except for a slight, temporary increase in blood pressure. The wellness world might have you believe otherwise, but there is no scientific evidence that GMOs cause cancer (or any other health problems). A meta-analysis of long-term studies on GMOs concluded that \"GM plants are nutritionally equivalent to their non-GM counterparts and can be safely used in food [for people] and feed [for animals].\" They do emit electromagnetic radiation, a form of nonionizing radiation similar to the radio frequency waves that come from your cell phone (which also won't give you cancer, by the way), but nonionizing radiation isn't known to cause cancer in humans because it isn't strong enough to alter the structure of cells. This myth started coming about in the early 2000s, when studies like this one reported that applying deodorant to cells in a petri dish caused individual cell damage, and aluminum got called out as a potential culprit."
  },
  {
    "title": "Microsoft is buying tons of carbon removal from Xprize startup Vaulted Deep",
    "slug": "microsoft-is-buying-tons-of-carbon-removal-from-xprize-startup-vaulted-deep",
    "link": "https://techcrunch.com/2025/07/17/microsoft-is-buying-tons-of-carbon-removal-from-xprize-startup-vaulted-deep/",
    "published": "2025-07-17 19:03",
    "image": "https://images.unsplash.com/photo-1641945512297-538a81b13f85?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwyMDMwJTIwY2FyYm9uJTIwbmVnYXRpdmUlMjBwbGVkZ2V8ZW58MHx8fHwxNzUyNzc5NzA1fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Microsoft's data center boom has been imperiling its 2030 carbon negative pledge, so the tech giant is turning to Vaulted Deep, which operates like a reverse oil company.",
    "full_text": "Microsoft is building data centers as fast as it can, and that’s killing its carbon balance sheet. Since 2020, its carbon emissions have grown by nearly a quarter, undermining the pledge it made that year to remove more carbon from the atmosphere than it generates by 2030. So Microsoft has been buying massive amounts of carbon-removal credits to attempt to remedy that situation, including a newly announced purchase of 4.9 million metric tons from Vaulted Deep. It will last 12 years through 2038. Vaulted Deep operates like a reverse oil company. It collects solid waste — like treated sewage, excess manure, or paper sludge — that would otherwise be headed for a landfill or incinerator, blends it into a slurry, and injects it into porous rocks deep underground. So far, Vaulted Deep has removed over 18,000 metric tons of carbon dioxide. Recently, Microsoft has been stuck between a rock and a hard place to make good on its imperiled carbon pledge. While the tech company has been investing heavily in renewable power — avoiding emissions is considered the appropriate first step — there are some things it must use, like semiconductors, for which there are no zero-greenhouse-gas alternatives. Among them are a 7 million metric ton deal with Chestnut Carbon to reforest 60,000 acres in the southeastern U.S. and another for 3.7 million metric tons with CO280 to capture carbon from paper mill operations along the Gulf Coast."
  },
  {
    "title": "Best Internet Providers in Louisville, Kentucky",
    "slug": "best-internet-providers-in-louisville-kentucky",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-louisville-ky/#ftag=CAD590a51e",
    "published": "2025-07-17 19:00",
    "image": "https://www.cnet.com/a/img/resize/b19e76a69070660cd6e86a2a7d498cd5c426f751/hub/2023/05/23/55500485-61a0-49e4-8850-7fae0bad3a03/louisville-gettyimages-471242309.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "CNET has uncovered the best internet deals for high-speed and reliability for Louisville residents looking for a new internet service provider connection.",
    "full_text": "(Disclosure: Ookla is owned by the same parent company as CNET, Ziff Davis.) Here's a quick look at all Louisville ISPs that may be worth your consideration. Earthlink : This provider has DSL, fiber and 5G internet plans available across Louisville. : This provider has DSL, fiber and 5G internet plans available across Louisville. Most providers in Louisville start their internet plans at about $50 per month. Some providers will offer a lower introductory rate, so be sure to check out the long-term pricing when you're shopping for plans. Similarly, the best Spectrum and Viasat plans come by way of bundled services. We also input local addresses on provider websites to find specific options for residents. To evaluate how happy customers are with an ISP's service, we look at sources including the American Customer Satisfaction Index and J.D. Either is a decent option for internet service, but AT&T Fiber's likely to be the better value due to faster download and upload speed potential, lower equipment fees and more stable pricing."
  },
  {
    "title": "Netflix Green-Lights 'Assassin's Creed' TV Series Adaptation",
    "slug": "netflix-green-lights-assassin-s-creed-tv-series-adaptation",
    "link": "https://www.cnet.com/tech/services-and-software/netflix-greenlights-assassins-creed-tv-series-adaptation/#ftag=CAD590a51e",
    "published": "2025-07-17 18:54",
    "image": "https://www.cnet.com/a/img/resize/aa63f9befada10e1819950cc95df1ce65b4eef55/hub/2025/03/14/b8c76f1d-a213-40b4-8cf4-27c1eafa78a0/ac1-game-overview-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The original partnership between Netflix and Ubisoft began five years ago. We'll soon be able to see the fruits of the union, with the upcoming adaptation.",
    "full_text": "You can now add Assassin's Creed to the Netflix game-to-show adaptation portfolio. Assassin's Creed is a historical action-adventure game that spans multiple time periods and has players assuming the role of multiple characters across the franchise. The first title was released in 2007 and has spawned multiple sequels. More than 230 million units of Assassin's Creed have been sold. The upcoming streaming series' logline gives a glimpse of what to expect when the series arrives: \"Assassin's Creed is a high-octane thriller centered on the secret war between two shadowy factions -- one set on determining mankind's future through control and manipulation, while the other fights to preserve free will.\" Netflix has a number of game-to-streaming adaptations under its belt, and more on the way, including the much-loved and long-awaited BioShock film that's been in development for the past three years. Assassin's Creed seems like a solid addition to the lineup and like something that'll get a lot of people excited. Netflix tapped Robert Patino (Westworld, Sons of Anarchy) and David Wiener (Halo, Brave New World) to be the creators of the adaptation. Both also serve as showrunners and executive producers. No release date has been set."
  },
  {
    "title": "Does Your Favorite Emoji Crack the List of CNET's Top Picks?",
    "slug": "does-your-favorite-emoji-crack-the-list-of-cnet-s-top-picks",
    "link": "https://www.cnet.com/tech/services-and-software/does-your-favorite-emoji-crack-the-list-of-cnets-top-picks/#ftag=CAD590a51e",
    "published": "2025-07-17 18:41",
    "image": "https://www.cnet.com/a/img/resize/c2976e22ca84e06e959b3034d4206054f3475a9a/hub/2025/07/16/9e221b07-0ae6-442a-beb0-39c8a23d5281/emojipedia-lg-header-image.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Celebrate all of the smileys, hearts and gestures for World Emoji Day.",
    "full_text": "In honor of the internet holiday, I asked my colleagues at CNET what their favorite and most used emoji are. There was more variety in the category of favorite emoji since individual tastes are subjective, while there was more homogeneity among most used emoji -- not surprising in a work environment. 2 emoji were tied for our favorite, and the vibe is 'everything's fine' \"Melting smiley face is just a perfect encapsulation of when you're on the verge of a meltdown from things going awry but you have to keep smiling through it all,\" said CNET Editor-at-Large Bridget Carey, who voted for the melting face. The grimacing emoji is here to say 'people really didn't think this through' and 'way to pour gasoline on a fire' all in brief unicode,\" said CNET senior writer David Lumb, who voted for the grimacing face emoji. That means CNET's two favorite emoji can be used to convey negative emotions. Does that mean we're all struggling with feelings of nervousness at any given time, or always anxious? I love his awkward grin and unruly hair paired with an all-powerful wooded scepter.\" The folded hands emoji has also been used at times to connote someone begging or requesting something. \"The heart hands emoji glided through that window and into my life."
  },
  {
    "title": "HBO Max: The 28 Absolute Best TV Shows to Watch",
    "slug": "hbo-max-the-28-absolute-best-tv-shows-to-watch",
    "link": "https://www.cnet.com/culture/entertainment/best-tv-shows-on-hbo-max-july-2025/#ftag=CAD590a51e",
    "published": "2025-07-17 18:27",
    "image": "https://www.cnet.com/a/img/resize/35ab9d198607dde8f3b8898acb971dae12ded7fd/hub/2025/01/22/8e9ed219-1bc2-4e19-be35-fa1ff7eb32e9/the-pitt.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Check out these highly rated series on HBO Max, plus a look at what's coming out in July.",
    "full_text": "Here are the highly rated series you shouldn't wait to watch on HBO Max, plus this month's new releases. This list focuses on shows that have premiered a new season since 2023 (or are currently renewed for more seasons). Set hundreds of years before fantasy series GoT, the prequel depicts how infighting and tragedy consume House Targaryen. The hilarious, action-packed show also features characters like Poison Ivy and four seasons are available to binge. The story follows characters marooned on a peculiar planet that's home to fascinating creatures and landscapes. Atsushi Nishijima/HBO Fantasmas (2024- ) Viewers have former Saturday Night Live writer Julio Torres to thank for this quirky and captivating HBO comedy. The show establishes Peacemaker's next steps -- he isn't returning to prison, instead taking part in a black ops mission that will (again) get his hands dirty. HBO Max Rap Sh!t (2022-23) A half-hour comedy series from Issa Rae (the star and creator of HBO's acclaimed series Insecure), Rap Sh!t introduces two former friends from high school. Watch out for scene-stealer Minnie Driver as Tom's agent in this witty, neatly crafted comedy package. Chris Kelly and Sarah Schneider tell the story of Cary (Drew Tarver) and Brooke (Heléne Yorker), siblings in their late 20s who struggle with the sudden rise to internet fame of their 13-year-old Justin Bieber-channeling brother."
  },
  {
    "title": "Hadrian raises $260M to build out automated factories for space and defense parts",
    "slug": "hadrian-raises-260m-to-build-out-automated-factories-for-space-and-defense-parts",
    "link": "https://techcrunch.com/2025/07/17/hadrian-raises-260m-to-build-out-automated-factories-for-space-and-defense-parts/",
    "published": "2025-07-17 18:16",
    "image": "https://images.unsplash.com/photo-1677933421705-b037e6f2a184?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxyZXZvbHV0aW9uaXplJTIwYW1lcmljYW4lMjBtYW51ZmFjdHVyaW5nfGVufDB8fHx8MTc1Mjc3NzAwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Hadrian wants to revolutionize American manufacturing through automation.",
    "full_text": "It’s a huge change to the status quo: a manufacturing industry that’s largely populated by dozens of small machining shops run by an aging workforce. Hadrian’s first target was high-precision CNC machining, a manufacturing process that makes parts to extremely tight tolerances — often measured in the microns, not millimeters (a single human hair is anywhere from 50 to 120 microns in thickness). (He did not immediately respond to TechCrunch’s request for comment on the new round.) Hadrian’s business model is not just selling parts, but also a “factories as a service” model that will see dedicated facilities for customers that want to ensure committed factory capacity. Speaking at the Reindustrialization Summit on Wednesday, Power argued that reshoring domestic production is nothing less than existential: “This country is heading into a generational fight,” he said. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. The company has now raised nearly $500 million since it was founded in 2020."
  },
  {
    "title": "After raising over $3M, popular VC-backed beauty brand Ami Colé is shuttering",
    "slug": "after-raising-over-3m-popular-vc-backed-beauty-brand-ami-cole-is-shuttering",
    "link": "https://techcrunch.com/2025/07/17/after-raising-over-3m-popular-vc-backed-beauty-brand-ami-cole-is-shuttering/",
    "published": "2025-07-17 17:59",
    "image": "https://images.unsplash.com/photo-1599408444232-8947844d94e2?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjb25zdW1lciUyMHJldGFpbCUyMGJ1c2luZXNzfGVufDB8fHx8MTc1Mjc3NjEwNnww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Diarrha N'Diaye-Mbaye, one of the first among the small number of Black women to raise more than $1 million in venture capital, hinted that one of the problems was tension between her and investors' expectations of a consumer retail business.",
    "full_text": "But the 4-year-old company will now officially shutter in September. Ami Colé did not immediately respond to our request for comment. Like many Black startups launched after the murder of George Floyd, Ami Colé rode the waves of excitement from investors and corporations looking to pour money into backing more products and initiatives that touched upon diversity, equity, and inclusion. While she had loyal customers, her fast nationwide growth meant pressure from investors. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. The strain comes as venture funding to Black founders has hit a multi-year low in a political climate that has disavowed anything perceived as DEI. “I still believe in beauty — at every level — and I’m looking forward to discovering what comes next,” she said."
  },
  {
    "title": "OpenAI launches a general purpose agent in ChatGPT",
    "slug": "openai-launches-a-general-purpose-agent-in-chatgpt",
    "link": "https://techcrunch.com/2025/07/17/openai-launches-a-general-purpose-agent-in-chatgpt/",
    "published": "2025-07-17 17:00",
    "image": "https://images.unsplash.com/photo-1499090399400-2e7e7fc96c02?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjYXBhYmxlJTIwYWklMjBhZ2VudCUyMHByb2R1Y3QlMjB5ZXR8ZW58MHx8fHwxNzUyNzcyNTAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "OpenAI announced the launch of ChatGPT agent, which the company claims to be its most capable AI agent product yet.",
    "full_text": "OpenAI says users will be able to interact with the agent simply by prompting ChatGPT in natural language. To activate the tool, users can select “agent mode” in ChatGPT’s dropdown menu of tools. That said, OpenAI says ChatGPT agent is far more capable than its previous offerings. They’re here to deliver the insights that fuel startup growth and sharpen your edge. They’re here to deliver the insights that fuel startup growth and sharpen your edge. The model underlying ChatGPT agent offers state-of-the-art performance on several benchmarks, according to OpenAI. OpenAI says it runs a classifier across every prompt entered into ChatGPT agent, determining whether the request is related to biology. OpenAI also says it disabled ChatGPT’s memory feature for this agent to prevent misuse. In other parts of ChatGPT, OpenAI’s memory feature allows the chatbot to reference information from previous user chats. However, OpenAI says bad actors could use the feature in ChatGPT agent to exfiltrate sensitive data through prompt injection attacks."
  },
  {
    "title": "Twitch starts testing vertical video streams",
    "slug": "twitch-starts-testing-vertical-video-streams",
    "link": "https://techcrunch.com/2025/07/17/twitch-starts-testing-vertical-video-streams/",
    "published": "2025-07-17 16:53",
    "image": "https://images.unsplash.com/photo-1659353884792-c2c21739820d?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZXN0cyUyMHdvdWxkJTIwZm9jdXN8ZW58MHx8fHwxNzUyNzcxNjAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Twitch's tests are not widespread at this point, as AppSensa's research only found a handful of references in the app's code that mentioned the tests would focus on just \"a few streamers\" for the time being.",
    "full_text": "Livestreaming service Twitch, which is owned by Amazon, announced at its annual TwitchCon event earlier this year that it would move into the vertical video space. Now those initial alpha tests have gone live with a few streamers, according to findings from market intelligence provider AppSensa. In a recent build, the firm found references to the vertical video tests and information about what sort of features these new streams would offer. Twitch’s tests are not widespread at this point, as AppSensa’s research only found a handful of references in the app’s code that mentioned the tests would focus on just “a few streamers” for the time being. (It was unable to identify which ones.) The firm was also able to identify a vertical theater mode with dedicated user interface elements and a way to toggle between Twitch’s classic and new vertical video formats. When users encounter the feature for the first time, they’ll be presented with user education dialogs that say “vertical video is here,” and remind users it’s still just a test and they can switch to the classic view at any time. Reached for comment, Twitch declined to say more about the tests, only noting that the company had said during its keynote at TwitchCon Rotterdam earlier this year that it would begin testing with a small number of channels during the summer. A spokesperson added that those tests would expand to more users later in the year. During TwitchCon, the company announced it would try out dual-format and 2K streaming with a small number of channels, as well."
  },
  {
    "title": "Meta appoints generative AI VP to run Threads",
    "slug": "meta-appoints-generative-ai-vp-to-run-threads",
    "link": "https://techcrunch.com/2025/07/17/meta-appoints-generative-ai-vp-to-run-threads/",
    "published": "2025-07-17 16:43",
    "image": "https://images.unsplash.com/photo-1564259325939-537478f2d65f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxtZXRhJTIwYXBwb2ludGVkJTIwY29ubm9yJTIwaGF5ZXN8ZW58MHx8fHwxNzUyNzcwNzAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Meta appointed Connor Hayes, Meta's VP of product for generative AI, to become the head of Threads.",
    "full_text": "In Brief Meta appointed Connor Hayes, Meta’s VP of Product for Generative AI, to become the head of Threads, per Axios. Until now, Instagram head Adam Mosseri has been in charge of Threads. But the platform has grown into more than a side product of Instagram, necessitating additional leadership. Though Threads only launched in 2023, its mobile daily active user (DAU) numbers are fast approaching those of X, according to market intelligence provider Similarweb. Currently, Threads is averaging around 115 million DAUs on mobile, with X’s DAU numbers reaching around 132 million. TechCrunch has reached out to Meta for comment."
  },
  {
    "title": "Rivian restarting work on its Georgia factory, emails show",
    "slug": "rivian-restarting-work-on-its-georgia-factory-emails-show",
    "link": "https://techcrunch.com/2025/07/17/rivian-restarting-work-on-its-georgia-factory-emails-show/",
    "published": "2025-07-17 16:15",
    "image": "https://images.unsplash.com/photo-1621948415096-db7be1f040bd?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxiZWdpbiUyMGluc3RhbGxpbmclMjAlRTIlODAlOUMlMjBkZWVwJTIwdXRpbGl0aWVzJTIwJUUyJTgwJTlEfGVufDB8fHx8MTc1Mjc3NTIwNnww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The project has created 46 full-time jobs so far. Rivian will begin installing “deep utilities” in August, with “vertical construction” set to begin in the first quarter of 2026.",
    "full_text": "They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Rivian first announced the Georgia factory shortly after its IPO in late 2021. And the project took a back seat as Rivian worked around supply chain shortages during the ramp-up of its R1T pickup truck and R1S SUV at its original factory in Normal, Illinois. Electric vehicles are a global strategic industry, and the U.S. should maintain its leadership role in new technologies.”) “I believe a while back GDEcD had prepared an overview of existing suppliers within Georgia and the greater South East region. In an email to TechCrunch, Squire said that “Georgia and the Southeast have a very strong automotive supplier base. It has posted seven open roles to LinkedIn within the last month, including one for construction manager."
  },
  {
    "title": "Substack raises $100M from Chernin Group, Andreessen Horowitz, Skims CEO, and more",
    "slug": "substack-raises-100m-from-chernin-group-andreessen-horowitz-skims-ceo-and-more",
    "link": "https://techcrunch.com/2025/07/17/substack-raises-100m-from-chernin-group-andreessen-horowitz-skims-ceo-and-more/",
    "published": "2025-07-17 16:10",
    "image": "https://images.unsplash.com/photo-1654842215523-1b7e5b9ed267?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjB5b3JrJTIwdGltZXMlMjByZXBvcnRzfGVufDB8fHx8MTc1Mjc2ODkwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The New York Times reports that the funding brings Substack's valuation to $1.1 billion, almost 70% higher than its 2021 valuation of $650 million.",
    "full_text": "In Brief Substack announced on Thursday that it has raised $100 million in Series C funding led by investors at BOND and The Chernin Group (TCG). The round included participation from Andreessen Horowitz; Rich Paul, CEO and founder of Klutch Sports Group; and Jens Grede, CEO and co-founder of Skims. The New York Times reports that the funding brings Substack’s valuation to $1.1 billion, almost 70% higher than its 2021 valuation of $650 million. Founded in 2017, Substack has gained popularity as a platform for creators and publishers to monetize their content. The company said in March that it had surpassed 5 million paid subscriptions on its platform, up from 2 million in 2023. Substack said in the blog post that it will use the funding to invest in “better tools, broader reach, and deeper support for writers and creators.” It also plans to invest in the Substack app."
  },
  {
    "title": "Hackers are trying to steal passwords and sensitive data from users of Signal clone",
    "slug": "hackers-are-trying-to-steal-passwords-and-sensitive-data-from-users-of-signal-clone",
    "link": "https://techcrunch.com/2025/07/17/hackers-are-trying-to-steal-passwords-and-sensitive-data-from-users-of-signal-clone/",
    "published": "2025-07-17 15:42",
    "image": "https://images.unsplash.com/photo-1702719796570-1693c8777a1d?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzZW5zaXRpdmUlMjBkYXRhJTIwJTJDJUUyJTgwJTlEJTIwcGVyJTIwZ3JleW5vaXNlfGVufDB8fHx8MTc1Mjc2NzEwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The bug in the modified messaging app can expose users' “plaintext usernames, passwords, and other sensitive data,” per GreyNoise.",
    "full_text": "Hackers are targeting a previously reported bug in the Signal clone app TeleMessage in an effort to steal users’ private data, according to security researchers and a U.S. government agency. TeleMessage, which earlier this year was revealed to be used by high-ranking officials in the Trump administration, already experienced at least one data breach in May. “I was left in disbelief at the simplicity of this exploit,” GreyNoise researcher Howdy Fisher wrote in a post analyzing the flaw. “[A]fter some digging, I found that many devices are still open and vulnerable to this.” Contact Us Do you have more information about these attacks? We’d love to hear from you. In early July, U.S. cybersecurity agency CISA listed the flaw — designated officially as CVE-2025-48927 — to its catalog of Known Exploited Vulnerabilities, a database that collects security bugs that are known to have been exploited by hackers. In other words, CISA says hackers are successfully exploiting this bug. Waltz had previously added a journalist to a highly sensitive group chat with other Trump administration officials, where the group discussed plans to bomb Yemen, an operational security snafu that caused a scandal leading to Waltz’s ousting. TeleMessage did not immediately respond to a request for comment."
  },
  {
    "title": "Boulevard raises $80M to power self-care boom driven by Botox and GLP-1 surge",
    "slug": "boulevard-raises-80m-to-power-self-care-boom-driven-by-botox-and-glp-1-surge",
    "link": "https://techcrunch.com/2025/07/17/boulevard-raises-80m-to-power-self-care-boom-driven-by-botox-and-glp-1-surge/",
    "published": "2025-07-17 15:29",
    "image": "https://images.unsplash.com/photo-1739785891796-7fd9028e1930?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxidXJnZW9uaW5nJTIwbmV3JTIwY2xpZW50JTIwc2VnbWVudHxlbnwwfHx8fDE3NTI3NzQzMDd8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Boulevard's revenue soared over 500% in the last three years, partly driven by a burgeoning new client segment: med spas. The company estimates that it is powering approximately 15% of all medspas in the U.S.",
    "full_text": "The duo couldn’t understand why salons still made clients call to make appointments. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Boulevard’s revenue soared over 500% in the last three years, partly driven by a burgeoning new client segment: medspas. Danna, who serves as Boulevard’s CEO, said he was first surprised that medspa owners were interested in using the company’s software instead of electronic medical records systems (EMRs). He discovered that EMRs are better suited for clients billing insurance, whereas medspas predominantly run on a cash-pay model. Three years after introducing these features, Boulevard estimates that it is powering approximately 15% of all medspas in the U.S. “I am really impressed by how beauty and medical services lines are blurring,” Danna said."
  },
  {
    "title": "Zuckerberg and Meta investors reach settlement in $8B privacy case",
    "slug": "zuckerberg-and-meta-investors-reach-settlement-in-8b-privacy-case",
    "link": "https://techcrunch.com/2025/07/17/zuckerberg-and-meta-investors-reach-settlement-in-8b-privacy-case/",
    "published": "2025-07-17 15:25",
    "image": "https://images.unsplash.com/photo-1549813069-f95e44d7f498?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsYXdzdWl0JTIwYWxsZWdlcyUyMGZhY2Vib29rJTIwZXhlY3MlMjBpbnRlbnRpb25hbGx5JTIwdmlvbGF0ZWR8ZW58MHx8fHwxNzUyNzY2MjA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The shareholders' lawsuit alleges Facebook execs intentionally violated an FTC agreement by sharing user data with third-party apps without user consent.",
    "full_text": "In Brief Mark Zuckerberg and other current and former Meta executives have settled a lawsuit filed by a group of shareholders, who were seeking $8 billion for the damage the executives caused the company by allowing repeated violations of Facebook users’ privacy in relation to the Cambridge Analytica scandal. The parties did not disclose details of the settlement, according to Reuters. Facebook shareholders filed a lawsuit against Mark Zuckerberg, former COO Sheryl Sandberg, and other executives, alleging they intentionally violated a Federal Trade Commission agreement by sharing user data with third-party apps without user consent. The FTC fined Facebook $5 billion in 2019 for failing to comply with a 2012 agreement requiring the company to protect users’ personal data. The trial was expected to feature testimonies from Zuckerberg, Sandberg, Peter Thiel, Marc Andreessen, and Netflix CEO Reed Hastings."
  },
  {
    "title": "Mistral’s Le Chat chatbot gets a productivity push with new ‘deep research’ mode",
    "slug": "mistrals-le-chat-chatbot-gets-a-productivity-push-with-new-deep-research-mode",
    "link": "https://techcrunch.com/2025/07/17/mistrals-le-chat-chatbot-gets-a-productivity-push-with-new-deep-research-mode/",
    "published": "2025-07-17 15:21",
    "image": "https://images.unsplash.com/photo-1568484884096-74f34caf4af9?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwlRTIlODAlOUMlMjBkZWVwJTIwcmVzZWFyY2glMjAlRTIlODAlOUQlMjBtb2RlfGVufDB8fHx8MTc1Mjc3MzQwOHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "French AI lab Mistral introduced a range of new features to its Le Chat chatbot on Thursday that bring it closer to the capabilities of rivals like OpenAI and Google. The new update includes a “deep research” mode, native multilingual reasoning, and advanced image editing.",
    "full_text": "French AI lab Mistral introduced a range of new features to its Le Chat chatbot on Thursday that bring it closer to the capabilities of rivals like OpenAI and Google. “We believe this feature is going to be very relevant for both consumer and enterprise use cases. That’s in large part because Mistral handles data connectors differently than competitors. It also opens the door for Mistral to offer other productivity tools. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Aside from deep reasoning, Le Chat has gotten other updates today. While users have been able to use Le Chat to reason through complex questions via Magistral, Mistral’s new reasoning AI model, that capability was previously only available in English."
  },
  {
    "title": "Confident Security, ‘the Signal for AI,’ comes out of stealth with $4.2M",
    "slug": "confident-security-the-signal-for-ai-comes-out-of-stealth-with-4-2m",
    "link": "https://techcrunch.com/2025/07/17/confident-security-the-signal-for-ai-comes-out-of-stealth-with-4-2m/",
    "published": "2025-07-17 15:00",
    "image": "https://images.unsplash.com/photo-1740908900906-a51032597559?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxiYXNlZCUyMHN0YXJ0dXAlMjBjb25maWRlbnQlMjBzZWN1cml0eSUyMHdhbnRzfGVufDB8fHx8MTc1Mjc2NTMwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "San Francisco-based startup Confident Security wants to be “the Signal for AI.\" The company just came out of stealth with $4.2 million and a tool that wraps around AI models to guarantee data stays private.",
    "full_text": "For highly regulated industries or companies building on the frontier, that gray area could be a dealbreaker. “And our product’s goal is to remove that trade-off.” CONFSEC is modeled after Apple’s Private Cloud Compute (PCC) architecture, which Mortensen says “is 10x better than anything out there in terms of guaranteeing that Apple cannot see your data” when it runs certain AI tasks securely in the cloud. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Like Apple’s PCC, Confident Security’s system works by first anonymizing data by encrypting and routing it through services like Cloudflare or Fastly, so servers never see the original source or content. Next, it uses advanced encryption that only allows decryption under strict conditions. “Without solutions like this, many enterprises simply can’t move forward with AI.”"
  },
  {
    "title": "North Korean hackers blamed for record spike in crypto thefts in 2025",
    "slug": "north-korean-hackers-blamed-for-record-spike-in-crypto-thefts-in-2025",
    "link": "https://techcrunch.com/2025/07/17/north-korean-hackers-blamed-for-record-spike-in-crypto-thefts-in-2025/",
    "published": "2025-07-17 14:51",
    "image": "https://images.unsplash.com/photo-1627454773517-d81acb7f8908?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjaGFpbmFseXNpcyUyMHNhaWQlMjBjcnlwdG8lMjB0aGVmdHN8ZW58MHx8fHwxNzUyNzY0NDAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Chainalysis said crypto thefts during the first half of 2025 were at record levels, thanks in large part to a single breach at a major crypto exchange.",
    "full_text": "Hackers have stolen more than $2 billion in crypto during the first half of 2025, according to new data from crypto analysis firm Chainalysis, marking the worst year-to-date on record for crypto thefts. The blockchain analysis company said Thursday in a new report that the $2.17 billion stolen during the first half of 2025 has already surpassed the amount of crypto lost last year. Not only that, the amount of cryptocurrency stolen during the first six months of 2025 was about 17% higher than the same period in 2022, which was previously the worst year on record for stolen crypto. Much of the stolen crypto this year was attributed to a single breach at crypto exchange Bybit, which saw North Korean hackers steal more than $1.4 billion in crypto, much of it subsequently laundered and funneled into the North Korean regime, per the FBI. Chainalysis said the Bybit hack falls within a broader pattern of North Korean hacks, which have “become increasingly central to the regime’s sanctions evasion strategies.” North Korea, largely cut off from the outside world and the international banking system, has become a formidable threat in recent years by targeting Western companies to steal cryptocurrency with the aim of funding its sanctioned nuclear weapons program. North Korea has also relied on thousands of remote IT workers, who infiltrate tech companies to earn a wage, steal intellectual property, and then extort companies into paying so as not to publish their sensitive files. According to an earlier Chainalysis report, North Korean hackers were blamed for almost two-thirds of all crypto hacks during 2024."
  },
  {
    "title": "Spotify expands audiobook access to family plan members for the first time",
    "slug": "spotify-expands-audiobook-access-to-family-plan-members-for-the-first-time",
    "link": "https://techcrunch.com/2025/07/17/spotify-expands-audiobook-access-to-family-plan-members-for-the-first-time/",
    "published": "2025-07-17 14:35",
    "image": "https://images.unsplash.com/photo-1654931799020-ce7cf3f4a2c7?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0d28lMjBuZXclMjBwbGFuc3xlbnwwfHx8fDE3NTI3NjM1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Spotify is expanding access to audiobooks with two new plans, one of which offers access to family members.",
    "full_text": "Spotify on Thursday announced an expansion of its premium audiobooks service, with two new plans that offer additional listening hours to subscribers, and allow other family members to access the service. U.S. users could already purchase 15 hours of listening as a standalone offering through an Audiobooks Access Plan, but these additions make it possible for those in other markets to customize their access to their own needs. Today, Spotify’s Premium plans include 15 hours of audiobook listening, so this new plan doubles that offering, ensuring subscribers can get through longer books or even a couple of shorter ones in the month. The other new plan, Audiobooks+ for Plan Members, will be an even more welcome addition for those who want to share access to audiobooks: Members on Premium Family and Duo plans will be able to access 15 hours of monthly audiobook listening, too. Similar plans will arrive later in the U.S., Spotify told TechCrunch. To use the feature, plan members will first request audiobook access from their plan manager, who purchases the new add-on. A spokesperson said that users in those markets can visit the Spotify.com/audiobooks page to learn more. One major publisher, HarperCollins, noted in December that Spotify was working to bring audiobooks to other family members on shared plans. At a conference, HarperCollins CEO Brian Murray said that the market had potential for further growth as Spotify was at the time working out a “technical issue” with family plans that limited audiobooks to the plan’s credit card holder. The streaming service sees AI as another opportunity for expansion, saying in last quarter’s earnings that it was working with ElevenLabs to get more books narrated, including translating texts from English to other languages."
  },
  {
    "title": "UAE’s deal to buy Nvidia AI chips reportedly on hold",
    "slug": "uaes-deal-to-buy-nvidia-ai-chips-reportedly-on-hold",
    "link": "https://techcrunch.com/2025/07/17/uaes-deal-to-buy-nvidia-ai-chips-reportedly-on-hold/",
    "published": "2025-07-17 13:37",
    "image": "https://images.unsplash.com/photo-1748765968997-ba9bae9cfd7b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhaSUyMGNoaXBzJTIwY291bGR8ZW58MHx8fHwxNzUyNzU5OTA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The U.S. is reportedly holding up the deal due to concerns that AI chips could be smuggled to China from the UAE.",
    "full_text": "In Brief The massive AI deal between the U.S. and the United Arab Emirates (UAE) is reportedly on hold before it can be finalized due to national security reasons. The deal, which gives the green light to the UAE to buy billions of dollars’ worth of AI chips from Nvidia and other semiconductor companies, is on hold due to concerns in the U.S. that these AI chips could end up in China, The Wall Street Journal reported, citing anonymous sources. This potential chip smuggling was a concern when the deal was initially formed, according to The Wall Street Journal, but officials from the UAE and Saudi Arabia assured the U.S. they had safeguards in place. Smuggling chips to China has become more of a concern in recent months. The Trump administration is rumored to be considering imposing chip export restrictions on Thailand and Malaysia as well to curb potential smuggling. Malaysia on Monday introduced an export permit requirement for U.S. AI chips."
  },
  {
    "title": "Uber makes multimillion-dollar investment in Lucid and Nuro to build a premium robotaxi service",
    "slug": "uber-makes-multimillion-dollar-investment-in-lucid-and-nuro-to-build-a-premium-robotaxi-service",
    "link": "https://techcrunch.com/2025/07/17/uber-makes-multi-million-dollar-investment-in-lucid-nuro-to-build-robotaxi-service/",
    "published": "2025-07-17 12:31",
    "image": "https://images.unsplash.com/photo-1587523382748-3df45689ed98?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhdXRvbm9tb3VzJTIwdmVoaWNsZSUyMHRlY2hub2xvZ3klMjBzdGFydHVwJTIwbnVyb3xlbnwwfHx8fDE3NTI3NTYzMDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Uber is investing hundreds of millions of dollars into  Lucid and autonomous vehicle technology startup Nuro in a bid to launch its own robotaxi service.",
    "full_text": "Uber is also investing an undisclosed “multi-hundred-million dollar” amount into Nuro. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Ferguson said engineers at Lucid and Nuro have already made progress on the project. The companies offer a “Waymo on Uber” service in Austin and Atlanta. The agreement is also validation for Nuro, which has raised more than $2 billion from high-profile investors since it was founded in 2016. Last year, Nuro pivoted its business strategy to focus more on the startup’s core autonomous driving technology. But the company still needed a licensing deal to prove its shift."
  },
  {
    "title": "Lovable becomes a unicorn with $200M Series A just 8 months after launch",
    "slug": "lovable-becomes-a-unicorn-with-200m-series-a-just-8-months-after-launch",
    "link": "https://techcrunch.com/2025/07/17/lovable-becomes-a-unicorn-with-200m-series-a-just-8-months-after-launch/",
    "published": "2025-07-17 12:11",
    "image": "https://images.unsplash.com/photo-1501102057089-b3e50a55eff6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHw4JTIwYmlsbGlvbiUyMHZhbHVhdGlvbnxlbnwwfHx8fDE3NTI3NTQ1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Only eight months after its launch, Sweden's Lovable has raised a $200 million Series A round led by Accel at a $1.8 billion valuation.",
    "full_text": "Fast-growing Swedish AI vibe coding startup Lovable has become Europe’s latest unicorn. In February, Creandum led a $15 million pre-series A round in the company, which at the time said it had reached annual recurring revenue of $17 million and had 30,000 paying customers, with “just $2 million spent.“ The startup has managed this hockey-stick growth with a pretty sparse team of only 45 full-time employees. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “Every day, brilliant founders and operators with game-changing ideas hit the same wall: they don’t have a developer to realize their vision quickly and easily,” Osika said in a statement. Notably, Osika recently said on X that he is now an angel investor in a software startup that was ostensibly built with Lovable. Osika also celebrated that an app made by a large Brazilian edtech company using Lovable had grossed $3 million in 48 hours."
  }
]