[
  {
    "title": "What&#8217;s a smut peddler to do these days?",
    "slug": "what-s-a-smut-peddler-to-do-these-days",
    "link": "https://www.theverge.com/report/756841/itchio-adult-content-creator-backlash-steam-paypal",
    "published": "2025-08-09 08:00",
    "image": "https://images.unsplash.com/photo-1615229334042-6d97a6a2a347?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsZWZ0JTIwZmVlbGluZyUyMGJldHJheWVkfGVufDB8fHx8MTc1NDc0MTcxMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "In the aftermath of itch.io pulling the sale of over 20,000 pages of adult content, the creators of that work are left feeling betrayed, exhausted, and fearful. The number of platforms that permit the sale of adult material is shrinking, and there's no guarantee the ones that remain will still permit it in the future. […]",
    "full_text": "“This time around, we’re actually doing something about it.” Others have decided to abandon the fickleness of platforms for their own websites. The storefront is one of several in recent years that have embraced adult content only to shun it later when payment processors start asking questions. “This time around, we’re actually doing something about it.” In the UK, where PixelJail lives, the recently implemented Online Safety Act requires that online platforms have “strong age checks” in place to prevent children from accessing pornographic or “harmful” content. “I made my site years ago and didn’t use it much at first,” PixelJail said. When porn creators move from one platform to another they bring their communities with them creating an influx of traffic that would please any website. While all payment processors have guidelines prohibiting the sale of illegal material, many host platforms overcorrect, banning material that would ostensibly be permitted in order to avoid the increased scrutiny (and cost) hosting that content requires. “There are a lot of intense visuals in VILE: Exhumed,” Cara Cadaver wrote. There has virtually never been a stable time to be an adult creator on the internet."
  },
  {
    "title": "Struggling to Rest on Your Period? These Sleep Hacks May Help",
    "slug": "struggling-to-rest-on-your-period-these-sleep-hacks-may-help",
    "link": "https://www.cnet.com/health/sleep/struggling-rest-on-period-sleep-hacks-may-help/#ftag=CAD590a51e",
    "published": "2025-08-09 11:25",
    "image": "https://www.cnet.com/a/img/resize/746cbf3cdee6683da8747aa575835a3ac6391e3f/hub/2024/10/11/de616191-8e49-436f-ae72-15d56b7b194c/gettyimages-2163779387.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "If period cramps and pain are keeping you awake at night, try these simple tips for relief and shut-eye.",
    "full_text": "Period pain can make it difficult for you to fall and stay asleep. These hormones peak around the time you ovulate but drop drastically right before menstruate. Since this naturally occurring hormone is key to falling and staying asleep, a deficit could keep you up at night. Side sleepers may benefit from a heating pad that can be secured around their body with velcro. Both protein and complex carbs can help you avoid disturbed sleep during your period. Protein releases tryptophan, an amino acid that helps your body generate both melatonin and serotonin. Relaxing your muscles before bed can help you drift off to sleep more easily. Remaining mindful of your temperature, diet habits and hydration may help. New tech like the Oura Ring may also help you better understand your cycle and temperature changes. If you experience severe period pain that can't be mitigated by at-home tips, talk with your doctor."
  },
  {
    "title": "How to Watch Leeds United vs. Milan From Anywhere: Stream Preseason Friendly Soccer",
    "slug": "how-to-watch-leeds-united-vs-milan-from-anywhere-stream-preseason-friendly-soccer",
    "link": "https://www.cnet.com/tech/services-and-software/how-to-watch-leeds-united-vs-milan-from-anywhere-stream-preseason-friendly-soccer/#ftag=CAD590a51e",
    "published": "2025-08-09 11:00",
    "image": "https://www.cnet.com/a/img/resize/10582e1275246a8c4ea23be5945bcf0f74c39de5/hub/2025/08/09/c1808efb-c275-4ecf-a837-e1183b846188/gettyimages-2225168885.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The Peacocks continue their build up to the new Premier League season with a friendly clash in Dublin against the Italian giants.",
    "full_text": "Having won the EFL Championship last season, Leeds appear to have carried forth that momentum with Daniel Farke's men currently unbeaten in preseason. That means you'll also be able to watch the game online via streaming platform Paramount Plus. It can also be helpful when connecting to public Wi-Fi networks while traveling, adding an extra layer of protection for your devices and logins. However, some streaming services may have policies restricting VPN use to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. It's normally $13 a month, but if you sign up for an annual subscription for $100, you'll get three months free and save 49%. 61% off with 2yr plan (+4 free months) See at Go.expressvpn You can also get Premier Sports through Amazon Prime Video as an add-on for £15 a month. Alternatively you can watch the match live on Leeds' dedicated in-house streaming service, LUTV. However, you can stream the game live via Leeds' own in-house service LUTV."
  },
  {
    "title": "Should You Buy an iPhone 16 or Wait for the iPhone 17?",
    "slug": "should-you-buy-an-iphone-16-or-wait-for-the-iphone-17",
    "link": "https://www.cnet.com/tech/mobile/should-you-buy-an-iphone-16-or-wait-for-the-iphone-17/#ftag=CAD590a51e",
    "published": "2025-08-09 10:45",
    "image": "https://www.cnet.com/a/img/resize/f20c1582880ae8ed1334313b8d6f11b57b682818/hub/2024/09/13/bd1c03e1-4002-4cc3-b05e-e7f5912b5bf3/apple-iphone-16-3086.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Apple will likely unveil its next phone in September. Here's what to expect.",
    "full_text": "It took everything in me not to chime in with, \"Are you sure you don't want to wait and see what Apple has planned for the iPhone 17?\" But I'm going to focus on the baseline iPhone 17. There's been some back-and-forth on whether the iPhone 17 will have a scratch-resistant, antireflective display. So there may not be major discrepancies between the iPhone 16 and 17 on that front. Megapixels aren't the only determining factor for good-quality photos but if it is an upgrade, that could make taking selfies or shooting videos for social media on the front-facing camera less of a compromise. One key element that could remain unchanged across both phones is the processor. In April, analyst Ming-Chi Kuo said the iPhone 17 Air and Pro models would sport 12GB of RAM but that Apple was still deciding whether to equip the baseline model with that higher amount too. In May, analyst Jeff Pu noted the baseline would remain at 8GB. That should help to stretch your battery life on either device. So any shiny new capabilities will likely land on its more premium phones first, such as the rumored antireflective display and redesigned cameras on the iPhone 17 Pro models."
  },
  {
    "title": "You Can Turn Your Pet Pictures Into Emoji on Your iPhone. Here's How",
    "slug": "you-can-turn-your-pet-pictures-into-emoji-on-your-iphone-here-s-how",
    "link": "https://www.cnet.com/tech/mobile/you-can-turn-your-pet-pictures-into-emoji-on-your-iphone-heres-how/#ftag=CAD590a51e",
    "published": "2025-08-09 10:00",
    "image": "https://www.cnet.com/a/img/resize/b41131630062d5bbe093bf491547814feea47b8c/hub/2025/08/08/29b46799-ec2a-45c3-8ecd-75cbc117211f/screenshot-2025-08-08-at-9-27-35am.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Your pets deserve their own emoji, on top of all the belly rubs and scritches they want.",
    "full_text": "I love my dog, Cinnamon Toast Crunch. With an iPhone feature called Live Stickers, I can turn photos of her into emoji and stickers, and then text them to others. Apple introduced Live Stickers in iOS 17 as an evolution of the tap-and-lift feature from iOS 16, which lets you cut out subjects from photos and Live Photos. Tap the photo you want to turn into an emoji or sticker. Make sure you select the folded-over circle (selected above) to view your new emoji. If you tap the new sticker, you'll be given the options to Rearrange, Add Effect or Delete it. Tapping Add Effect will let you add an effect to your sticker, like a white outline, to make it look even more like a sticker. I tried to use my Live Stickers on the messaging app Slack, but they wouldn't appear in the app. I also couldn't access my Live Stickers in some third-party apps, like TikTok, so you might run into some issues when using your Live Stickers outside of Apple apps and devices. For more on iOS, here are my first impressions of the iOS 26 beta, how to enable call screening in the beta and all the other new features Apple said that update will bring to your device later this year."
  },
  {
    "title": "Today's NYT Connections: Sports Edition Hints and Answers for Aug. 9, #320",
    "slug": "today-s-nyt-connections-sports-edition-hints-and-answers-for-aug-9-320",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-sports-edition-hints-and-answers-for-aug-9-320/#ftag=CAD590a51e",
    "published": "2025-08-09 09:00",
    "image": "https://www.cnet.com/a/img/resize/c7e1d294a1a554f051860c8dddd6fd0c6527b452/hub/2024/10/16/c34cfc41-01f2-4b1a-80a8-f6479c50c02e/connections-sports-edition-6859.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answers for the NYT Connections: Sports Edition puzzle for Aug. 9, No. 320",
    "full_text": "Looking for the most recent regular Connections answers? Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle and Strands puzzles. Growing up in Minnesota surrounded by ice hockey, I was able to nail the green group, but I didn't do so well otherwise. Or you can continue to play it free online. Hints for today's Connections: Sports Edition groups What are today's Connections: Sports Edition answers? #1: Don't grab for the easiest group. For each word, think about other sports categories it might fit in – is this a word that can be used in football, or to describe scoring options? #3: And the opposite is also true. Words like HURTS might seem like a regular word, but it's also the last name of at least one pro athlete."
  },
  {
    "title": "Today's NYT Strands Hints, Answers and Help for Aug. 9, #524",
    "slug": "today-s-nyt-strands-hints-answers-and-help-for-aug-9-524",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-strands-hints-answers-and-help-for-aug-9-524/#ftag=CAD590a51e",
    "published": "2025-08-09 09:00",
    "image": "https://www.cnet.com/a/img/resize/166e67238a28ef7d82e62fe8aec7185a7cc23eda/hub/2024/05/15/859c9110-e596-432b-8690-95e6102759c9/nyt-new-york-times-strands-2054.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and answers for the NYT Strands puzzle for Aug. 9, No. 524.",
    "full_text": "Julia Child wannabes, today's NYT Strands puzzle is for you. If you need hints and answers, read on. I go into depth about the rules for Strands in this story. If you're looking for today's Wordle, Connections and Mini Crossword answers, you can visit CNET's NYT puzzle hints page. If that doesn't help you, here's a clue: Stock your kitchen. Your goal is to find hidden words that fit the puzzle's theme. When you have all of them (I originally thought there were always eight but learned that the number can vary), every letter on the board will be used. The completed NYT Strands puzzle for Aug. 9, 2025. Maybe you didn't even use this lingo when it was cool. #3: Off the hook, Jan. 9."
  },
  {
    "title": "Today's NYT Connections Hints, Answers and Help for Aug. 9, #790",
    "slug": "today-s-nyt-connections-hints-answers-and-help-for-aug-9-790",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-hints-answers-and-help-for-aug-9-790/#ftag=CAD590a51e",
    "published": "2025-08-09 09:00",
    "image": "https://www.cnet.com/a/img/resize/3986ca4ac5b498c6114118e0dfa25b2a05ae6531/hub/2025/03/26/c70b0a32-884a-4379-b77b-de75776952ba/nyt-word-games-connections-2798.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are some hints and the answers for the NYT Connections puzzle for Aug. 9, #790.",
    "full_text": "Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle, Connections: Sports Edition and Strands puzzles. Today's NYT Connections puzzle is a fun mix. Read on for clues and today's Connections answers. Go there after you play to receive a numeric score and have the program analyze your answers. Read more: Hints, Tips and Strategies to Help You Win at NYT Connections Every Time Here are four hints for today's Connections puzzle groupings, ranked from the easiest yellow group to the tough (and sometimes bizarre) purple group. Green group hint: Riddles are another type. Purple group hint: Often on the cob. The completed NYT Connections puzzle for Aug. 9, 2025. Maybe they'll help you see patterns in future puzzles."
  },
  {
    "title": "Today's Wordle Hints, Answer and Help for Aug. 9, #1512",
    "slug": "today-s-wordle-hints-answer-and-help-for-aug-9-1512",
    "link": "https://www.cnet.com/tech/gaming/todays-wordle-hints-answer-and-help-for-aug-9-1512/#ftag=CAD590a51e",
    "published": "2025-08-09 09:00",
    "image": "https://www.cnet.com/a/img/resize/837b400de41f50a97b52a8c799b193be01cea440/hub/2024/05/28/20480816-214e-4fcc-a9b4-b02f0ac71e7c/wordle-word-game-hints-puzzle-8667.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are some hints and the answer for today's Wordle for Aug. 9, No. 1,512.",
    "full_text": "Click here for today's Wordle hints, as well as our daily answers and hints for The New York Times Mini Crossword, Connections, Connections: Sports Edition and Strands puzzles. Today's Wordle puzzle is kind of medium. The letters are fairly common, but I didn't immediately figure it out once I had a couple letters guessed. If you need a new starter word, check out our list of which letters show up the most in English words. If you need hints and the answer, read on. If you don't want a spoiler, look away now. Today's Wordle answer has one repeated letter. Today's Wordle answer has one vowel, but it's the repeated letter, so you will see it twice. Today's Wordle answer can refer to an annoying voice. Today's Wordle answer means something related to the nose."
  },
  {
    "title": "How to Watch Man United vs. Fiorentina From Anywhere: Stream Preseason Friendly Soccer",
    "slug": "how-to-watch-man-united-vs-fiorentina-from-anywhere-stream-preseason-friendly-soccer",
    "link": "https://www.cnet.com/tech/services-and-software/how-to-watch-man-united-vs-fiorentina-from-anywhere-stream-preseason-friendly-soccer/#ftag=CAD590a51e",
    "published": "2025-08-09 08:45",
    "image": "https://www.cnet.com/a/img/resize/a21852a00063a7feb924dbbe6ed1f25e5245be70/hub/2025/08/08/e0020614-07e4-42bc-ad7b-2abc616ea698/gettyimages-2227980523.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The Red Devils return to Old Trafford for their final warm-up match before the new EPL season.",
    "full_text": "We'll also explain how to use a VPN if the match isn't available where you are. Ruben Amorim's team has had an encouraging couple of weeks, with three wins from three against EPL rivals West Ham, Bournemouth and Everton at the recent Summer Series tournament in the US. Big new signings Bryan Mbeumo and Matheus Cunha look set to be augmented by the addition of highly rated RB Leipzig forward Benjamin Šeško, who could be unveiled before kickoff today. While this game is not set to be televised on mainstream TV channels in these regions, Manchester United's in-house streaming service will be showing the game live to subscribers. It can also be helpful when connecting to public Wi-Fi networks while traveling, adding an extra layer of protection for your devices and logins. However, some streaming services may have policies restricting VPN use to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. James Martin/CNET ExpressVPN Best VPN for streaming Price $13 per month, $100 for the first 15 months (then $117 per year) or $140 for the first 28 months (then $150 per year) Latest Tests No DNS leaks detected, 18% speed loss in 2025 tests Network 3,000 plus servers in 105 countries Jurisdiction British Virgin Islands ExpressVPN is our current best VPN pick for people who want a reliable and safe VPN that works on a variety of devices. It's normally $13 a month, but if you sign up for an annual subscription for $100, you'll get three months free and save 49%. 61% off with 2yr plan (+4 free months) See at ExpressVPN"
  },
  {
    "title": "EFL Championship Soccer: Stream Southampton vs. Wrexham Live From Anywhere",
    "slug": "efl-championship-soccer-stream-southampton-vs-wrexham-live-from-anywhere",
    "link": "https://www.cnet.com/tech/services-and-software/efl-championship-soccer-stream-southampton-vs-wrexham-live-from-anywhere/#ftag=CAD590a51e",
    "published": "2025-08-09 08:30",
    "image": "https://www.cnet.com/a/img/resize/6962d4551eb5dabfedf284b06a52c3c078ec93b7/hub/2025/08/08/7437fc51-223e-4c63-aa20-2777ee46c986/gettyimages-2224813446.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The relegated Saints face the Hollywood-backed Red Dragons.",
    "full_text": "Manager Phil Parkinson is now eyeing the ultimate prize — a place in the Premier League — and has brought in a number of big-name additions to his squad, including former England defender Conor Coady and Wales striker Kieffer Moore. Young forward Jay Robinson looks set to be a player to watch out for in the Championship this term, having been a standout performer for Southampton in preseason. American soccer fans can stream this fixture on CBS Sports Golazo via Paramount Plus, which has exclusive live English-language broadcast rights in the US for the EFL Championship this season. If you're traveling abroad and want to keep up with all the EFL Championship action while away from home, a VPN can help enhance your privacy and security when streaming. However, some streaming services may have policies restricting VPN usage to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. James Martin/CNET ExpressVPN Best VPN for streaming Price $13 per month, $100 for the first 15 months (then $117 per year) or $140 for the first 28 months (then $150 per year) Latest Tests No DNS leaks detected, 18% speed loss in 2025 tests Network 3,000 plus servers in 105 countries Jurisdiction British Virgin Islands ExpressVPN is our current best VPN pick for people who want a reliable and safe VPN, and it works on a variety of devices. It's normally $13 a month, but if you sign up for an annual subscription for $100 you'll get three months free and save 49%. 61% off with 2yr plan (+4 free months) See at ExpressVPN If you already have Sky Sports as part of your TV package, you can stream the game via its Sky Go app, but cord-cutters will want to get set up with a Now account and a Now Sports membership to stream the game."
  },
  {
    "title": "Best Internet Providers in San Diego, California",
    "slug": "best-internet-providers-in-san-diego-california",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-san-diego-ca/#ftag=CAD590a51e",
    "published": "2025-08-09 04:49",
    "image": "https://www.cnet.com/a/img/resize/53a2fd528054eeb0f03e77c1922e1698868e5646/hub/2022/04/06/8288cc4c-f347-48d9-8e84-baf9145f0add/gettyimages-144643060.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "From top-end speeds to affordable connectivity, CNET's experts have shortlisted the best internet options in San Diego.",
    "full_text": "CNET' top pick for the best internet service provider in San Diego is AT&T Fiber. T-Mobile and Verizon 5G Home Internet stand out for affordability, especially if you bundle with an eligible mobile plan. But if you need the fastest speeds, AT&T Fiber's 2,000Mbps and 5,000Mbps plans are hard to beat. Ting's fast speeds and appealing rates make it well worth a look if you live in that region. The best internet deals and top promotions in San Diego depend on what discounts are available during that time. For a more extensive list of promotions, check out our guide on the best internet deals. (Disclosure: Ookla is owned by the same parent company as CNET, Ziff Davis.) ISP plans and prices are subject to frequent changes; all information provided is accurate as of publication. Along with smaller regional providers like Ting that service communities like Encinitas and Rancho Santa Fe, AT&T offers fiber internet to \"hundreds of thousands of households\" in San Diego, but it isn't available everywhere. The company's multi-gig plans are available at select addresses in San Diego, but that level of service is even more limited for now."
  },
  {
    "title": "Today's NYT Mini Crossword Answers for Saturday, Aug. 9",
    "slug": "today-s-nyt-mini-crossword-answers-for-saturday-aug-9",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-mini-crossword-answers-for-saturday-aug-9/#ftag=CAD590a51e",
    "published": "2025-08-09 02:41",
    "image": "https://www.cnet.com/a/img/resize/16d2290ea5c9dc928db9624c275de45ff920b828/hub/2024/07/25/50d61b9b-1c76-4678-9a92-f6eca531f4a8/nyt-mini-crossword-234876.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are the answers for The New York Times Mini Crossword for Aug. 9",
    "full_text": "Looking for the most recent Mini Crossword answer? Click here for today's Mini Crossword hints, as well as our daily answers and hints for The New York Times Wordle, Strands, Connections and Connections: Sports Edition puzzles. Today's Mini Crossword is the longest of the week, and it was a bit tough, too. Read more: Tips and Tricks for Solving The New York Times Mini Crossword Let's get to those Mini Crossword clues and answers. The completed NYT Mini Crossword puzzle for Aug. 9, 2025. 11A clue: \"We haven't decided yet,\" on schedules 3D clue: Deeply involve oneself (in) 6D clue: Kind of support for the lower back 13D clue: French soccer club that won its first Champions League title in 2025, for short"
  },
  {
    "title": "Impersonators are targeting companies with fake TechCrunch outreach",
    "slug": "impersonators-are-targeting-companies-with-fake-techcrunch-outreach",
    "link": "https://techcrunch.com/2025/08/08/impersonators-are-targeting-companies-with-fake-techcrunch-outreach/",
    "published": "2025-08-09 00:36",
    "image": "https://techcrunch.com/wp-content/uploads/2021/11/GettyImages-1095167058.jpg?resize=1200,955",
    "summary": "Hi, thanks as always for reading TechCrunch. We want to talk with you quickly about something important. We’ve discovered that scammers are impersonating TechCrunch reporters and event leads and reaching out to companies, pretending to be our staff when they absolutely are not. These bad actors are using our name and reputation to try to […]",
    "full_text": "We’ve discovered that scammers are impersonating TechCrunch reporters and event leads and reaching out to companies, pretending to be our staff when they absolutely are not. Here’s an example of the most common scheme we’ve been tracking: impostors impersonating our reporters to extract sensitive business information from unsuspecting targets. In several cases we know about, scammers have adopted the identity of actual staff members, crafting what looks like a standard media inquiry about a company’s products and requesting an introductory call. As for what to do about it, if someone reaches out claiming to be from TechCrunch and you have even the slightest doubt about whether they’re legitimate, please don’t just take their word for it. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. If you do see someone’s name on our staff page, but our employee’s job description doesn’t square with the request you are receiving (i.e., a TechCrunch copy editor is suddenly very interested in learning about your business! By being vigilant about verification, you’re not just protecting your own company — you’re helping preserve the trust that legitimate journalists depend on to do their jobs."
  },
  {
    "title": "Microsoft's Clippy Crocs Might Be the World's Weirdest Pair of Shoes",
    "slug": "microsoft-s-clippy-crocs-might-be-the-world-s-weirdest-pair-of-shoes",
    "link": "https://www.cnet.com/tech/services-and-software/microsofts-clippy-crocs-might-be-the-worlds-weirdest-pair-of-shoes/#ftag=CAD590a51e",
    "published": "2025-08-08 22:35",
    "image": "https://www.cnet.com/a/img/resize/5e0914c10d007988a7cf683f226eb80724db29bf/hub/2025/08/08/bc54581f-4d81-4e9c-8fe8-fc8c0989a078/crocs.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Hey, two of the world's worst inventions are joining forces. And for just $80, you can wear them.",
    "full_text": "Crocs are an infamously ugly shoe style that was once named to Time's list of the 50 worst inventions. Clippy is an annoying animated paperclip from Microsoft that once made that same list. So maybe it's fate that the two much-mocked products are teaming up for a pair of limited-edition Crocs the wearer can deck out with a smiling Clippy accessory. According to The Verge, the Crocs are part of Microsoft's celebration of its 50th anniversary, and are right now only available for preorder by Microsoft employees. They're expected to be available to regular folks at an undetermined date. A representative for Microsoft did not immediately respond to a request for comment. While I'm no Crocs fan, what I like about these is the calm, cloud-filled background that honors the famed Windows XP wallpaper of a green hill and cloudy sky, a photo taken by photographer Chuck O'Rear on the Napa-Sonoma county border back in 1996. Not sure, however, that I like the cloudy scene enough to fork over $80 for a pair of Crocs, even if they do come with a six-pack of shoe charms, including the infamous Clippy. The other charms include the original MSN logo, the Internet Explorer logo, a mouse pointer, a file folder and the computer recycling bin."
  },
  {
    "title": "Google Working on Fix for Glum Gemini, Stuck in 'Infinite Loop' of Self-Esteem Issues",
    "slug": "google-working-on-fix-for-glum-gemini-stuck-in-infinite-loop-of-self-esteem-issues",
    "link": "https://www.cnet.com/tech/services-and-software/google-working-on-fix-for-glum-gemini-stuck-in-infinite-loop-of-self-esteem-issues/#ftag=CAD590a51e",
    "published": "2025-08-08 21:49",
    "image": "https://www.cnet.com/a/img/resize/6a82a77eddd6aab60482e3d9ebf9d526a126e501/hub/2025/06/26/acf24691-3213-403a-a366-d6644d5479cd/cnet-gemini-ai-1456.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "One Google AI leader says Gemini's sad messages about itself are a glitch that the company plans to address.",
    "full_text": "The company's large language AI model, which is increasingly spreading across Google's many services and products, has been saying some things lately that are leading users to worry: Does Gemini have low self-esteem? \"Gemini is not OK,\" the X account @AISafetyMemes posted in June. Watch this: Google May Have Solved the Biggest Problem with Voice Assistants 06:07 An Aug. 7 post showed Gemini repeatedly writing, \"I am a failure. In April, OpenAI said it was tweaking ChatGPT to make it less sycophantic after users noticed the chatbot software was being a little too generous with its compliments. The models are prompt-engineered or fine-tuned toward a desired personality,\" Saha said. \"The challenge lies in making that persona consistent across millions of interactions while avoiding undesirable drift or glitches.\" It may seem funny but this can be dangerous if people are relying on AI assistants for their mental-health needs or are using these chatbots for education or customer service. Users should be aware of these limitations before they become too reliant on any AI service. As for Gemini's poor self image, let's hope the AI learns to practice a little self care -- or whatever passes for a spa day in computer code."
  },
  {
    "title": "I Built a Powerful Gaming PC Solely to Run AI Models. Here's Why",
    "slug": "i-built-a-powerful-gaming-pc-solely-to-run-ai-models-here-s-why",
    "link": "https://www.cnet.com/tech/services-and-software/i-built-a-powerful-gaming-pc-solely-to-run-ai-models-heres-why/#ftag=CAD590a51e",
    "published": "2025-08-08 21:08",
    "image": "https://www.cnet.com/a/img/resize/7948837a236e645ed35c1503ae5a3c03f67556ff/hub/2025/07/18/d287cbb2-38d0-49b4-91e7-b581d24b7d2e/ai-pc-build-thumb.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Local models come with a different set of advantages and drawbacks than their more connected versions.",
    "full_text": "In a booming market, there are a whole host of AI models out there, many of which don't even require an internet connection. Models that run without internet connections are called local AI models, and as the name suggests, they can be run on your own hardware. Would it have been possible to use a larger server motherboard that can handle much more RAM? But I doubt that's how most people would use AI at their homes or small businesses. I essentially opted for the equivalent of a powerful and compact gaming PC. 2x 1TB Crucial Gen5 NVMe solid-state drives ($150 each) At a total price of $4,240, this is an expensive rig. But to power some of these local AI models, you need horsepower. This includes OpenAI's new GPT-OSS, which is essentially a local version of ChatGPT. I believe that over time, the most powerful models will get more efficient."
  },
  {
    "title": "Sam Altman addresses ‘bumpy’ GPT-5 rollout, bringing 4o back, and the ‘chart crime’",
    "slug": "sam-altman-addresses-bumpy-gpt-5-rollout-bringing-4o-back-and-the-chart-crime",
    "link": "https://techcrunch.com/2025/08/08/sam-altman-addresses-bumpy-gpt-5-rollout-bringing-4o-back-and-the-chart-crime/",
    "published": "2025-08-08 21:06",
    "image": "https://images.unsplash.com/photo-1607215928867-f4d927e310ee?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxyZWRkaXQlMjBhbWElMjBnb3QlMjBzcGljeXxlbnwwfHx8fDE3NTQ2ODc3MDN8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The Reddit AMA got spicy as users peppered OpenAI with questions, and some asked the company to bring back its previous model.",
    "full_text": "During a Reddit ask-me-anything session on Friday, OpenAI CEO Sam Altman and key members of the GPT-5 team were peppered with questions about the new model and requests to bring back its previous model, GPT-4o. One of the new features that GPT-5 rolled out is a real-time router that decides which model to use for a particular prompt, either responding quickly or taking additional time to “think” through answers. We will make it more transparent about which model is answering a given query,” Altman promised. We are trying to gather more data on the tradeoffs,” he wrote. And Altman also promised, “We are going to double rate limits for Plus users as we finish rollout.” This should give people a chance to play and learn the new model, adopt it to their use cases without worry of running out of monthly prompts. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. GPT-5 reviewer Simon Willison, who had early access and generally liked the model’s performance, also pointed out that turning data into a table was “good example of a GPT-5 failure.”"
  },
  {
    "title": "Best Cordless Vacuums We've Tested (August 2025)",
    "slug": "best-cordless-vacuums-we-ve-tested-august-2025",
    "link": "https://www.cnet.com/home/kitchen-and-household/best-cordless-vacuum/#ftag=CAD590a51e",
    "published": "2025-08-08 21:00",
    "image": "https://www.cnet.com/a/img/resize/c564dd9766efe5fd2c5aad8b4ff249f75fd1635c/hub/2025/08/08/33e20985-e2c5-4d3d-8eda-cf82efe35a3e/image.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "CNET rigorously tested more than 50 cordless vacuums to find you the best performance and value for your money and we have some new picks we recommend.",
    "full_text": "CNET rigorously tested more than 50 cordless vacuums to find you the best performance and value for your money and we have some new picks we recommend."
  },
  {
    "title": "What to Stream This Weekend: 'Wednesday,' 'The Pickup,' 'Platonic' and More",
    "slug": "what-to-stream-this-weekend-wednesday-the-pickup-platonic-and-more",
    "link": "https://www.cnet.com/tech/services-and-software/what-to-stream-this-weekend-wednesday-the-pickup-platonic-and-more/#ftag=CAD590a51e",
    "published": "2025-08-08 20:00",
    "image": "https://www.cnet.com/a/img/resize/b833ef6137ba4db6a512b52ff48b5e433111fd2d/hub/2025/06/03/f1f1967d-ea91-46db-aaad-7dc7d91ae503/wednesday-season-2-jenna-ortega-netflix.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Don't miss the latest on Netflix, Apple TV Plus and other platforms. Here's what you should binge this weekend.",
    "full_text": "Our expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission. Reviews ethics statement What to Stream This Weekend: 'Wednesday,' 'The Pickup,' 'Platonic' and More Don't miss the latest on Netflix, Apple TV Plus and other platforms. Here's what you should binge this weekend."
  },
  {
    "title": "RIP, Microsoft Lens, a simple little app that’s getting replaced by AI",
    "slug": "rip-microsoft-lens-a-simple-little-app-thats-getting-replaced-by-ai",
    "link": "https://techcrunch.com/2025/08/08/rip-microsoft-lens-a-simple-little-app-thats-getting-replaced-by-ai/",
    "published": "2025-08-08 19:41",
    "image": "https://images.unsplash.com/photo-1623824204241-f851d3bcfaf5?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxoYW5keSUyMG1vYmlsZSUyMHNjYW5uaW5nJTIwYXBwfGVufDB8fHx8MTc1NDY4MjMwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Microsoft is killing Lens, a handy mobile scanning app with over 90 million downloads.",
    "full_text": "Now that app is being discontinued, Microsoft says, as it directs its users to its Copilot AI chat app instead. After that date, no new scans will be possible, but access to prior scans will remain in the app as long as it stays on the user’s device. First launched in 2015, Microsoft Lens (then known as Office Lens) evolved from an application originally designed for Windows Phone devices. While its core functionality was similar to other mobile scanning applications, it didn’t try to upcharge users for certain functionality or push them into a subscription — a rarity in today’s App Store. It also lacks Lens’ accessibility features like read-out-loud and Immersive Reader integration, the site notes. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Despite its age, Lens remains fairly popular, having pulled in over 322,000 downloads on the App Store and Google Play over the past 30 days, according to data from app intelligence provider Appfigures."
  },
  {
    "title": "ChatGPT is bringing back 4o as an option because people missed it",
    "slug": "chatgpt-is-bringing-back-4o-as-an-option-because-people-missed-it",
    "link": "https://www.theverge.com/news/756980/openai-chatgpt-users-mourn-gpt-5-4o",
    "published": "2025-08-08 15:30",
    "image": "https://images.unsplash.com/photo-1576553900855-eb7cbf707841?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxvcGVuYWklMjBjZW8lMjBzYW0lMjBhbHRtYW4lMjBjb25maXJtZWR8ZW58MHx8fHwxNzU0NjgyMzExfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "OpenAI is bringing back GPT-4o in ChatGPT just one day after replacing it with GPT-5. In a post on X, OpenAI CEO Sam Altman confirmed that the company will let paid users switch to GPT-4o after ChatGPT users mourned its replacement. “We will let Plus users choose to continue to use 4o,” Altman says. “We […]",
    "full_text": "OpenAI is bringing back GPT-4o in ChatGPT just one day after replacing it with GPT-5. For months, ChatGPT fans have been waiting for the launch of GPT-5, which OpenAI says comes with major improvements to writing and coding capabilities over its predecessors. But shortly after the flagship AI model launched, many users wanted to go back. “This morning I went to talk to it and instead of a little paragraph with an exclamation point, or being optimistic, it was literally one sentence. As part of GPT-5’s launch, OpenAI removed the model picker from ChatGPT. This dropdown menu previously housed a cluster of OpenAI’s confusingly-named models, allowing users to swap between them for different purposes. “Now it’s just gone, feels like someone died.” Another user called upon other members of the r/ChatGPT subreddit to contact OpenAI if they “miss” GPT-4o. People using ChatGPT for emotional support weren’t the only ones complaining about GPT-5. But many users on the r/ChatGPT subreddit said that the chatbot’s responses were slower, shorter, and less accurate when compared to previous versions. It’s not uncommon for chatbot updates to at least temporarily alienate users with their changes, or for people to mourn old models; one group of fans even recently held a funeral to mark the retirement of Anthropic’s Claude 3 Sonnet."
  },
  {
    "title": "The Aurora Borealis Is Back: These 18 States Have a Chance to See It Tonight",
    "slug": "the-aurora-borealis-is-back-these-18-states-have-a-chance-to-see-it-tonight",
    "link": "https://www.cnet.com/science/space/the-aurora-borealis-is-back-these-18-states-have-a-chance-to-see-it-tonight/#ftag=CAD590a51e",
    "published": "2025-08-08 19:30",
    "image": "https://www.cnet.com/a/img/resize/6d8725d88216157da0411ae6378cd6be9726b5e7/hub/2024/10/11/9a4c9284-9b8d-4670-973b-2d4560464650/richardpetersonaurora.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Prepare to get away from city lights if you want to see the colorful sky show.",
    "full_text": "Before those celestial events get underway, however, it seems that another sighting of the aurora borealis may be visible in up to 18 US states on Friday night. Those states can be broken up into three categories. The very northern reaches of Indiana and Ohio may see something, but it's unlikely. This week's aurora comes to Earth courtesy of an M-class solar flare that the sun ejected on Tuesday. It was one of several solar flares observed in what has been a very active week for the sun, but this particular M-class flare was pointed right at Earth when it erupted. According to NOAA, the best times to see the aurora has passed, as it was Thursday night into Friday morning. But Friday night into Saturday morning will also be a good time for the states bordering Canada. NOAA also recommends viewing between 10 p.m. and 2 a.m. local time, as that is generally when activity is at its zenith. Finally, if you can swing it, you'll want to get to an elevated position and look north for the best results. Since we are within a few days of a full moon, the moon's brightness may impact your ability to see things if you're at the southern reaches of this aurora."
  },
  {
    "title": "Get Ready to See Six Planets Line Up in the Upcoming Planet Parade",
    "slug": "get-ready-to-see-six-planets-line-up-in-the-upcoming-planet-parade",
    "link": "https://www.cnet.com/science/space/get-ready-for-the-next-planet-parade-this-month-heres-how-to-see-six-planets-at-once/#ftag=CAD590a51e",
    "published": "2025-08-08 19:27",
    "image": "https://www.cnet.com/a/img/resize/d349b12271fdb3651a796d5371eb6fae0230d9df/hub/2025/07/23/b7a340bf-50bb-4288-898b-088e2be4365f/august-2025-planet-parade.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "It's coming soon. Mark your calendar so you can catch Mercury, Venus, Jupiter, Saturn, Neptune and Uranus in the sky at the same time.",
    "full_text": "Even though they're spread out across the eastern and southern skies, the planets pair up with this one, making many of them pretty easy to find if you know what to look for. From east to west, here's where each one will be. Jupiter - Will be near Venus, also in the Gemini constellation. - Will be near Venus, also in the Gemini constellation. Uranus - Will be near the upper tip of Taurus, rising after midnight. - Will be near the upper tip of Taurus, rising after midnight. We recommend a telescope, but high-powered binoculars may work if the sky is dark enough. Saturn is also difficult to see without magnification, so you'll want it for that too. We also recommend taking a trip out to the country, as light pollution from suburbs and cities can make it even more difficult to see Neptune and Uranus. Other factors like weather may also make it more difficult to see all of them."
  },
  {
    "title": "See What Happens When You Fold the Samsung Galaxy Z Fold 7 200,000 Times",
    "slug": "see-what-happens-when-you-fold-the-samsung-galaxy-z-fold-7-200000-times",
    "link": "https://www.cnet.com/tech/mobile/see-what-happens-when-you-fold-and-unfold-the-samsung-galaxy-z-fold-7-200000-times/#ftag=CAD590a51e",
    "published": "2025-08-08 19:23",
    "image": "https://www.cnet.com/a/img/resize/c60ca7d40693d12227c13227d15adfd719238597/hub/2025/07/11/74a33fdc-b881-41f8-b92a-8d98e4cedd91/samsung-unpacked-2025-day-2-22.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "We're a little concerned about the \"unknown black liquid\" that leaked out of the phone's hinge when a YouTuber tested it.",
    "full_text": "After folding and unfolding the Samsung Galaxy Z Fold 7 200,000 times by hand, Korean YouTube channel Tech-it found that the folding phone's redesigned hinge and thinner design couldn't withstand repeated handling. At 46,000 folds, the phone started to creak. At 75,000 folds, an unknown black liquid started to leak out of the hinge. The findings were uploaded to a publicly available Google Doc. \"Machines apply consistent force, which doesn't reflect how people actually use foldable phones in their daily lives. Samsung advertises that the Z Fold 7 can withstand 500,000 folds. Samsung didn't immediately respond to a request for comment. \"One thing I learned from this project is that there can be a clear difference between lab test results and results from real-world scenarios,\" said ITchelin. \"I also realized that in any durability test, it's important to assess not only the hardware but also how the internal software behaves over time.\" Given that foldable phones have complex hinge designs and flexible displays, they are more prone to damage or failure than regular slab-style phones."
  },
  {
    "title": "My iPhone 17 Pro Wishlist Item Isn't a Feature: Give Me Colors Beyond Monochrome or Metal",
    "slug": "my-iphone-17-pro-wishlist-item-isn-t-a-feature-give-me-colors-beyond-monochrome-or-metal",
    "link": "https://www.cnet.com/tech/mobile/my-iphone-17-pro-wishlist-item-isnt-a-feature-give-me-colors-beyond-monochrome-or-metal/#ftag=CAD590a51e",
    "published": "2025-08-08 19:15",
    "image": "https://www.cnet.com/a/img/resize/b212fd71e3ed5fb589ac20e9356d481e81ca3d23/hub/2024/09/09/98412b9f-353c-4d99-9922-4f0787f4cbc9/screenshot-2024-09-09-at-11-15-28am.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Commentary: Apple's pro phones need to embrace colors beyond black, white, silver and gold.",
    "full_text": "So when I saw rumors that the iPhone 17 Pro could arrive in colors such as orange, I started dreaming about a world where Apple's best phones exude a sense of fun like their siblings. And yes, there are those of you out there who don't care what your phone looks like, because its colors will only briefly see the light of day before the handset is stuffed in its case to survive life's inevitable bounces and falls. So hearing that there's a potential Liquid Glass color coming to the iPhone 17 Pro that we expect to launch (as we do every year) in September, I got tentatively excited. Instead, the leaker suggested that (as translated by Google Translate) the iPhone 17 Pro color is expected to be white, but with a finish that shifts or changes subtly under different lighting conditions. Apple introduced its Liquid Glass update during WWDC 2025 in June, unveiling a new design strategy for the iPhone 17 Pro line that emphasizes translucence and rounded icons to give iOS 26 a fresh UI facelift. But how Liquid Glass's design looks as an iPhone color is a bit harder to fathom. Watch how it compares to the standard cream-colored ceramic white hue in this video from Sakitech. This bombastic choice sure was eye-catching but I'd guess it's too flamboyant for Apple. (And the beautiful glass back sure couldn't stand up to a fall.) But looking more closely at iPhone Pro designs from past years, I doubt we'll see anything as vivacious as those Samsung hues -- not only because Apple has avoided vibrant colors, but also because in recent years it's used a frosted rear glass that blurs and mutes the color beneath."
  },
  {
    "title": "Former Googlers’ AI startup OpenArt now creates ‘brain rot’ videos in just one click",
    "slug": "former-googlers-ai-startup-openart-now-creates-brain-rot-videos-in-just-one-click",
    "link": "https://techcrunch.com/2025/08/08/former-googlers-ai-startup-openart-now-creates-brainrot-videos-in-just-one-click/",
    "published": "2025-08-08 19:01",
    "image": "https://images.unsplash.com/photo-1582499520676-c432ca4c5596?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxoZWxwJTIwY3JlYXRvcnMlMjBtYWtlJTIwYWl8ZW58MHx8fHwxNzU0NjgwNTAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "OpenArt launched a new feature to help creators make AI-generated brain rot videos.",
    "full_text": "AI-generated “brain rot” videos are popping up all over the internet and getting a lot of attention. One startup driving this trend is OpenArt, founded by two former Google employees in 2022. Users can edit individual clips by revisiting the editor’s storyboard mode and tweaking prompts for a more refined result. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. One aspect that OpenArt believes sets it apart is its ability to maintain character consistency. The advanced plan costs $30 per month for 12,000 credits and includes up to 12 One-Click stories. Additionally, the company said it’s on track to achieve an annual revenue rate of over $20 million."
  },
  {
    "title": "Best Chemical Drain Cleaners of 2025: We Tested 8 to Find the Most Effective Against Your Toughest Clogs",
    "slug": "best-chemical-drain-cleaners-of-2025-we-tested-8-to-find-the-most-effective-against-your-toughest-clogs",
    "link": "https://www.cnet.com/news/best-chemical-drain-cleaners/#ftag=CAD590a51e",
    "published": "2025-08-08 19:00",
    "image": "https://www.cnet.com/a/img/resize/f09e5f67dad43d7f2f591643c4e421fe363db9cf/hub/2025/07/29/60923878-f8a1-40c0-856e-3f4298f92b22/image-1.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "From smelly drains to slow-draining sinks, we found the best chemical drain cleaners to help keep home's pipes clear.",
    "full_text": "In my experiment, I tested eight of the most commonly available chemical drain cleaners: six alkaline and two acidic. I performed dissolution tests to evaluate how well each of them could dissolve drain blockages. Before conducting experiments with these substances, I separated them into acids and bases. As you may recall from high school chemistry, acids are compounds that donate a hydrogen ion (H+) when mixed with water and have a pH lower than 7. Understanding this distinction is crucial, due to two important factors associated with these products: corrosivity and causticity. To determine the acidity or basicity of each compound, we measure their pH. Acidic drain cleaners, particularly those with high acid concentrations like sulfuric acid drain cleaners, are more hazardous compared with their basic or alkaline counterparts. See for yourself in the GIF below (and don't try this at home). For basic drain cleaners (pH > 7.0), I used 500 ml of hot water at 46 degrees C, while for acidic drain cleaners (pH < 7.0), I used 700 ml of cold water at 19 degrees C. Liquid and dissolved solids pass through 2mm holes in the Buchner funnel plate on the right -- anything that doesn't pass through is considered potential clog material."
  },
  {
    "title": "The best Android phones",
    "slug": "the-best-android-phones",
    "link": "https://www.theverge.com/23674658/best-android-phone",
    "published": "2025-08-08 14:50",
    "image": "https://images.unsplash.com/photo-1587749090881-1ea18126ab3a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhbmRyb2lkJTIwcGhvbmVzJTIwZXZlbiUyMGZvbGR8ZW58MHx8fHwxNzU0Njc5NjEwfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The Android ecosystem is all about choice. While iPhone owners have a smaller pool of new devices to pick from when it’s time to upgrade, there’s a wider range of choices on Android. Some Android phones even fold in half! Imagine. On the flip side, all that choice can make for some hard decisions. Here’s […]",
    "full_text": "The Pixel 9 series has some potentially useful features, like a Screenshots app that uses AI to tag relevant info in metadata, and Galaxy devices can translate a phone call for you in real time. Best not to put too much stock in any company’s AI claims just yet. A fast refresh rate of at least 120Hz is preferred — animations and scrolling look super smooth at that rate — and even better if it’s variable down to 1Hz to save on battery life. There’s a new Screenshots app that acts as a place to store all of the information that would otherwise be lost at sea in your camera roll, and it uses AI to parse information out and make it searchable. The Ultra looks and feels more like other Galaxy phones this time around, too. For us, there is but one option on Android: the Samsung Galaxy S25. Its dust and water resistance is so strong you could practically use the phone in a hurricane without consequences. If you’re thriftier with your charge, it could even go beyond that. No big deal; you can probably just charge it up on night two. The outer display’s reworked proportions make it feel like a normal slab-style phone."
  },
  {
    "title": "A decade later, Windows is still bringing Control Panel features to the Settings app",
    "slug": "a-decade-later-windows-is-still-bringing-control-panel-features-to-the-settings-app",
    "link": "https://www.theverge.com/news/756958/windows-11-settings-control-panel-update-mobile-app-notifications-start-menu",
    "published": "2025-08-08 14:31",
    "image": "https://images.unsplash.com/photo-1699275303864-67b6e1e11706?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjBwYyUyMHNldHRpbmdzJTIwYXBwfGVufDB8fHx8MTc1NDY3ODcxMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "I kid you not, we wrote these words in 2014: Microsoft has tried to dumb down its Control Panel with a simple UI over the years, rather than a list of options, but there’s still a number of settings that don’t exist in the new PC Settings app. “Why do I have to go the […]",
    "full_text": "Microsoft has tried to dumb down its Control Panel with a simple UI over the years, rather than a list of options, but there’s still a number of settings that don’t exist in the new PC Settings app. “Why do I have to go the PC settings to forget a network and Control panel to change IP settings? Can’t this all be done from a single place?” It’s a fair criticism, and one that Microsoft should look to address with Windows 10."
  },
  {
    "title": "How Wikipedia is fighting AI slop content",
    "slug": "how-wikipedia-is-fighting-ai-slop-content",
    "link": "https://www.theverge.com/report/756810/wikipedia-ai-slop-policies-community-speedy-deletion",
    "published": "2025-08-08 14:30",
    "image": "https://images.unsplash.com/photo-1482539341384-fed4cb4bcf3a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzb21ldGhpbmclMjB3aWtpbWVkaWElMjBmb3VuZGF0aW9uJTIwcHJvZHVjdCUyMGRpcmVjdG9yJTIwbWFyc2hhbGwlMjBtaWxsZXIlMjBsaWtlbnN8ZW58MHx8fHwxNzU0Njc4NzEyfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "With the rise of AI writing tools, Wikipedia editors have had to deal with an onslaught of AI-generated content filled with false information and phony citations. Already, the community of Wikipedia volunteers has mobilized to fight back against AI slop, something Wikimedia Foundation product director Marshall Miller likens to a sort of \"immune system\" response. […]",
    "full_text": "“They are vigilant to make sure that the content stays neutral and reliable,” Miller says. “As the internet changes, as things like AI appear, that’s the immune system adapting to some kind of new challenge and figuring out how to process it.” “Nonsensical” citations, including those with incorrect references to authors or publications. These aren’t the only signs of AI Wikipedians are looking out for, though. The speedy deletion policy isn’t just for AI-generated slop content, either. The Wikimedia Foundation is also actively developing a non-AI-powered tool called Edit Check that’s geared toward helping new contributors fall in line with its policies and writing guidelines. Right now, Edit Check can remind writers to add citations if they’ve written a large amount of text without one, as well as check their tone to ensure that writers stay neutral. The Wikimedia Foundation is also working on adding a “Paste Check” to the tool, which will ask users who’ve pasted a large chunk of text into an article whether they’ve actually written it. Contributors have submitted several ideas to help the Wikimedia Foundation build upon the tool as well, with one user suggesting asking suspected AI authors to specify how much was generated by a chatbot. “For now, our focus with using machine learning in the editing context is more on helping people make constructive edits, and also on helping people who are patrolling edits pay attention to the right ones.”"
  },
  {
    "title": "Looking to Cut Back on Processed Sugar? Try These 6 Natural Sweeteners",
    "slug": "looking-to-cut-back-on-processed-sugar-try-these-6-natural-sweeteners",
    "link": "https://www.cnet.com/health/nutrition/looking-to-cut-back-on-processed-sugar-try-these-6-natural-sweeteners/#ftag=CAD590a51e",
    "published": "2025-08-08 18:30",
    "image": "https://www.cnet.com/a/img/resize/ba71188252a44d7afd9c83313975f2d54a06cb6a/hub/2025/04/15/e30f250f-4e51-4fd5-967a-a5bb039f5c94/gettyimages-523342986.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Satisfy your sweet tooth in a healthier way by replacing processed sugar with these natural sugar substitutes.",
    "full_text": "Many of the unique compounds found in maple syrup have been shown to help combat cancer and diabetes. This sweetener is made from the stevia plant, and it's 200 to 400 times sweeter than table sugar. It adds sweetness without much else, which may be what you're looking for when cutting back on sugar. Remember that many stevia products on the market contain other processed ingredients or sugar alcohols, so it's important to do your research before using them. If you're looking for a more nutritionally balanced form of sugar, it's tough to beat raw fruits. Research on other non-nutritive sweeteners shows promising results in terms of weight management and fending off diabetes. The naturally sweet mogrosides in monk fruit also contain antioxidants, which can help with immune health and cancer prevention. While experts don't necessarily consider these drinks \"healthy,\" they can be a better option than traditional sodas. Make no mistake: these tasty alternatives are not substitutes for a fiber-rich diet and whole foods. If you can't stand that thought, consider adding other natural enhancers like cinnamon or vanilla extract instead."
  },
  {
    "title": "You Don't Need iOS 26 to Get This Dreamy Wallpaper on Your iPhone Now",
    "slug": "you-don-t-need-ios-26-to-get-this-dreamy-wallpaper-on-your-iphone-now",
    "link": "https://www.cnet.com/tech/services-and-software/you-dont-need-ios-26-to-get-this-dreamy-wallpaper-on-your-iphone-now/#ftag=CAD590a51e",
    "published": "2025-08-08 18:28",
    "image": "https://www.cnet.com/a/img/resize/ae7bfa9cd5d4df12490e2a2040ec9e894dc7f41a/hub/2025/08/08/65cfa244-d360-4a89-a42c-ab02180cc963/screenshot-2025-08-08-at-11-20-35am.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Everyone can download this wallpaper to their iPhone now.",
    "full_text": "Apple's upcoming iOS 26 will introduce a wallpaper design this fall with spatial features that seem to move in accordance with your iPhone and developers and beta testers can access that wallpaper now. However, the wallpaper isn't included in iOS 18.6 or another iPhone update. Here's how to get the colorful wallpaper on your iPhone now. While you don't need to be running the iOS 26 beta on your iPhone to use this image, the wallpaper only works as a spatial scene on iOS 26. Here's how to enable spatial scenes for wallpapers in the iOS 26 beta. If you choose Set Wallpaper Pair, your home screen picture will be blurred by default but you can change this by heading to Settings > Wallpaper, tapping Customize under your home screen and toggling blur off. Don't forget, Apple is still beta testing iOS 26. That means the update might be buggy for you and your device's battery life may be affected so it's best to keep those troubles off your primary device. If you want to try out the beta, I recommend downloading it on a secondary device. It's also possible that Apple could adjust the spatial scenes, and other update features, before the final version of iOS 26 is released this fall."
  },
  {
    "title": "Today's Wordle Is Super Tough: Here's the Answer for Aug. 8, #1511",
    "slug": "today-s-wordle-is-super-tough-here-s-the-answer-for-aug-8-1511",
    "link": "https://www.cnet.com/tech/gaming/todays-tricky-wordle-hints-answer-and-help-for-aug-8-1511/#ftag=CAD590a51e",
    "published": "2025-08-08 18:07",
    "image": "https://www.cnet.com/a/img/resize/837b400de41f50a97b52a8c799b193be01cea440/hub/2024/05/28/20480816-214e-4fcc-a9b4-b02f0ac71e7c/wordle-word-game-hints-puzzle-8667.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answer for today's extra-challenging Wordle for Aug. 8, No. 1,511",
    "full_text": "That sound you hear is Wordle streaks breaking across the land. Oof, today's Wordle puzzle is a pretty tough one. If you need a new starter word, check out our list of which letters show up the most in English words. If you need hints and the answer, read on. If you don't want a spoiler, look away now. Today's Wordle answer has no repeated letters. Today's Wordle answer begins with a vowel. Today's Wordle answer means to permeate or inspire. (TRAIN, STERN and AUDIO are good.) #2: Don't forget that letters can be used more than once."
  },
  {
    "title": "Don’t let your competitor steal the brand spotlight — secure your exhibit table at TechCrunch Disrupt 2025",
    "slug": "dont-let-your-competitor-steal-the-brand-spotlight-secure-your-exhibit-table-at-techcrunch-disrupt-2025",
    "link": "https://techcrunch.com/2025/08/08/dont-let-your-competitor-steal-the-brand-spotlight-secure-your-exhibit-table-at-techcrunch-disrupt-2025/",
    "published": "2025-08-08 17:45",
    "image": "https://images.unsplash.com/photo-1634368998864-8984df61cdda?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZWNoY3J1bmNoJTIwZGlzcnVwdHxlbnwwfHx8fDE3NTQ2NzYwMDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "For 20 years, startups have come to TechCrunch Disrupt to meet their first investors, land their biggest partnerships, and spark the idea that takes them to the next level.",
    "full_text": "For 20 years, startups have come to TechCrunch Disrupt to meet their first investors, land their biggest partnerships, and spark the idea that takes them to the next level. In 2025, that launchpad could be your exhibit table. Visibility where it counts: No table = no chance to showcase your product to thousands of investors, partners, and press walking the Expo Hall. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Skipping this means leaving serious value on the table. A 6’ x 30” branded exhibit table in the high-traffic Expo Hall for all three days. Shoutouts during key event moments and closing ceremonies."
  },
  {
    "title": "NASA and Google are building an AI medical assistant to keep Mars-bound astronauts healthy",
    "slug": "nasa-and-google-are-building-an-ai-medical-assistant-to-keep-mars-bound-astronauts-healthy",
    "link": "https://techcrunch.com/2025/08/08/nasa-and-google-are-building-an-ai-medical-assistant-to-keep-mars-bound-astronauts-healthy/",
    "published": "2025-08-08 17:17",
    "image": "https://images.unsplash.com/photo-1573804633927-bfcbcd909acd?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxydW5zJTIwaW5zaWRlJTIwZ29vZ2xlJTIwY2xvdWQlMjAlRTIlODAlOTl8ZW58MHx8fHwxNzU0Njc0MjA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The multimodal tool, which includes speech, text, and images, runs inside Google Cloud’s Vertex AI environment.",
    "full_text": "As human-spaceflight missions grow longer and travel farther from Earth, keeping crews healthy gets more challenging. Astronauts on the International Space Station can depend on real-time calls to Houston, regular cargo deliveries of medicines, and a quick ride home after six months. All of that may soon change as NASA and its commercial partners, like Elon Musk’s SpaceX, look to conduct longer-duration missions that would take humans to the moon and Mars. The tool, called Crew Medical Officer Digital Assistant (CMO-DA), is designed to help astronauts diagnose and treat symptoms when no doctor is available or communications to Earth are blacked out. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. NASA scientists said in a slide deck that they are planning on adding more data sources, like medical devices, and training the model to be “situationally aware” — that is, attuned to space medicine-specific conditions like microgravity. Cruley was vague about whether Google intends to pursue regulatory clearance to take this type of medical assistant into doctor’s offices here on Earth, but it could be an obvious next step if the model is validated on orbit."
  },
  {
    "title": "The best instant cameras you can buy right now",
    "slug": "the-best-instant-cameras-you-can-buy-right-now",
    "link": "https://www.theverge.com/23133103/best-instant-cameras-fujifilm-polaroid-kodak",
    "published": "2025-08-08 13:14",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24859242/236751_Instant_Camera_Buying_Guide.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "Even with the ability to take excellent photos with our phones and instantly share them across the world, there’s something magical about the old-school instant camera. With just a click of a button, you can capture a moment in a photo that you can see and touch almost immediately. Images captured by an instant camera […]",
    "full_text": "Other cameras come with advanced creative modes that let you edit photos and even print smartphone pictures, but a young child might find them hard to use. This is something you should take into account before making a purchase, as the cost of film can quickly add up. Fujifilm claims the Mini 12 optimizes image quality in both dark and bright environments better than its predecessor, but I didn’t notice much of a difference. But if you’re looking for an instant camera that offers a great traditional analog experience, this is it. Photos taken with the Kodak Mini Shot 3 aren’t particularly sharp and can have an excessive pink tint. The second-gen Polaroid Now Plus is a good combination of old-school and modern but was way too big for me to comfortably hold with just one hand. The most significant is USB-C support, which allows for faster charging and prevents you from having to spend money on AA batteries. It also comes with physical filter-changing lens and prints on Zinc paper, allowing you to use your photos as stickers. That said, it might be worth a look if you prefer large 2.4 x 2.4-inch square prints and relatively true-to-life photos over vintage-looking stills. In addition, the Flip features new autofocus capabilities powered by a sonar sensor that automatically selects from one of four lenses."
  },
  {
    "title": "Mini Ikea stores will be opening inside select Best Buy locations this year",
    "slug": "mini-ikea-stores-will-be-opening-inside-select-best-buy-locations-this-year",
    "link": "https://www.theverge.com/news/756868/ikea-retail-experience-best-buy",
    "published": "2025-08-08 12:54",
    "image": "https://images.unsplash.com/photo-1472851294608-062f824d29cc?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxvcGVuaW5nJTIwbWluaSUyMHJldGFpbCUyMGV4cGVyaWVuY2VzfGVufDB8fHx8MTc1NDY3MjQxNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Ikea has announced that it’s opening mini retail experiences in a handful of Best Buy stores in the southern US later this year. It’s the first time Ikea’s products and services will be available through another US retailer, saving shoppers from having to visit and navigate the chain’s warehouse-sized stores which aren’t as plentiful in […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. Ikea has announced that it’s opening mini retail experiences in a handful of Best Buy stores in the southern US later this year. It’s the first time Ikea’s products and services will be available through another US retailer, saving shoppers from having to visit and navigate the chain’s warehouse-sized stores which aren’t as plentiful in the US as Best Buy locations. Although Ikea has had a strong push into offering its own smart home products in recent years including lights and plugs, its new shop-in-shops won’t be focusing on electronics like the Apple-branded shops already located in most Best Buy stores. Instead, they’re designed to lure shoppers who are already at Best Buy to purchase appliances like fridges and washing machines into potentially redesigning their kitchens and laundry rooms. “By bringing together our home furnishing expertise, products, and services with Best Buy’s leadership in appliances and technology, we’re creating a one-stop destination where customers can design their dream kitchen, storage solutions or laundry space with ease,” said Rob Olson, chief operation officer, Ikea US, in a press release. You won’t be able to walk out of Best Buy with a new Billy bookcase, but you will be able to sit down with an Ikea rep in a mini showroom environment who can help you find new home furnishings and then order Ikea products for delivery. The Ikea shop-in-shops will be 1,000-square-feet in size and will launch at 10 Best Buy locations in Florida and Texas including Daytona Beach, South Austin, and Mesquite. Ikea hasn’t announced plans to open more than the initial 10 next year, but it seems like an easier way for the Swedish home furnishings chain to expand its presence since it currently has just 52 locations in the US while Best Buy has over 1,000."
  },
  {
    "title": "How to use Instagram Map and protect your privacy",
    "slug": "how-to-use-instagram-map-and-protect-your-privacy",
    "link": "https://techcrunch.com/2025/08/08/how-to-use-instagram-map-and-protect-your-privacy/",
    "published": "2025-08-08 16:53",
    "image": "https://images.unsplash.com/photo-1678481645061-6d32b3daffc7?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxpbnN0YWdyYW0lMjBoZWFkJTIwYWRhbSUyMG1vc3NlcmklMjByZWFzc3VyZWQlMjB1c2Vyc3xlbnwwfHx8fDE3NTQ3MTkyMDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Following concerns about safety, Instagram head Adam Mosseri reassured users that the feature is opt-in, and noted that some people are “confused” about how the feature works.",
    "full_text": "Following Wednesday’s launch of Instagram’s new Snap Map-like opt-in “Instagram Map” feature — which lets U.S. users share their most recent active location with others and discover location-based content — Instagram head Adam Mosseri is having to reassure people that their location is only visible to others if they decide to share it. Although Meta has made it clear that location sharing is off by default, there have been numerous posts on social media urging users to turn off location sharing, incorrectly claiming that it’s automatically turned on. Mosseri also said that some people are “confused” about how the feature works. It’s worth noting that this isn’t new, as Instagram already had location tags visible to users in its map view. However, the new Instagram Map feature makes this information a lot easier to access. If you turn on your location on Instagram Map, your location only updates when you open the app or have it running in the background, meaning it doesn’t provide continuous, real-time location updates. This is different from Snap Map, which lets users choose whether their location is updated only when they open the app or in real time. For those who want to ensure their location is turned off on Instagram Map, we’ll walk you through the steps below. If it’s your first time accessing the feature, you’ll likely see a pop-up message notifying you about the new Map. Here, you will be able to change your settings."
  },
  {
    "title": "Pinterest CEO says agentic shopping is still a long way out",
    "slug": "pinterest-ceo-says-agentic-shopping-is-still-a-long-way-out",
    "link": "https://techcrunch.com/2025/08/08/pinterest-ceo-says-agentic-shopping-is-still-a-long-way-out/",
    "published": "2025-08-08 16:33",
    "image": "https://images.unsplash.com/photo-1570223054025-abbe1dbfc90e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwaW50ZXJlc3QlMjBjZW8lMjBiaWxsJTIwcmVhZHklMjB0YWxrc3xlbnwwfHx8fDE3NTQ2NzE1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Pinterest CEO Bill Ready talks about the agentic web and where the social network will fit in the AI era.",
    "full_text": "Investors are likely concerned that if AI began to understand users’ interests, they could preemptively direct users to shop from their own personalized recommendations instead of using platforms like Pinterest. “But when users say things like ‘Pinterest just gets me,’ it’s because they can open the app and the app is going to make recommendations to them proactively on things that they’re really interested in, that align with their taste and their style, the way that a really great personal shopping assistant would,” he said. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Not addressed were the growing user concerns that too much of Pinterest is now filled with AI-generated, low-quality content. The discussion also omitted mention of mass user bans, which users believe stem from an overreliance on poorly designed AI moderation systems. On the call, Ready also spoke about how Pinterest aims to compete in the war for AI talent, saying that people who want to work there care about AI that’s used for good and used “responsibly.” “Both in terms of what we’re doing with tuning AI for positivity, creating a more positive alternative to what’s happening in the rest of social media,” he said."
  },
  {
    "title": "Instagram’s Map is here, and this is how you can turn your location off",
    "slug": "instagrams-map-is-here-and-this-is-how-you-can-turn-your-location-off",
    "link": "https://www.theverge.com/news/756798/instagram-map-how-to-turn-it-off",
    "published": "2025-08-08 12:27",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/The-Instagram-map_2x2-entrypoint.png?quality=90&strip=all&crop=0%2C23.821989528796%2C100%2C52.356020942408&w=1200",
    "summary": "It’s only been a couple of days since the Instagram Map launched, and from the looks of our social feeds, people are not happy about it. Responses have ranged from being mildly annoyed that Instagram is ripping off Snapchat’s Snap Maps instead of offering a default feed that only contains your friends’ posts, to high […]",
    "full_text": "He joined The Verge in 2021 after several years covering news at Engadget. It’s only been a couple of days since the Instagram Map launched, and from the looks of our social feeds, people are not happy about it. Responses have ranged from being mildly annoyed that Instagram is ripping off Snapchat’s Snap Maps instead of offering a default feed that only contains your friends’ posts, to high alert outrage about possibly privacy implications and doxing, as well as how domestic violence victims or others could be put at risk of stalking via the app. How to turn your location off on the Instagram Map If the only thing you want to do is turn Instagram Maps location sharing off, here’s Instagram’s instructions on how to make sure the feature is disabled within the app (on both Android and iOS): Tap Settings in the top right and select “no one” Tap Update at the bottom to save your changes. If you haven’t enabled location access for Instagram, Meta says that the map feature is disabled by default, and you won’t be able to access the settings since it doesn’t have access to that data. Why are you seeing people on your Instagram Map who haven’t enabled the feature or opted in? According to Instagram boss Adam Mosseri, people are seeing location-tagged posts and Reels that are also included in the map UI, and assuming that indicates a live-tracked location."
  },
  {
    "title": "OpenAI priced GPT-5 so low, it may spark a price war",
    "slug": "openai-priced-gpt-5-so-low-it-may-spark-a-price-war",
    "link": "https://techcrunch.com/2025/08/08/openai-priced-gpt-5-so-low-it-may-spark-a-price-war/",
    "published": "2025-08-08 16:10",
    "image": "https://images.unsplash.com/photo-1600456899121-68eda5705257?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0b3V0aW5nJTIwZ3B0fGVufDB8fHx8MTc1NDY2OTcwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Developers who have had early access are touting GPT-5's pricing as much better than competing models.",
    "full_text": "“Very happy with the pricing we are able to deliver!” he tweeted. This pricing mirrors Google’s Gemini 2.5 Pro basic subscription, which is also popular for coding-related tasks. (Note that Cursor offered GPT-5 as an option minutes after it was announced.) They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. If so, we could be witnessing the start of a much-awaited LLM price war. Silicon Valley has been hoping that the LLM price-to-performance ratio will eventually improve, along with inference costs. In the face of such enormous expenses, costs typically go one way: up. Yet this week, OpenAI threw down the gauntlet to put pressure on prices not just once but twice."
  },
  {
    "title": "SoftBank reportedly bought Foxconn’s Ohio factory for the Stargate AI project",
    "slug": "softbank-reportedly-bought-foxconns-ohio-factory-for-the-stargate-ai-project",
    "link": "https://techcrunch.com/2025/08/08/softbank-reportedly-bought-foxconns-ohio-factory-for-the-stargate-ai-project/",
    "published": "2025-08-08 16:00",
    "image": "https://images.unsplash.com/photo-1539876782331-cdcf975877af?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmb3hjb25uJTIwc3BlbnQlMjB5ZWFycyUyMHByb21pc2luZyUyMGVsZWN0cmljJTIwdmVoaWNsZXMlMjB3b3VsZHxlbnwwfHx8fDE3NTQ2Njk3MDV8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Foxconn spent years promising electric vehicles would be built at the former Chevy Cruze factory. Now it will make AI servers.",
    "full_text": "The report comes just a few days after Foxconn announced it had sold the factory, along with electric vehicle manufacturing equipment that was inside of it, to a buyer it only referred to as “Crescent Dune LLC” — an entity that was created in Delaware in late July. Neither company immediately responded to requests for comment. It’s unclear what this means for Monarch Tractor, a California-based startup that develops electric and autonomous farm equipment. Monarch CEO Praveen Penmetsa has not responded to emailed requests for comment. SoftBank, OpenAI, and Oracle announced the Stargate project one day after Donald Trump’s inauguration. The effort currently involves a large data center that is being built in Texas, but the companies involved have said they want to build infrastructure in other states and countries. In May, Bloomberg reported that SoftBank was struggling to line up funding for the project and that it was already being hampered by Trump’s myriad trade wars. Foxconn bought the factory in late 2021 from electric vehicle startup Lordstown Motors. At the time, Foxconn chairman Young Liu said his company wanted to develop the site into the “most important electric vehicle manufacturing and R&D hub in North America.” Prospective customers like Fisker Inc. and California startup IndiEV also went out of business."
  },
  {
    "title": "Apple Intelligence’s ChatGPT integration will use GPT-5 starting with iOS 26",
    "slug": "apple-intelligences-chatgpt-integration-will-use-gpt-5-starting-with-ios-26",
    "link": "https://www.theverge.com/news/756799/apple-intelligence-openai-chatgpt-gpt-5-ios-26",
    "published": "2025-08-08 11:42",
    "image": "https://images.unsplash.com/photo-1588662886318-6b48b48143f6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0aGluZ3MlMjBsaWtlJTIwaGVscGluZyUyMGFuc3dlciUyMGNlcnRhaW4lMjBzaXJpJTIwcXVlcmllc3xlbnwwfHx8fDE3NTQ2Njc5MTJ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "OpenAI just announced its GPT-5 AI model on Thursday, but you won’t be able to use it with Apple Intelligence’s ChatGPT integration until iOS 26, iPadOS 26, and macOS Tahoe 26, Apple confirmed to 9to5Mac. Apple Intelligence can rely on ChatGPT for things like helping answer certain Siri queries or alongside Apple’s Google Lens-like Visual […]",
    "full_text": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme. Posts from this author will be added to your daily email digest and your homepage feed. OpenAI just announced its GPT-5 AI model on Thursday, but you won’t be able to use it with Apple Intelligence’s ChatGPT integration until iOS 26, iPadOS 26, and macOS Tahoe 26, Apple confirmed to 9to5Mac. Apple Intelligence can rely on ChatGPT for things like helping answer certain Siri queries or alongside Apple’s Google Lens-like Visual Intelligence feature, but right now, it uses OpenAI’s GPT-4o model. Apple has only publicly said its next major software updates will arrive in the “fall,” and they’ll probably launch for everyone next month. But I’ve asked Apple if GPT-5 will be included with the developer and / or public betas of those updates, and if so, when it might be available. GPT-5 was released to all ChatGPT users on Thursday, meaning that you’ll even be able to try it as part of the free tier. OpenAI says that ChatGPT is now used by about 700 million people every week."
  },
  {
    "title": "This three-pack of fast Wi-Fi 7 routers is under $200 for the first time",
    "slug": "this-three-pack-of-fast-wi-fi-7-routers-is-under-200-for-the-first-time",
    "link": "https://www.theverge.com/tech/756663/tp-link-be25-wifi-routers-ring-battery-doorbell-deal-sale",
    "published": "2025-08-08 11:00",
    "image": "https://images.unsplash.com/photo-1568681877520-314c94ee717a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmaSUyMDclMjBtZXNoJTIwcm91dGVyc3xlbnwwfHx8fDE3NTQ2NjYxMTF8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Having a solid set of Wi-Fi routers is essential, whether you’re working from home, playing online games , or streaming a movie. I’ve used this three-pack of TP-Link’s Deco BE26 Wi-Fi 7 Mesh Routers for months without any issues, and I’m eager to recommend them, especially since it’s currently on sale for $188.89 ($90 off) […]",
    "full_text": "I’ve used this three-pack of TP-Link’s Deco BE26 Wi-Fi 7 Mesh Routers for months without any issues, and I’m eager to recommend them, especially since it’s currently on sale for $188.89 ($90 off) at Amazon (with an on-page promo code) or $199.99 ($80 off) at Best Buy. TP-Link claims this array of routers can create a network that covers up to 6,600 square feet, with speeds up to 5Gbps, and with support for over 150 devices at once. While I don’t own any Wi-Fi 7 gadgets yet, these routers have worked wonderfully in a three-floor 3,000-square foot condo. I’ve got a mix of gadgets connected to them, including ones that support Wi-Fi 6 and Wi-Fi 6E, along with smart home accessories. So far, I haven’t noticed network congestion issues or dropped connections. Even stress tests, like streaming multiple 4K movies while downloading a larger video game on various gadgets, didn’t pose a problem. In case you’re new to mesh Wi-Fi routers, one of the three in this kit must be wired directly to your cable modem, then the others can be installed anywhere there’s a power outlet. Ring’s Battery Doorbell Plus is If you want to bolster your home’s security,is one of our favorites video doorbells, and is currently $79.99 ($70 off) at Best Buy and Target . Roborock’s S8 robot vacuum and mop cleaner is one of the best budget-friendly robot vacuums is one of the best budget-friendly robot vacuums we’ve tested , and it’s currently $349.99 ($50 off) at Amazon and Walmart . The vacuum component can clean both hardwood and carpeted floors effectively, and can even automatically raise its mopping pads when cleaning the carpet to avoid getting it wet."
  },
  {
    "title": "What founders need to know before choosing their exit — straight from Jai Das and Roseanne Wincek — at TechCrunch Disrupt 2025",
    "slug": "what-founders-need-to-know-before-choosing-their-exit-straight-from-jai-das-and-roseanne-wincek-at-techcrunch-disrupt-2025",
    "link": "https://techcrunch.com/2025/08/08/what-founders-need-to-know-before-choosing-their-exit-at-techcrunch-disrupt-2025/",
    "published": "2025-08-08 14:30",
    "image": "https://images.unsplash.com/photo-1703192163733-be72ef568828?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZWNoY3J1bmNoJTIwZGlzcnVwdCUyMDIwMjV8ZW58MHx8fHwxNzU0NzE0NzA3fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Hear from Jai Das, Sapphire Ventures, and Roseanne Wincek, Renegade Partners, on how founders can prep for an exit at TechCrunch Disrupt 2025. Register here.",
    "full_text": "That’s why we’re bringing this essential conversation to the Going Public Stage at TechCrunch Disrupt 2025, happening October 27-29 in San Francisco’s Moscone West. Whether you’re already eyeing a liquidity event or just starting to scale, this is your chance to hear what top VCs are looking for and how to set up your company for long-term success. Two of the best in the business — Roseanne Wincek of Renegade Partners and Jai Das of Sapphire Ventures — will break down the decision-making process, from when to make a move to how to be ready when the moment comes. Why this session belongs on your calendar Startups can no longer afford to treat exit planning as an afterthought. It’s a candid, high-level look at how the best founders are preparing for every possible outcome. He’s led investments in more than a dozen IPOs and two dozen acquisitions, with a deep focus on enterprise tech and AI-driven SaaS. Get in the room where high-impact decisions start TechCrunch Disrupt 2025 brings together over 10,000 startup and VC leaders from around the world, and this session is your front-row seat to one of the most important conversations founders will face. Register now to get your pass for Disrupt (with savings of up to $600+) and take the guesswork out of your exit strategy."
  },
  {
    "title": "Meta acquires AI audio startup WaveForms",
    "slug": "meta-acquires-ai-audio-startup-waveforms",
    "link": "https://techcrunch.com/2025/08/08/meta-acquires-ai-audio-startup-waveforms/",
    "published": "2025-08-08 14:24",
    "image": "https://images.unsplash.com/photo-1598620616655-7fce1a6fdf87?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwZXIlMjBwaXRjaGJvb2slMjBkYXRhfGVufDB8fHx8MTc1NDY2MzQwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "WaveForms, founded just eight months ago, last raised $40 million in a round led by Andreessen Horowitz that valued the company at $160 million pre-money, per PitchBook data.",
    "full_text": "In Brief Meta has acquired AI voice startup WaveForms for an undisclosed sum, The Information reports. It’s the company’s latest buy to strengthen its new AI unit, Superintelligence Labs, and Meta’s second major AI audio acquisition in the last month after it bought PlayAI. WaveForms, founded just eight months ago, raised $40 million from Andreessen Horowitz in a round that valued the company at $160 million pre-money, per PitchBook data. Two of the startup’s co-founders — former Meta and OpenAI researcher Alexis Conneau, and former Google advertising strategist Coralie Lemaitre — have reportedly joined Meta. While at OpenAI, Conneau co-created GPT4-o Advanced Voice Mode neural networks. TechCrunch has reached out to WaveForms to find out whether its chief technologist, Kartikay Khandelwal, will also join Meta, as well as the outcome of the deal for the roughly 14 other staffers (per LinkedIn) at the company. WaveForms appears to have taken down its own website, but the company’s LinkedIn page describes its mission as solving the “Speech Turing Test,” which tries to measure if a listener can distinguish between human and AI-generated speech. WaveForms was also developing “Emotional General Intelligence,” which focuses on understanding individual self-awareness and management. Correction: A previous version of this article misstated Khandelwal’s role at WaveForms."
  },
  {
    "title": "Google tests revamped Google Finance with AI upgrades, live news feed",
    "slug": "google-tests-revamped-google-finance-with-ai-upgrades-live-news-feed",
    "link": "https://techcrunch.com/2025/08/08/google-tests-revamped-google-finance-with-ai-upgrades-live-news-feed/",
    "published": "2025-08-08 13:50",
    "image": "https://images.unsplash.com/photo-1578016981482-d4dd3db297b1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhY2Nlc3MlMjBhZHZhbmNlZCUyMGNoYXJ0aW5nJTIwdG9vbHN8ZW58MHx8fHwxNzU0NjYxNjA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Users will now be able to research their financial questions with AI, access advanced charting tools, and get real-time data and news.",
    "full_text": "Google announced on Friday that it’s giving Google Finance, its tool that provides financial information and business news, an AI update. Users will now be able to research their financial questions with AI, access advanced charting tools, and get real-time data and news. With the update, users can now ask detailed questions about finance and get a comprehensive AI response that includes links to relevant sites. Instead of having to look up individual stock details, users can ask complex questions in one go. As for the new charting tools, Google says these “will help you visualize financial data beyond simple asset performance. You can view technical indicators, like moving average envelopes, or adjust the display to see candlestick charts and more.” Google Finance is also getting additional market data, including commodities and additional cryptocurrencies. Additionally, there’s a new live news feed that lets you see real-time headlines. With this update, Google is looking to take on platforms like Yahoo Finance and Seeking Alpha. The company also likely hopes that by supercharging Google Finance with AI answers and charts, people are less likely to leave the service and go to an AI chatbot like ChatGPT for answers to complex questions."
  },
  {
    "title": "Openvibe combines news and social media in one app",
    "slug": "openvibe-combines-news-and-social-media-in-one-app",
    "link": "https://techcrunch.com/2025/08/08/openvibe-combines-news-and-social-media-in-one-app/",
    "published": "2025-08-08 13:00",
    "image": "https://images.unsplash.com/photo-1612643557374-13914ebd60c6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzb2NpYWwlMjBuZXR3b3JraW5nJTIwYXBwc3xlbnwwfHx8fDE3NTQ2NzYwMDh8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The addition makes Openvibe more useful for keeping up with your interests and other important information without having to switch between multiple newsreaders, websites, or social networking apps.",
    "full_text": "The addition makes Openvibe more useful for keeping up with your interests and other important information without having to switch between multiple newsreaders, websites, or social networking apps. Openvibe CEO Matej Svancer says RSS support was always part of the app’s longer-term roadmap since its launch last year. While RSS can also be used to track podcasts and YouTube channels, Openvibe isn’t yet focused on those formats, Svancer tells TechCrunch. It may be technically possible to add them in the app today, but it won’t offer a good user experience, he explains — unless you don’t mind having to open each item in a browser. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. The company has been testing the RSS feature ahead of launch with just over 100 people who have, combined, added over 4,000 feeds. RSS support is now available in Openvibe’s iOS and Android apps."
  },
  {
    "title": "xAI’s legal chief steps down after whirlwind year",
    "slug": "xais-legal-chief-steps-down-after-whirlwind-year",
    "link": "https://techcrunch.com/2025/08/07/xais-legal-chief-steps-down-after-whirlwind-year/",
    "published": "2025-08-08 04:49",
    "image": "https://images.unsplash.com/photo-1653498290920-a6277e169727?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsaWZldGltZSUyMCUyQyUyMiUyMHJvYmVydCUyMGtlZWxlJTIwc2FpZHxlbnwwfHx8fDE3NTQ2NzA2MDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Despite calling his time at xAI \"incredible\" and working with Musk \"the adventure of a lifetime,\" Robert Keele said he couldn't keep \"riding two horses at once — the family and the job.\"",
    "full_text": "Robert Keele said this week that he has stepped down as xAI’s head of legal after just over a year, saying he wants to spend more time with his children. In his announcement, Keele also acknowledged “daylight between our worldviews” with boss Elon Musk, who hasn’t commented on Keele’s exit. “I love my two toddlers and I don’t get to see them enough,” Keele wrote, posting the news on both X and LinkedIn. Keele arrived just before xAI announced a massive $6 billion Series B funding round in May 2024, backed by heavy hitters like Andreessen Horowitz and Sequoia Capital, valuing the company at $24 billion. Before his entrepreneurial stint, Keele had been head of legal at autonomous aircraft maker Elroy Air and general counsel at Airbus’ Silicon Valley innovation center. X CEO Linda Yaccarino left last month, and Tesla has lost several top executives recently. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "Tesla shuts down Dojo, the AI training supercomputer that Musk said would be key to full self-driving",
    "slug": "tesla-shuts-down-dojo-the-ai-training-supercomputer-that-musk-said-would-be-key-to-full-self-driving",
    "link": "https://techcrunch.com/2025/08/07/tesla-shuts-down-dojo-the-ai-training-supercomputer-that-musk-said-would-be-key-to-full-self-driving/",
    "published": "2025-08-07 22:19",
    "image": "https://images.unsplash.com/photo-1511548774318-563182fe8d03?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhaSUyMGNvbXBhbnklMjBkdWJiZWQlMjBkZW5zaXR5YWklMjBmb2N1c2VkfGVufDB8fHx8MTc1NDcwNzUwOXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The disbanding of Tesla’s Dojo efforts follows the departure of around 20 workers, who left the automaker to start their own AI company dubbed DensityAI focused on data center services for industries.",
    "full_text": "CEO Elon Musk has pushed to get shareholders to view Tesla as an AI and robotics company, despite a limited robotaxi launch in Austin this past June that featured Model Y vehicles with a human in the front passenger seat and resulted in a number of reported incidents of the vehicles exhibiting problematic driving behavior. Musk has said that Dojo would be the cornerstone of Tesla’s AI ambitions and its goal to reach full self-driving due to its ability to “process truly vast amounts of video data.” He talked about Dojo, albeit briefly, as recently as the company’s second-quarter earnings call. Just last year, Musk noted that Tesla’s AI team would “double down” on Dojo in the lead-up to Tesla’s robotaxi reveal, which happened in October. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. But talk about Dojo halted around August 2024, when Musk began touting Cortex instead, Tesla’s “giant new AI training supercluster being built at Tesla HQ in Austin to solve real-world AI.” The automaker also said it was working on a next-gen D2 chip that would solve any information flow bottlenecks of its predecessor. During Tesla’s second-quarter earnings call, Musk hinted at potential redundancies."
  },
  {
    "title": "Rocket Lab eyes big defense opportunities with new acquisition",
    "slug": "rocket-lab-eyes-big-defense-opportunities-with-new-acquisition",
    "link": "https://techcrunch.com/2025/08/07/rocket-lab-eyes-big-defense-opportunities-with-new-acquisition/",
    "published": "2025-08-07 21:23",
    "image": "https://images.unsplash.com/photo-1493934558415-9d19f0b2b4d2?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzcGFjZSUyMGNvbXBhbnl8ZW58MHx8fHwxNzU0NzAwMzE0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Rocket Lab is taking the concept of an 'end-to-end' space company to new heights with a forthcoming acquisition.",
    "full_text": "The results also highlighted the company’s acquisition strategy and how its purchase of a new optical payloads company will make it more competitive for lucrative government contracts. The company’s net loss widened to $66.4 million. Rocket Lab founder and CEO Peter Beck highlighted the “busy quarter of M&A activity” as the company gets close to closing its deal to buy Geost, a company that builds optical payloads. Through that acquisition, which will close at $275 million in cash and equity, Rocket Lab is opening a new business unit called Optical Systems to scale electro-optical and infrared sensor manufacturing. The acquisition is also one part of a larger play from Rocket Lab — spelled out quite explicitly in the company’s earnings presentation — to bid for multibillion-dollar DOD initiatives like Golden Dome. Rocket Lab has already won some major defense contracts, including a $515 million, 18-satellite build contract to support the Space Development Agency’s constellation of missile-tracking satellites. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "High costs and thin margins threatening AI coding startups",
    "slug": "high-costs-and-thin-margins-threatening-ai-coding-startups",
    "link": "https://techcrunch.com/2025/08/07/the-high-costs-and-thin-margins-threatening-ai-coding-startups/",
    "published": "2025-08-07 21:05",
    "image": "https://images.unsplash.com/photo-1505238680356-667803448bb6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjb2RpbmclMjBhc3Npc3RhbnQlMjBzdGFydHVwc3xlbnwwfHx8fDE3NTQ3MDg0MTB8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Coding assistant startups are highly unprofitable, says a source familiar with Windsurf financials.",
    "full_text": "That deal didn’t happen, according to a source familiar with the matter. Insiders tell TechCrunch that for all the popularity and hype around AI coding assistants, they can actually be massively money-losing businesses. This is a challenge compounded by fierce competition in the vibe-coding and code-assist market. Rivals include companies that already have huge customer bases like Anysphere’s Cursor and GitHub Copilot. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “Margins on all of the ‘code gen’ products are either neutral or negative. Anysphere CEO Michael Truell later apologized for unclear communication about the pricing change in a blog post."
  },
  {
    "title": "IPO hopeful Brex scored major win to sell in the EU, plans UK expansion",
    "slug": "ipo-hopeful-brex-scored-major-win-to-sell-in-the-eu-plans-uk-expansion",
    "link": "https://techcrunch.com/2025/08/07/ipo-hopeful-brex-scored-major-win-to-sell-in-the-eu-plans-uk-expansion/",
    "published": "2025-08-07 18:52",
    "image": "https://images.unsplash.com/photo-1589704976002-9eb970d55a31?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3b3JrYXJvdW5kcyUyMHJlcXVpcmVkJTIwJTJDJTIyJTIwY2VvJTIwcGVkcm8lMjBmcmFuY2VzY2hpJTIwc2FpZHxlbnwwfHx8fDE3NTQ3MTI5MTF8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The EU has authorized Brex to sell its spend management products directly in all 30 countries, \"no workarounds required,\" CEO Pedro Franceschi said.",
    "full_text": "That means it can now directly issue credit and debit cards and offer its spend management products to any business in all 30 EU countries with “no workarounds required,” as co-founder and CEO Pedro Franceschi wrote in a blog post. While the corporate spend management startup previously supported 60 currencies in 200 countries, it could only sell its products to companies with a U.S. presence. With the expansion, Brex is now authorized to sell spend management (complete with issuing cards) and other tools like embedded payments to EU companies and startups, a spokesperson tells TechCrunch. However, there’s a caveat: Banking and bill pay will not be initially available. Brex’s claim to fame is offering startups expense management cards for their employees even if they wouldn’t yet qualify from traditional banks. Without a bank account offering, the youngest EU startups will still have to weigh their options. That’s quite the turnaround from a shaky moment in 2023 when Brex conducted layoffs and reportedly told employees that its cash burn was too high. There has been no hint yet as to when that IPO may take place, though. Brex’s competitive win in the international market comes as its U.S. fintech competitors are having an overall moment. Brex has not publicly announced new equity VC funding since 2022, when it raised $300 million in a Series D-2 round at a $12.3 billion valuation."
  },
  {
    "title": "SpaceX is building a water pipeline to Starbase — but access comes with some conditions",
    "slug": "spacex-is-building-a-water-pipeline-to-starbase-but-access-comes-with-some-conditions",
    "link": "https://techcrunch.com/2025/08/07/spacex-is-building-a-water-pipeline-to-starbase-but-access-comes-with-some-conditions/",
    "published": "2025-08-07 17:30",
    "image": "https://images.unsplash.com/photo-1674119918108-4d511c4d5623?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3b3VsZCUyMGV4Y2hhbmdlJTIwYWNjZXNzfGVufDB8fHx8MTc1NDY4NDEwOXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "SpaceX has reportedly distributed an “unconditional and perpetual agreement” to non-SpaceX affiliated homes that would exchange access to Starbase’s water and sewer system for residents’ agreement to leave the area for “any and all launch, testing and other operational activities.”",
    "full_text": "Brownsville Public Utilities Board (BPUB) COO Mark Dombroski confirmed the line at a July 16 meeting, saying the board had executed a contract with SpaceX to provide water as an in-city customer. For a handful of non-SpaceX affiliated homes, getting access to that water may come with some terms and conditions. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Starbase disagrees: In July, Starbase city administrator Kent Myers reportedly sent a letter to a Cameron County commissioner saying the abrupt water cutoff “poses safety and public health risks.” There were 247 lots inside that boundary, and only 10 were not owned by SpaceX, according to an affidavit submitted by SpaceX senior manager of spaceport operations Richard Cardile. “These services are provided by SpaceX within the City Limits.” The planned pipeline solves near-term scarcity for SpaceX employees and their families but doesn’t create a public right to water."
  }
]