[
  {
    "title": "How to Watch Chelsea vs. AC Milan From Anywhere for Free: Stream Preseason Friendly Soccer",
    "slug": "how-to-watch-chelsea-vs-ac-milan-from-anywhere-for-free-stream-preseason-friendly-soccer",
    "link": "https://www.cnet.com/tech/services-and-software/how-to-watch-chelsea-vs-ac-milan-from-anywhere-for-free-stream-preseason-friendly-soccer/#ftag=CAD590a51e",
    "published": "2025-08-10 13:15",
    "image": "https://www.cnet.com/a/img/resize/2548fdd18c7b587780b489d9b44a903dd878681d/hub/2025/08/10/983648ab-47a9-49d8-b473-d8e9a91bebb9/gettyimages-2229150080.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Enzo Maresca's Blues wrap up their preseason preparations with a home clash against the Rossoneri.",
    "full_text": "The great news for footy fans is that sports streaming platform DAZN is broadcasting this match for free in almost every country, with coverage available in multiple languages. If you're not a member, it's easy to sign up for a free DAZN Freemium account using your email address to watch all the action at no cost through the DAZN app. How to watch Chelsea vs. AC Milan online from anywhere using a VPN If you're traveling abroad and want to keep up with all the soccer action while away from home, a VPN can help enhance your privacy and security when streaming. It can also be helpful when connecting to public Wi-Fi networks while traveling, adding an extra layer of protection for your devices and logins. However, some streaming services may have policies restricting VPN use to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. James Martin/CNET ExpressVPN Best VPN for streaming Price $13 per month, $100 for the first 15 months (then $117 per year) or $140 for the first 28 months (then $150 per year) Latest Tests No DNS leaks detected, 18% speed loss in 2025 tests Network 3,000 plus servers in 105 countries Jurisdiction British Virgin Islands ExpressVPN is our current best VPN pick for people who want a reliable and safe VPN that works on a variety of devices. It's normally $13 a month but if you sign up for an annual subscription for $100, you'll get three months free and save 49%. 61% off with 2yr plan (+4 free months) See at Go.expressvpn"
  },
  {
    "title": "Ditching my phone for an LTE smartwatch was a humbling experience",
    "slug": "ditching-my-phone-for-an-lte-smartwatch-was-a-humbling-experience",
    "link": "https://www.theverge.com/gadgets/756945/smartwatch-lte-minimalist-phone",
    "published": "2025-08-10 09:00",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/dsc01096_1.jpg?quality=90&strip=all&crop=0%2C10.723165084465%2C100%2C78.55366983107&w=1200",
    "summary": "Leaving the house without my phone is the stuff of nightmares. Leaving the house without my phone on purpose? Are you kidding? What if I need to take a picture of something? What will I look at if I need to wait in line? What if disaster strikes or a War of the Worlds happens? […]",
    "full_text": "Just one of several reminders that the Apple Watch’s existence depends on an iPhone. You’ll still get access to anything that has a native watch app, like messaging and emails. The bus ride went fine; it was just a matter of when to get off. I could have just called a yellow taxi service like people did for decades before Uber existed Uber offers an option to call and request a ride over the phone, as it turns out. I mostly brought my phone along as a backup for when I needed to do something out of the watch’s reach, like quickly finding an open restaurant nearby for lunch and putting in a pickup order. What using an Apple Watch as my phone taught me about B2B sales (and other learnings) Putting the phone number for Uber’s service in your contacts would be a good idea. Or maybe the best minimalist smartphone might just be your current phone with a few good focus modes. It wasn’t The Answer, but I’m going to keep the cellular watch on my phone plan to give myself more of those practice opportunities when I need a break from my phone."
  },
  {
    "title": "Watch Community Shield Soccer: Livestream Liverpool vs. Crystal Palace From Anywhere",
    "slug": "watch-community-shield-soccer-livestream-liverpool-vs-crystal-palace-from-anywhere",
    "link": "https://www.cnet.com/tech/services-and-software/watch-community-shield-soccer-livestream-liverpool-vs-crystal-palace-from-anywhere/#ftag=CAD590a51e",
    "published": "2025-08-10 12:38",
    "image": "https://www.cnet.com/a/img/resize/66d83db9b189a7e0b3267c2b9acecf94879f0eef/hub/2025/08/10/f9d85356-c1c4-4e1a-b2cc-6b6b14af034e/gettyimages-2228509377.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The season curtain-raiser at Wembley sees the EPL champions take on the cup-winning Eagles.",
    "full_text": "If you're traveling abroad and want to keep up with all the Community Shield action while away from home, a VPN can help enhance your privacy and security when streaming. However, some streaming services may have policies restricting VPN usage to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. If you choose to use a VPN, follow the provider's installation instructions, ensuring you're connected securely and in compliance with applicable laws and service agreements. James Martin/CNET ExpressVPN Best VPN for streaming Price $13 per month, $100 for the first 15 months (then $117 per year) or $140 for the first 28 months (then $150 per year) Latest Tests No DNS leaks detected, 18% speed loss in 2025 tests Network 3,000 plus servers in 105 countries Jurisdiction British Virgin Islands ExpressVPN is our current best VPN pick for people who want a reliable and safe VPN, and it works on a variety of devices. It's normally $13 a month, but if you sign up for an annual subscription for $100 you'll get three months free and save 49%. 61% off with 2yr plan (+4 free months) See at ExpressVPN It costs £31 either way and comes in a package that includes the Discovery Plus library of documentary content. Football fans down under can watch the Community Shield on the streaming service Stan Sport, which is also showing every single Premier League game live in Australia this season. It's also worth noting that the streaming service is currently offering a seven-day free trial."
  },
  {
    "title": "Sex is getting scrubbed from the internet, but a billionaire can sell you AI nudes",
    "slug": "sex-is-getting-scrubbed-from-the-internet-but-a-billionaire-can-sell-you-ai-nudes",
    "link": "https://www.theverge.com/internet-censorship/756831/grok-spicy-videos-nonconsensual-deepfakes-online-safety",
    "published": "2025-08-10 08:30",
    "image": "https://images.unsplash.com/photo-1614272708407-6e471cd0503c?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0YXlsb3IlMjBzd2lmdCUyMHRha2luZ3xlbnwwfHx8fDE3NTQ4Mjk5MTV8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "In the fascinating new reality of the internet, teen girls can't learn about periods on Reddit and indie artists can't sell smutty games on Itch.io, but a military contractor will make you nonconsensual deepfakes of Taylor Swift taking her top off for $30 a month. Early Tuesday, Elon Musk's xAI launched a new image and […]",
    "full_text": "In the fascinating new reality of the internet, teen girls can’t learn about periods on Reddit and indie artists can’t sell smutty games on Itch.io, but a military contractor will make you nonconsensual deepfakes of Taylor Swift taking her top off for $30 a month. Musk bragged that more than 34 million images were generated within a day of launching operations. Late last month, the UK started enforcing age-gating rules that required X and other services to block sexual or otherwise “harmful” content for users under 18. Deepfake porn of real people is a form of nonconsensual intimate imagery, which is illegal to intentionally publish in the US under the Take It Down Act, signed by President Donald Trump earlier this year. Grok also likely isn’t required to remove the images under the Take It Down Act’s takedown provision — despite that rule being so worryingly broad that it threatens most social media services. It might not even stop Grok from posting lewd AI-modified images of real people publicly, Franks told Spitfire News in June, in part because there are open questions about whether Grok is a “person” impacted by the law. Trump has given Musk-owned companies an almost total pass for bad conduct, and even after formally leaving his powerful position at the Department of Government Efficiency, Musk likely maintains tremendous leverage over regulatory agencies like the FTC. But Apple and payment processors don’t appear to maintain hard-line, evenly enforced policies. Grok’s new feature is harmful for people who can now easily have nonconsensual nudes made of them on a major AI service, but it also demonstrates how hollow the promise of a “safer” internet is proving. Small-time platforms face pressure to remove consensually recorded or entirely fictional media made by human beings, while a company run by a billionaire can make money off something that’s in some circumstances outright illegal."
  },
  {
    "title": "Best Internet Providers in Washington, DC",
    "slug": "best-internet-providers-in-washington-dc",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-washington-dc/#ftag=CAD590a51e",
    "published": "2025-08-10 12:18",
    "image": "https://www.cnet.com/a/img/resize/12ec13a4a5899551dd14c8d7dde8913726b1117d/hub/2023/05/26/372ef4d2-a74c-468f-b48b-ade1dbeef20b/wash-dc-gettyimages-1297672646.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Looking for speedy internet in DC? Good news -- you can pick from many reliable ISPs. Here are our top picks.",
    "full_text": "The three that stand out are Xfinity, Astound Broadband and Verizon Fios -- although wireless internet from regional ISPs like Starry Internet, DC Access and T-Mobile's 5G are also a good shout. This promotional price only lasts for 12 months, but it offers incredible savings. The best internet deals and top promotions in DC depend on what discounts are available during that time. For a more extensive list of promos, check out our guide on the best internet deals. (Disclosure: Ookla is owned by the same parent company as CNET, Ziff Davis.) However, a few higher-speed plans are available for less than $100 with promotional pricing. For more information, refer to our guide on how much internet speed you really need. We also input local addresses on provider websites to find specific options for residents. ISP plans and prices are subject to frequent changes; all information provided is accurate as of publication. Best of all, there's no price trickery here: These rates will be what you pay over the long term."
  },
  {
    "title": "After researchers unmasked a prolific SMS scammer, a new operation has emerged in its wake",
    "slug": "after-researchers-unmasked-a-prolific-sms-scammer-a-new-operation-has-emerged-in-its-wake",
    "link": "https://techcrunch.com/2025/08/10/after-researchers-unmasked-a-prolific-sms-scammer-a-new-operation-has-emerged-in-its-wake/",
    "published": "2025-08-10 12:00",
    "image": "https://images.unsplash.com/photo-1534407129159-6d74cc6b1431?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjBzbXMlMjB0ZXh0JTIwbWVzc2FnZSUyMGZyYXVkJTIwb3BlcmF0aW9ufGVufDB8fHx8MTc1NDgyODEwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Security researchers are now sounding the alarm on a new SMS text message fraud operation, which is surging in popularity — and its ability to steal people's credit cards — since the demise of its predecessor.",
    "full_text": "The scam isn’t particularly complex, but it has been highly effective. During a period of seven months in 2024, the scam netted at least 884,000 stolen credit card details, allowing scammers to cash in on their victims’ accounts. Some victims lost thousands of dollars in the scam, researchers say. As revealed by the Oslo-headquartered security firm Mnemonic and reported in tandem by Norwegian media earlier this year, behind the fluffy cute cat in Darcula’s profile photos is a 24-year-old Chinese national named Yucheng C. The researchers say Yucheng C. develops Magic Cat for his hundreds of customers, who use the software to launch their own SMS text message scam campaigns at their victims. Ahead of sharing new findings at the Def Con security conference in Las Vegas on Friday, Harrison Sand, an offensive security consultant at Mnemonic, told TechCrunch that Magic Mouse has been surging in popularity since the demise of Darcula’s Magic Cat. During their investigation, Mnemonic found photos from inside the operation posted in a Telegram channel that Darcula administered, showing a line-up of credit card payment terminals and videos showing racks with dozens of phones used for automating the sending of messages to victims. Sand told TechCrunch that Magic Mouse is already responsible for the theft of at least 650,000 credit cards a month. While evidence suggests Magic Mouse is an entirely new operation, coded by new developers and likely unrelated to Darcula, much of Magic Mouse’s success stems from the new operators stealing the phishing kits that made its predecessor’s software so popular. As for anyone who receives a suspicious text, ignoring an unwanted message might be the best policy."
  },
  {
    "title": "The next big AI model is here",
    "slug": "the-next-big-ai-model-is-here",
    "link": "https://www.theverge.com/installer-newsletter/757086/openai-gpt-5-chatgpt-roku-howdy-camp-snap-cs-8-fortnite-installer",
    "published": "2025-08-10 08:00",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/installer_da311a.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "Hi, friends! Welcome to Installer No. 93, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, I'm sad the sun is setting sooner, and also you can read all the old editions at the Installer homepage.) This week, I'm reading about the rise of GEO, laughing at Kirby's […]",
    "full_text": "Roku’s Howdy : This new subscription service has “thousands of titles” available ad-free for $2.99 per month. It works with up to 90 devices at once, which I’m guessing will be more than enough for most families. This Wi-Fi 7 travel router seems like it could save you some wireless connection hassles while on a big family trip. It works with up to 90 devices at once, which I’m guessing will be more than enough for most families. I also use a matte screen protector to complete the Light phone look, which is surprisingly cool. Macrofactor widget: a great algorithmic nutrition tracker that works for both gaining and losing weight, depending on your goals. Blank Spaces Launcher: This allows you to have an app list like shown, mimicking the Light Phone. And great timing, Red Octane is back to make a new rhythm game!” — Bruno “This week I took control of my RSS reader by moving from Inoreader to a self-hosted Miniflux instance. Works great, we use it all over the house and backyard.” If I had more closet space to “store” our TV when we weren’t using it, I would have ordered a cart and a cover yesterday."
  },
  {
    "title": "Best VPN for Mac for 2025: Hide Your Browsing, Privately Torrent and Unblock Streaming Services Like Netflix",
    "slug": "best-vpn-for-mac-for-2025-hide-your-browsing-privately-torrent-and-unblock-streaming-services-like-netflix",
    "link": "https://www.cnet.com/tech/services-and-software/best-vpn-for-mac/#ftag=CAD590a51e",
    "published": "2025-08-10 12:00",
    "image": "https://www.cnet.com/a/img/resize/3c47348800eab8be857b3088f1cfb84de1adb500/hub/2024/05/05/cf692422-b9a6-4ec7-8026-de0cb8092d79/vpn-for-mac.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Hide your web browsing activity, torrent privately and stream foreign content on apps like Netflix or BBC iPlayer with the best VPNs for Mac.",
    "full_text": "Most VPN providers offer a VPN app for Mac computers, but it can be difficult to choose the right provider with so many options available. At a minimum, your VPN should employ industry-standard AES 256-bit encryption (with the OpenVPN or IKEv2 VPN protocols) or ChaCha20 (with the WireGuard or IKEv2 VPN protocol), along with offering basic privacy protections like a kill switch, DNS leak protection and a no-logs policy. If you need to use a VPN in situations where they're frowned upon -- like on school Wi-Fi -- you may want a provider that offers obfuscated servers or obfuscation-focused VPN protocols, such as Proton VPN's Stealth or NordVPN's NordWhisper. Obfuscation tries to hide the fact that you're using a VPN, making your connection look like standard web traffic instead. Also, look for a VPN that undergoes regular third-party security audits, as audits can help bolster trust in the VPN's ability to protect its users' privacy. You should also consider advanced features, like specialty servers (such as Tor over VPN and obfuscated servers), double hop/multi-hop, a dedicated IP address and split tunneling (which lets you use a VPN connection for some VPN apps but not others). VPN pricing varies greatly from provider to provider, so if you're on a budget, you may want to consider the cost and overall value of your MacOS VPN. If you want to save money, you can opt for an annual subscription, where prices can range from roughly $50 to $150 a year. Be careful with free VPNs, though, because you may end up putting your privacy at risk instead of protecting it if you go with a free option. VPNs can elevate your streaming experience thanks to their ability to hide your IP address, thereby making apps and websites think you're in a different geographical location."
  },
  {
    "title": "Thinking of Buying a Portable AC? 5 Things You Need to Know Before You Do",
    "slug": "thinking-of-buying-a-portable-ac-5-things-you-need-to-know-before-you-do",
    "link": "https://www.cnet.com/news/thinking-of-buying-a-portable-ac-5-things-you-need-to-know-before-you-do/#ftag=CAD590a51e",
    "published": "2025-08-10 11:30",
    "image": "https://www.cnet.com/a/img/resize/db179b7d0b485746bd2209df0dbde5ef20c6b221/hub/2025/08/08/eb79b2c6-f66e-41ff-bc3a-63ae9b79618f/midea-duo-portable-ac-top-of-unit-with-close-up-of-control-panel.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "I learned a few portable AC quirks in my first year of ownership to help you decide if one of these compact coolers is right for your home.",
    "full_text": "This shouldn't be an issue for most brands but it's worth double-checking. Portable AC units must circulate outside air over their condenser coils to remove heat from inside your home. I spent hours finding the perfect model for my needs, which also happens to be CNET's current high-end pick -- Midea Duo MAP14HS1TBL -- a heat pump unit that could heat my poorly-insulated office in the winter if needed. I got over my blunder pretty quickly, but it was disappointing at the beginning. I tried in vain to track down a replacement window kit online and had no luck because the brand doesn't sell them. It's worked well but my placement options are limited and I could have saved a lot of time with the right window kit. Still, remotes are worth keeping in mind if you want to control your room air conditioner remotely. While buying a refurbished portable air conditioner worked out OK, there were several hoops to jump through that may not make the savings worth it for others. Although the design of portable air conditioners holds them back from matching the energy efficiency of a good central or window AC unit, they can be great for supplemental cooling in a hotspot in your home. They're also great for renters because you rarely need to install any window kit hardware with screws."
  },
  {
    "title": "The Merlin Bird ID App Is Better Than Meditation, and It's Not Just for Birders",
    "slug": "the-merlin-bird-id-app-is-better-than-meditation-and-it-s-not-just-for-birders",
    "link": "https://www.cnet.com/health/the-merlin-bird-id-app-is-better-than-meditation-and-its-not-just-for-birders/#ftag=CAD590a51e",
    "published": "2025-08-10 10:34",
    "image": "https://www.cnet.com/a/img/resize/9739da931925df6ec8dbfda63df66cefdc80f70b/hub/2025/07/31/94516112-3170-468d-829a-5457a342811a/bird-id-app.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "If you struggle with mindfulness and staying present like I do, this app might help you, too.",
    "full_text": "What helps me stay grounded has nothing to do with any of that. Cornell Lab of Ornithology's Merlin Bird ID launched in 2014 to help people identify the birds they see and hear. Then, I dug out my binoculars and let even more time fly. As any Merlin Bird IDer knows, there is no thrill quite like pressing the \"This is my bird\" button for the first time, and it never gets old. Black Phoebes made themselves known with their fluffy soot-black heads, statue stillness and ivory bellies. Recently, while sitting in a new-to-me park, the app told me a Mountain Chickadee was nearby and I spent the next 45 minutes trying to spot it with my binoculars. I've yet to find the Red-Winged Blackbird who always seems to be just out of reach, no matter where I am in my city, but I console myself with the seemingly all-knowing flock of Common Ravens (also unjustly called an \"unkindness\") evermore on my street and the surprising number of noises they can produce. Because of this app, I've spent more time listening to the world around me and less time in my own head, bobbing between the past and future. I've found myself surrounded by and in conversation with nature more than ever before. It may be the closest thing we have to magic here on Earth."
  },
  {
    "title": "iPhone Users, Find Calls Faster With This Trick",
    "slug": "iphone-users-find-calls-faster-with-this-trick",
    "link": "https://www.cnet.com/tech/services-and-software/iphone-users-find-calls-faster-with-this-trick/#ftag=CAD590a51e",
    "published": "2025-08-10 10:00",
    "image": "https://www.cnet.com/a/img/resize/fd929b0678555a3361beb0fd60866f2bc11a1de2/hub/2025/08/06/085a5fd1-94e2-4068-9448-b7e076b61381/amanz-4gtmwj9uxwc-unsplash.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "You can quickly find the last time you called your mom on your iPhone -- and reminder: You should probably call your mom.",
    "full_text": "But when Apple introduced iOS 18 in 2024, it included a trick that let you find calls faster in your recent call history. That update brought a lot of new features, like customizable home screens and RCS messaging, as well as a search bar in your iPhone's Phone app. This lets you easily search your call history and voicemails. Before iOS 18, your Phone app's Recent calls tab was a running list of all the calls made to and from your iPhone. Both of these options also have the option to See All. You can use the search bar to search for a specific contact's name, a contact's number or dates. For example, typing \"mom\" or \"dad\" pulls up all the phone calls and voicemails from your mom or dad, as well as their contact card. Similarly, typing \"August\" or \"July\" into the search bar pulls up all calls and voicemails from that month. You can also type a specific date, like \"July 5,\" and that pulls up calls and voicemails from that particular date. For more on iOS, here are my first impressions of the iOS 26 beta, how to enable call screening in the beta and all the other new features Apple said that update will bring to your device later this year."
  },
  {
    "title": "12 of the Best Sci-Fi Movies to Stream on Prime Video",
    "slug": "12-of-the-best-sci-fi-movies-to-stream-on-prime-video",
    "link": "https://www.cnet.com/tech/services-and-software/best-sci-fi-movies-on-prime-video-2025/#ftag=CAD590a51e",
    "published": "2025-08-10 10:00",
    "image": "https://www.cnet.com/a/img/resize/25615e3aa9738ee8e84d752fb54eacecfce1bbaf/hub/2025/06/30/611f6429-d292-4f74-af03-d9e2d9025178/godzilla-movie-key-art-2014.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Prime Video's library is packed with sci-fi gold.",
    "full_text": "Prime Video has got the epic sci-fi movies you're looking for. From high-brow to some B movie-flavored ridiculousness, there's pretty much something for every fan. Read more: 20 of the Best Sci-Fi TV Shows to Stream on Netflix Sunset Boulevard/Corbis via Getty Images Mad Max Mad Max, the first entry in the hit franchise, takes place in a not-so-distant future where oil becomes a hard-to-find commodity. I'm not going to rank this release, but Gareth Edwards's take on the iconic kaiji does a great job of reintroducing audiences to this universe while also delivering a whole new set of story circumstances and characters. This ridiculously fun sequel finds the buds grappling with an unexpected scenario: They get murdered by robot clones and go to Hell. I suppose you can say it's like if When Harry Met Sally and Bladerunner had a baby. Chase Williamson plays Dave, the guy plagued with supernatural visions, who teams up with his slacker buddy John (Rob Mayes) to investigate all sorts of weird phenomena. City Films Escape From New York In John Carpenter's postapocalyptic cult classic, it's 1997 in New York and the city has been ravaged by war. After the president is taken hostage, former Special Forces officer (and current prisoner) Snake Plissken (Kurt Russell) is recruited to save the day in return for his own freedom."
  },
  {
    "title": "Today's NYT Connections: Sports Edition Hints and Answers for Aug. 10, #321",
    "slug": "today-s-nyt-connections-sports-edition-hints-and-answers-for-aug-10-321",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-sports-edition-hints-and-answers-for-aug-10-321/#ftag=CAD590a51e",
    "published": "2025-08-10 03:05",
    "image": "https://www.cnet.com/a/img/resize/c7e1d294a1a554f051860c8dddd6fd0c6527b452/hub/2024/10/16/c34cfc41-01f2-4b1a-80a8-f6479c50c02e/connections-sports-edition-6859.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answers for the NYT Connections: Sports Edition puzzle for Aug. 10, No. 321",
    "full_text": "Looking for the most recent regular Connections answers? Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle and Strands puzzles. Today's Connections: Sports Edition counts on you knowing a little bit about European soccer venues, so that could help or hurt some puzzle-solvers. Or you can continue to play it free online. Hints for today's Connections: Sports Edition groups Green group hint: Start cooking those dogs. Purple group hint: They miss their teams. Answers for today's Connections: Sports Edition groups What are today's Connections: Sports Edition answers? The completed NYT Connections: Sports Edition puzzle for Aug. 10, 2025."
  },
  {
    "title": "Today's NYT Mini Crossword Answers for Sunday, Aug. 10",
    "slug": "today-s-nyt-mini-crossword-answers-for-sunday-aug-10",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-mini-crossword-answers-for-sunday-aug-10/#ftag=CAD590a51e",
    "published": "2025-08-10 02:51",
    "image": "https://www.cnet.com/a/img/resize/16d2290ea5c9dc928db9624c275de45ff920b828/hub/2024/07/25/50d61b9b-1c76-4678-9a92-f6eca531f4a8/nyt-mini-crossword-234876.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are the answers for The New York Times Mini Crossword for Aug. 10",
    "full_text": "Gael Cooper CNET editor Gael Fashingbauer Cooper, a journalist and pop-culture junkie, is co-author of \"Whatever Happened to Pudding Pops? The Lost Toys, Tastes and Trends of the '70s and '80s,\" as well as \"The Totally Sweet '90s.\" She's been a journalist since 1989, working at Mpls.St.Paul Magazine, Twin Cities Sidewalk, the Minneapolis Star Tribune, and NBC News Digital. She's Gen X in birthdate, word and deed. If Marathon candy bars ever come back, she'll be first in line."
  },
  {
    "title": "Best Internet Providers in Los Angeles, California",
    "slug": "best-internet-providers-in-los-angeles-california",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-los-angeles-ca/#ftag=CAD590a51e",
    "published": "2025-08-09 23:58",
    "image": "https://www.cnet.com/a/img/resize/d8c6ddcafaf2e0e107b98f2614e043f082dfb40a/hub/2022/03/29/0e1700a0-6db3-4829-8cdb-7fe6a348b4bc/los-angeles-gettyimages-1219033520.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Angelenos have access to several major ISPs, but the best option will depend on what area of the city you live in.",
    "full_text": "CNET’s top internet provider recommendation for Los Angeles is AT&T Fiber. The average starting price for internet service in Los Angeles is approximately $42 monthly. The cheapest plan is Starry 100, which costs $30 a month and offers speeds up to 100Mbps The best internet deals and top promotions in Los Angeles depend on what discounts are available during that period. For a more extensive list of promos, check out our guide to the best internet deals. For more information, refer to our guide on how much internet speed you really need. We also input local addresses on provider websites to find specific options for residents. (Disclosure: Ookla is owned by the same parent company as CNET, Ziff Davis.) Spectrum is tough to beat among Los Angeles internet providers if you want consistent service and wide availability. The average starting cost for a provider's cheapest plan is $45 per month."
  },
  {
    "title": "Today's NYT Strands Hints, Answers and Help for Aug. 10 #525",
    "slug": "today-s-nyt-strands-hints-answers-and-help-for-aug-10-525",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-strands-hints-answers-and-help-for-aug-10-525/#ftag=CAD590a51e",
    "published": "2025-08-09 20:00",
    "image": "https://www.cnet.com/a/img/resize/166e67238a28ef7d82e62fe8aec7185a7cc23eda/hub/2024/05/15/859c9110-e596-432b-8690-95e6102759c9/nyt-new-york-times-strands-2054.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and answers for the NYT Strands puzzle No. 525 for Sunday, Aug. 10.",
    "full_text": "Just how old are the New York Times staffers writing today's NYT Strands puzzle? I swear, some of these words haven't been used in 50 years. So cast your mind back for some historical terms, and let's get at it. If you need hints and answers, read on. I go into depth about the rules for Strands in this story. If you're looking for today's Wordle, Connections and Mini Crossword answers, you can visit CNET's NYT puzzle hints page. Today's Strands theme is: A rip-roaring good time. Your goal is to find hidden words that fit the puzzle's theme. These are the words I used to get those hints, but any words of four or more letters that you find will work: When you have all of them (I originally thought there were always eight but learned that the number can vary), every letter on the board will be used."
  },
  {
    "title": "Today's NYT Connections Hints, Answers and Help for Aug. 10, #791",
    "slug": "today-s-nyt-connections-hints-answers-and-help-for-aug-10-791",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-connections-hints-answers-and-help-for-aug-10-791/#ftag=CAD590a51e",
    "published": "2025-08-09 20:00",
    "image": "https://www.cnet.com/a/img/resize/3986ca4ac5b498c6114118e0dfa25b2a05ae6531/hub/2025/03/26/c70b0a32-884a-4379-b77b-de75776952ba/nyt-word-games-connections-2798.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are some hints and the answers for the NYT Connections puzzle No. 791, for Sunday, Aug. 10.",
    "full_text": "Click here for today's Connections hints, as well as our daily answers and hints for The New York Times Mini Crossword, Wordle, Connections: Sports Edition and Strands puzzles. Today's NYT Connections puzzle features a fun blue category, especially for bookworms like me. That purple category, though -- no one does those random \"look for a word inside of a word\" categories like the Times. Read on for clues and today's Connections answers. Players who are registered with the Times Games section can now nerd out by following their progress, including number of puzzles completed, win rate, number of times they nabbed a perfect score and their win streak. Read more: Hints, Tips and Strategies to Help You Win at NYT Connections Every Time Yellow group hint: To have an effect on something. Purple group hint: Look at a high-school or college schedule for hints. Purple group: Starting with math and science classes, for short. The theme is starting with math and science classes, for short."
  },
  {
    "title": "Today's Wordle Hints, Answer and Help for Aug. 10, #1513",
    "slug": "today-s-wordle-hints-answer-and-help-for-aug-10-1513",
    "link": "https://www.cnet.com/tech/gaming/todays-wordle-hints-answer-and-help-for-aug-10-1513/#ftag=CAD590a51e",
    "published": "2025-08-09 20:00",
    "image": "https://www.cnet.com/a/img/resize/837b400de41f50a97b52a8c799b193be01cea440/hub/2024/05/28/20480816-214e-4fcc-a9b4-b02f0ac71e7c/wordle-word-game-hints-puzzle-8667.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are hints and the answer for today's Wordle, No. 1,513, for Sunday, Aug. 10.",
    "full_text": "Gael Cooper CNET editor Gael Fashingbauer Cooper, a journalist and pop-culture junkie, is co-author of \"Whatever Happened to Pudding Pops? The Lost Toys, Tastes and Trends of the '70s and '80s,\" as well as \"The Totally Sweet '90s.\" She's been a journalist since 1989, working at Mpls.St.Paul Magazine, Twin Cities Sidewalk, the Minneapolis Star Tribune, and NBC News Digital. She's Gen X in birthdate, word and deed. If Marathon candy bars ever come back, she'll be first in line."
  },
  {
    "title": "Vitamin E: Health Benefits, Food Sources and What to Know Before Using Supplements",
    "slug": "vitamin-e-health-benefits-food-sources-and-what-to-know-before-using-supplements",
    "link": "https://www.cnet.com/health/nutrition/vitamin-e-health-benefits-food-sources-and-what-to-know-before-using-supplements/#ftag=CAD590a51e",
    "published": "2025-08-09 17:32",
    "image": "https://www.cnet.com/a/img/resize/6408ea47bcfcbf582642d3b3f32498588cfcee57/hub/2022/10/07/cb9f5ee0-76f8-4f47-a6e7-555d853c822e/gettyimages-1208523201.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Vitamin E can have a big impact on your skin and overall health. Here's what you need to know about getting more of this essential nutrient in your diet or through supplements.",
    "full_text": "But vitamin E isn't just applied topically -- you also need to get it in your daily diet. Consuming enough vitamin E is crucial because it plays a key role in human development and functioning. While it is possible to meet daily vitamin E needs through food, oral and topical supplements are also available. The results were not as positive for those at high risk or who already had heart disease. Vitamin E's contribution to free radical reduction also reduces skin damage from UV exposure. Less skin damage means a more youthful glow, and who doesn't want that? Its anti-inflammatory effects also help to reduce symptoms in chronic inflammatory skin conditions like dermatitis. Although there is no research to suggest vitamin E causes heart disease, some research does suggest that vitamin E may worsen the condition and increase the risk of death by heart attack or stroke. Hemorrhage: High doses of vitamin E have been shown to cause bleeding and increase the risk for hemorrhagic stroke. High doses of vitamin E have been shown to cause bleeding and increase the risk for hemorrhagic stroke."
  },
  {
    "title": "How to Watch Palermo vs. Man City From Anywhere: Stream Preseason Friendly Soccer",
    "slug": "how-to-watch-palermo-vs-man-city-from-anywhere-stream-preseason-friendly-soccer",
    "link": "https://www.cnet.com/tech/services-and-software/how-to-watch-palermo-vs-man-city-from-anywhere-stream-preseason-friendly-soccer/#ftag=CAD590a51e",
    "published": "2025-08-09 17:30",
    "image": "https://www.cnet.com/a/img/resize/2f0130272f223c0ff458cc1c6bb7582deaf2669d/hub/2025/08/09/2a805845-bc54-43b6-9ebe-e8a8541e9069/gettyimages-2222229785.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Pep Guardiola's men wrap up their prep for the new campaign with a trip to Sicily.",
    "full_text": "City have had a truncated preseason thanks to their involvement in the FIFA Club World Cup early this summer, which saw them crash out at the Round of 16 stage with a shock defeat to Saudi Pro League side Al-Hilal. Up for grabs today is the Anglo-Palermitan Trophy, commemorating Palermo's historic first-ever match against British sailors in 1900. That makes it an 8 p.m. BST start in the UK, a 3 p.m. That means you'll also be able to watch the game online via streaming platform Paramount Plus. It also can be helpful when connecting to public Wi-Fi networks while traveling, adding an extra layer of protection for your devices and logins. However, some streaming services may have policies restricting VPN use to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. 61% off with 2yr plan (+4 free months) See at Go.expressvpn CITY+ Watch Man City preseason friendlies for £5 CITY+ offers access to exclusive Manchester City video content, including live streams of select men's pre-season friendlies), full match replays and selected live Academy and Women's games. The service is priced at £5 per month or £35 for a full year's subscription."
  },
  {
    "title": "11 Great Horror Movies to Stream on Prime Video Now",
    "slug": "11-great-horror-movies-to-stream-on-prime-video-now",
    "link": "https://www.cnet.com/tech/services-and-software/11-great-horror-movies-to-stream-on-prime-video-now/#ftag=CAD590a51e",
    "published": "2025-08-09 15:00",
    "image": "https://www.cnet.com/a/img/resize/66932f35a66eafb1128c26a6a0a18e9c7011cb4b/hub/2025/03/10/ef6d6b0c-1c92-4f5f-9bba-237242c39d01/screenshot-2025-03-10-at-2-50-05pm.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "These highly rated movies are thoroughly entertaining.",
    "full_text": "Coherence is a huge favorite here at CNET and it's a terrifying watch. Not necessarily in the traditional, gory, horrific sense but more in terms of the concepts. It's a multiverse movie released before multiverses were cool and is not what you expect. Coherence is the kind of movie you'll finish and immediately rewatch to try to rewire your brain. It's a fantastic achievement and a must watch."
  },
  {
    "title": "Best Internet Providers in San Francisco",
    "slug": "best-internet-providers-in-san-francisco",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-san-francisco-ca/#ftag=CAD590a51e",
    "published": "2025-08-09 14:59",
    "image": "https://www.cnet.com/a/img/resize/3c0250b8c810bd83986c41336a6f89e90f563d31/hub/2022/04/25/942c6bd8-64c1-49d2-851f-ec41cabfc73d/gettyimages-164924147.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "While our top ISP pick is Sonic, Xfinity, Astound, and Verizon are also decent options to consider. Here is everything you need to know about them.",
    "full_text": "AT&T Fiber also has multi-gigabit plans of up to 5,000Mbps, while Xfinity offers a 1,200Mbps plan for $100. Etheric Networks offers residential internet service through a wireless connection to the company's hardwired infrastructure. Speeds won't get any faster than 100Mbps under the best circumstances and will likely be much lower. The service offers better overall availability than Verizon since it leans on 4G/LTE airwaves as well, but that also means that average speeds are slower, with downloads ranging from 87 to 415Mbps and uploads ranging from 14 to 55Mbps. The best internet deals and top promotions in San Francisco depend on what discounts are available during a given time. For a more extensive list of promos, check out our guide on the best internet deals. Although multiple fiber and cable providers cover the Bay Area, San Francisco's internet speeds are relatively slow. (Disclosure: Ookla is owned by Ziff Davis, the same parent company as CNET.) For more information, refer to our guide on how much internet speed you really need. ISP plans and prices are subject to frequent changes; all information provided is accurate as of publication."
  },
  {
    "title": "After User Backlash, OpenAI Is Bringing Back Older ChatGPT Models",
    "slug": "after-user-backlash-openai-is-bringing-back-older-chatgpt-models",
    "link": "https://www.cnet.com/tech/services-and-software/after-user-backlash-openai-is-bringing-back-older-chatgpt-models/#ftag=CAD590a51e",
    "published": "2025-08-09 14:24",
    "image": "https://www.cnet.com/a/img/resize/2c1f253bc935f5626a2937040f7c3d365f867a34/hub/2025/08/07/d34b1772-c515-4546-8eae-69a1abcf0b08/chatgpt5-cnet2.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "OpenAI touted GPT-5 as a new model for everything. However, some people still prefer the older versions.",
    "full_text": "OpenAI hoped to shrink the menu of generative AI models on its ChatGPT platform to just one with the release of its GPT-5 model this week. Altman and other OpenAI leaders took questions on Reddit on Friday, a day after the announcement of the new GPT-5 model. A quick glance through the comments revealed how many users preferred how older models like GPT-4.1, GPT-4.5 and 4o handled writing and other tasks. Some said the other models seemed more friendly and conversational than GPT-5. \"BRING BACK 4o,\" one user posted, \"GPT-5 is wearing the skin of my dead friend.\" Altman, posting in the AMA, said OpenAI will look into making 4o or other models available for Plus users. Altman said \"we hear you all on 4o\" and that OpenAI will monitor usage to see how long to support 4o for Plus users. The rollout of GPT-5 was \"a little more bumpy than we hoped for,\" Altman said. The program that decides whether a prompt will be handled by a faster, lighter model within GPT-5 or a more intensive reasoning model was not working for part of Thursday, he said. The rollout of GPT-5 to all users has also taken longer than expected."
  },
  {
    "title": "How to Watch Arsenal vs. Athletic Club From Anywhere: Stream Preseason Friendly Soccer",
    "slug": "how-to-watch-arsenal-vs-athletic-club-from-anywhere-stream-preseason-friendly-soccer",
    "link": "https://www.cnet.com/tech/services-and-software/how-to-watch-arsenal-vs-athletic-club-from-anywhere-stream-preseason-friendly-soccer/#ftag=CAD590a51e",
    "published": "2025-08-09 14:00",
    "image": "https://www.cnet.com/a/img/resize/8accfc48bdc5c637ae32ab293b7703ea52a8aeb8/hub/2025/08/09/463e3dad-7047-467e-b5c1-72581836f8a7/gettyimages-2228813704.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The Gunners take on Spanish opposition for the second time in a week in their final warm-up match before the big kickoff.",
    "full_text": "Emirates Cup preseason tournament comes to a close Saturday as Arsenal take on La Liga outfit Athletic Club in the Gunners' final friendly match ahead of the new Premier League season. We'll also explain how to use a VPN if the match isn't available where you are. The north Londoners have had an indifferent preseason so far, with two wins and two defeats, and will be keen to end their preparations for the new campaign on a high ahead of their tricky EPL opener against Man United next weekend. Kickoff is set for 6 p.m. BST local time in the UK. This match is available for £5 via an Early Bird PPV package if you purchase before 9 a.m. on Thursday. It can also be helpful when connecting to public Wi-Fi networks while traveling, adding an extra layer of protection for your devices and logins. However, some streaming services may have policies restricting VPN use to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. James Martin/CNET ExpressVPN Best VPN for streaming Price $13 per month, $100 for the first 15 months (then $117 per year) or $140 for the first 28 months (then $150 per year) Latest Tests No DNS leaks detected, 18% speed loss in 2025 tests Network 3,000 plus servers in 105 countries Jurisdiction British Virgin Islands ExpressVPN is our current best VPN pick for people who want a reliable and safe VPN that works on a variety of devices. 61% off with 2yr plan (+4 free months) See at ExpressVPN"
  },
  {
    "title": "RFK Jr. wants a wearable on every American — that future’s not as healthy as he thinks",
    "slug": "rfk-jr-wants-a-wearable-on-every-american-that-futures-not-as-healthy-as-he-thinks",
    "link": "https://www.theverge.com/analysis/756994/rfk-jr-wearables-maha-health-wearables-disordered-eating",
    "published": "2025-08-09 10:00",
    "image": "https://images.unsplash.com/photo-1585409351049-f0d83b76c5dc?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3ZWFyYWJsZSUyMHdpdGhpbiUyMGZvdXIlMjB5ZWFycyUyMC4lMjJ8ZW58MHx8fHwxNzU0NzQ4OTEwfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "I keep hearing the same sentence repeating in my head. \"My vision is that every American is wearing a wearable within four years.\" RFK Jr., our current secretary of the Department of Health and Human Services, said this at a congressional hearing at the end of June. Wearables, he said, are key to the MAHA […]",
    "full_text": "In the hearing, he also cited that his friends had shed pounds and “lost their diabetes diagnosis” thanks to devices like continuous glucose monitors (CGMs). But the way these products and their apps are designed, I didn’t know how to “take control” of my health. What I haven’t shared quite as publicly is that these improvements came at a heavy cost to my mental health. According to my therapist, I had begun showing mild signs of both orthorexia nervosa and anorexia. Food logging is often a prominent feature in wearable apps, like with the Oura Ring. It can be helpful, but there was a time where I’d never allow myself to enjoy this type of meal. Most of these messages come from people who have had a recent health scare, and I usually spend the next hour teaching them how to interpret their baseline data in less absolute terms. These devices overloaded the people in my life with too much information but not enough context. How can anyone effectively “take control of their health” if they’re struggling to understand it? But even if Kennedy were to solve this logistical nightmare, I take issue with framing wearables as a necessary component in anyone’s health journey."
  },
  {
    "title": "Scottish Premiership Soccer: Stream Rangers vs. Dundee Live From Anywhere",
    "slug": "scottish-premiership-soccer-stream-rangers-vs-dundee-live-from-anywhere",
    "link": "https://www.cnet.com/tech/services-and-software/scottish-premiership-soccer-stream-rangers-vs-dundee-live-from-anywhere/#ftag=CAD590a51e",
    "published": "2025-08-09 13:55",
    "image": "https://www.cnet.com/a/img/resize/4073ed4eee6d5668b62274aeb698091ae2d24aef/hub/2025/08/09/bc0b1862-834a-4437-9dd9-79a41b946c07/gettyimages-2228692006.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "It's the first Scottish Premier League home fixture at Ibrox for new Rangers boss Russell Martin.",
    "full_text": "The hosts kicked off their campaign last Saturday with an underwhelming 1-1 draw against Motherwell, but followed that up with a convincing 3-0 win over Czech outfit Viktoria Plzeň to put them on the brink of Champions League qualification. Meanwhile, Dundee have been widely tipped to be among the relegation contenders this term, and come into this game having started their season in disappointing style with a 2-1 defeat at home to Hibernian last weekend. Saturday's Rangers vs. Dundee game will be broadcast in the US on streaming platform Paramount Plus. However, some streaming services may have policies restricting VPN use to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. 61% off with 2yr plan (+4 free months) See at ExpressVPN You can also get Premier Sports through Amazon Prime Video as an add-on for £15 a month. No broadcaster currently has the rights to show SPL games live in Canada this season. Football fans down under can watch select SPL matches live on beIN Sports including today's match at Ibrox. This game is set to be shown on the network's standalone streaming service beIN Sports Connect."
  },
  {
    "title": "Aura’s Aspen impressive digital frame is the most affordable it’s been",
    "slug": "auras-aspen-impressive-digital-frame-is-the-most-affordable-its-been",
    "link": "https://www.theverge.com/tech/756979/aura-aspen-digital-photo-frame-garmin-inreach-mini-2-deal-sale",
    "published": "2025-08-09 09:35",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/VERGE-DEALS-DAILY-IMAGE-14.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "Returning to work or school from summer vacation is never easy, but the Aura Aspen could help you hold onto your favorite memories by putting them front and center. And right now, you can pick up the digital photo frame for around $199 ($30 off) from Amazon, Best Buy, and Aura, which is a new […]",
    "full_text": "Returning to work or school from summer vacation is never easy, but the Aura Aspen could help you hold onto your favorite memories by putting them front and center. My colleague Jennifer Pattison Tuohy found its paper-textured, anti-glare matte display and 1600 x 1200 resolution makes pictures appear sharp and lifelike, while the 4:3 aspect ratio means most smartphone shots should fit perfectly. It even comes with its own adjustable metal stand that looks like one you’d find on a regular photo frame. Like other Aura digital photo frames, you can update it anytime with new photos, whether you’re sending pics of the grandkids to mom’s frame or beaming a college student the latest pictures of the family pet. Just upload pictures via the companion app available on iOS and Android, sync them automatically via iCloud Photos or Google Photos, or email them and they’ll appear. 2021 Kindle Paperwhite with a 90-day warranty starting at FIREFIVE , saving you $65 over buying the latest model. At 6.8-inches, the last-gen e-reader is slightly smaller than its Now through August 13th, Woot is discounting a number of refurbished Kindles and Amazon Fire HD tablets. is on sale for $332.50 ($67 off) while theis $427.50 ($72 off) from Wellbots exclusively for our readers when you apply the codeThose are some of the best prices to date on the small satellite communicators, which lets you text, share your location, receive weather updates, and send SOS alerts to Garmin’s emergency dispatch center when you don’t have cell service. The vegan leather wallet can hold up to four cards and folds out into an adjustable kickstand, allowing you to take video calls or stream in landscape or portrait mode. It also includes NFC passthrough, so you can tap-to-pay without pulling out your credit card."
  },
  {
    "title": "I Ditched My Shoes for These Oka Recovery Slides and My Feet Can't Stop Thanking Me",
    "slug": "i-ditched-my-shoes-for-these-oka-recovery-slides-and-my-feet-can-t-stop-thanking-me",
    "link": "https://www.cnet.com/health/fitness/i-ditched-my-shoes-for-these-oka-recovery-slides-and-my-feet-cant-stop-thanking-me/#ftag=CAD590a51e",
    "published": "2025-08-09 13:00",
    "image": "https://www.cnet.com/a/img/resize/8a9c52c4a879078a7ff0afa219214a004c814e9c/hub/2025/08/07/301c3667-7dd7-4831-a42e-304c5e2e6dfa/oka-recovery-slide-blue-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "I've worn a few different slides over the years, including Oofos, but Oka's are arguably the best I've tested. They're available in a unisex design in a variety of colors.",
    "full_text": "A few years ago I had some pain on the top right side of my right foot that wouldn't go away so I went to a podiatrist to get it checked out. He said it was nothing serious and suggested I purchase a pair of Oofos recovery slides and not only wear them instead of my shoes as much as possible but wear them inside my apartment instead of going barefoot. I like the Oofos -- and they indeed helped cure my foot problem -- but I recently tried a new pair of slides from Oka Recovery that are slightly better. Judging from some comments online, I'm not the only one who's experienced this. Oka says its recovery slides have 35mm of \"buoyant foam,\" 12 cooling vents and \"a wide upper that cradles without squeezing.\" I'm usually a size 10 but the review sample that fit me well was the men's 9/women's 11 (yes, they're unisex). Slip-on recovery clogs are also a good option -- I just tried a pair from Bogs -- but the Oka slides remain my current favorites as far as recovery footwear goes. Although Crocs recovery slides cost closer to $30, most of these premium recovery slides tend to cost about $50 and pretty much everything Oka sells, whether it's slides or flip-flops, costs $50. While Oka's footwear doesn't seem to go on sale, it should be tariff-proof because all of its products are made in the US out of 100% recycled material. While the Oka Recovery footwear brand only launched in February, the company has been around since 1984 making shoes for \"the brands you know and love\" along with its own shoe brands, which include Okabashi and Oka-B."
  },
  {
    "title": "Is This Seat Taken? makes seating fussy people fun",
    "slug": "is-this-seat-taken-makes-seating-fussy-people-fun",
    "link": "https://www.theverge.com/games-review/717713/is-this-seat-taken-review-pc-nintendo-switch-ios-android",
    "published": "2025-08-09 09:00",
    "image": "https://images.unsplash.com/photo-1654741735474-827841af7707?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZWFybHklMjBpbXBvc3NpYmxlJTIwdGFza3xlbnwwfHx8fDE3NTQ3NDUzMTF8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Creating seating arrangements can be pretty stressful; the empath part of me strives to find the perfect seat for every person even if it's a nearly impossible task. If it's for a big, meaningful event, I get even more anxious. When you find the right place for everyone, though, it's even more satisfying than a […]",
    "full_text": "Creating seating arrangements can be pretty stressful; the empath part of me strives to find the perfect seat for every person even if it’s a nearly impossible task. In Is This Seat Taken?, your goal is to place people who are tiny geometric shapes into the right seat that meets their needs. When you place that triangle by the window, they’ll be happy. But drop a smelly square nearby and the triangle will get mad until you find them a better spot or move the square somewhere else. With limited seats and various needs to take into account, the stages can quickly become pretty tricky. Fortunately, the game does a lot to make sure there isn’t too much pressure involved. The shapes are quite charming, which helps me from getting too annoyed with them even if they’re particularly difficult to seat. And if you don’t find a way to make everybody happy, the only “penalty” is that you won’t get enough points to get the gold stars used to unlock secret levels. Why did a square in line at the airport forget to shower? Why does one character have a crush on another?"
  },
  {
    "title": "I went camping in a heat dome, and these five gadgets saved my vacation",
    "slug": "i-went-camping-in-a-heat-dome-and-these-five-gadgets-saved-my-vacation",
    "link": "https://www.theverge.com/smart-home/717771/camping-heat-dome-and-these-gadgets-saved-my-vacation",
    "published": "2025-08-09 09:00",
    "image": "https://images.unsplash.com/photo-1500534314209-a25ddb2bd429?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxncmVhdCUyMHNtb2t5JTIwbW91bnRhaW5zJTIwbmF0aW9uYWwlMjBwYXJrfGVufDB8fHx8MTc1NDc0NTMxMnww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "I recently returned from a family camping trip to Cades Cove in the Great Smoky Mountains National Park. I live in South Carolina, so in mid-July, a trip to the mountains is usually an excellent way to seek out cooler temperatures. Not this year. Thanks to this summer's heat dome, I was facing a week […]",
    "full_text": "is a senior reviewer focused on smart home and connected tech, with over twenty years of experience. I recently returned from a family camping trip to Cades Cove in the Great Smoky Mountains National Park. But the campground didn’t have electrical or water hookups, so we needed our own power and some portable cooling. Normally, you’d expect an RV to provide all of that. Camping can get messy when things go wrong, and it’s a good thing that I review gadgets for a living, as I brought along five that saved our vacation. No hookups for electricity or water meant we needed to bring our own power. This Govee portable Bluetooth speaker / lamp with a built-in battery was very handy when we had to switch off the power. We planned to juice it back up with our gas generator (as I didn’t have any solar panels to recharge it, or much sun in the forest). But we would have slept miserably without it, which my husband gracefully conceded after the first night. My best (blurry) bear shot — this is what we were here for!"
  },
  {
    "title": "Why Donald Trump’s environmental data purge is so much worse this time",
    "slug": "why-donald-trumps-environmental-data-purge-is-so-much-worse-this-time",
    "link": "https://www.theverge.com/science/757084/data-purge-climate-change-environmental-justice-trump",
    "published": "2025-08-09 09:00",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25531807/STK175_DONALD_TRUMP_CVIRGINIA_A.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "Now that we're about halfway into the first year of President Donald Trump's second term, we can take stock of his administration's destruction of online environmental resources. It's worse than last time. It's also, seemingly, just the beginning - paving the way forward for the president's polluting agenda. A watchdog group that monitors publicly-available environmental […]",
    "full_text": "Federal agencies are taking broader swings to ax public resources from their websites this time around, the report shows. They’re hiding which communities are most affected by pollution. “In the second Trump administration, information control was about removing evidence of inequality.” As global warming pushes up sea levels, for example, a 2021 EPA report found that Hispanic and Latino individuals are roughly 50 percent more likely than others to live in coastal areas with the highest estimated increases in traffic delays from worsening high-tide flooding. A press release and PDF of the report are still available online. It simply says “Sorry, but this web page does not exist.” Access to as much as 20 percent of the Environmental Protection Agency website was removed throughout Trump’s first term, according to research EDGI published in 2021. Fortunately, EDGI and other groups have also been working to make data available elsewhere online for the public. Archiving tool Webrecorder also has created mirrors of climate.gov and the US Global Change Research Program website that used to house national climate assessments. Sierra Club and other groups have sued to bring back EJScreen."
  },
  {
    "title": "As a VPN Expert, These Are the VPNs I Recommend for NFL Streaming",
    "slug": "as-a-vpn-expert-these-are-the-vpns-i-recommend-for-nfl-streaming",
    "link": "https://www.cnet.com/tech/services-and-software/as-a-vpn-expert-these-are-the-vpns-i-recommend-for-nfl-streaming/#ftag=CAD590a51e",
    "published": "2025-08-09 13:00",
    "image": "https://www.cnet.com/a/img/resize/8e6b8b7f3a5c12579c7def83b68b5584e6a2874b/hub/2024/05/11/4c39b95f-0f89-4314-9b3d-97cf7ee1370e/vpn-for-streaming.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Using a VPN can help to get the most out of your NFL livestreaming experience for this weekend's preseason matchups. Here's how.",
    "full_text": "I’d throw a couple of logs on the fire and settle in for a full slate of Sunday NFL programming without needing to decipher how to watch the games I wanted to watch. These days, it seems like there are dozens of available options for streaming NFL games, with things getting increasingly complicated every year as additional streaming services enter the fray to secure exclusive rights to high-profile matchups. Two brand-new streaming services from Fox and ESPN joined the lineup this year, giving you even more ways to stream NFL games this season. It takes a lot to watch the NFL in 2025, but using a VPN to stream NFL games can help maximize your streaming capabilities and get you access to even more matchups by routing your internet connection through a different location. Depending on what streaming service you use to watch NFL games, you may only have access to out-of-market matchups or you may only have access to the matchups available on your local network stations. Because a VPN can make it look like you’re using the internet in a different region, your NFL streaming options aren’t limited by your physical location, so you can theoretically watch any live NFL game you want when connected to a VPN. So whether you’re managing multiple fantasy football teams, wagering on the action, avoiding TV blackouts, streaming your home team from abroad or just a casual fan who likes to watch a ton of football, a VPN is a useful addition to your digital toolbox. Not all VPNs perform equally when it comes to streaming -- whether that's NFL games or movies and shows. Based on my decade of experience using, testing and researching VPNs, I recommend using one of the VPNs listed above for streaming NFL games because of each provider's excellent unblocking capabilities and superb performance across operating systems and streaming devices. Just remember to check the terms of service for any streaming service to make sure location-changing isn’t a violation of its terms."
  },
  {
    "title": "'Alien: Earth' Is Surprisingly Cinematic, a Bit Gross and a Whole Lot of Awesome",
    "slug": "alien-earth-is-surprisingly-cinematic-a-bit-gross-and-a-whole-lot-of-awesome",
    "link": "https://www.cnet.com/tech/services-and-software/alien-earth-is-surprisingly-cinematic-a-bit-gross-and-a-whole-lot-of-awesome/#ftag=CAD590a51e",
    "published": "2025-08-09 12:00",
    "image": "https://www.cnet.com/a/img/resize/def26c7a0b583362066db3084eecc1224a7e85d9/hub/2025/07/25/9fdf6675-aa7a-417d-b36e-ce94fc757959/alien-earth-key-art-2.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Review: The prequel series is grand in scope and introduces horrors that reinvigorate Ridley Scott's iconic franchise.",
    "full_text": "If you ask me, it's a great time to be an Alien fan. Heck, I'd go so far as to say it's the best Alien story I've seen since James Cameron put Sigourney Weaver in a power loader back in 1986. Timothy Olyphant plays an aging synthetic named Kirsh in Alien: Earth. However, Alien: Earth introduces a few new concepts to the mix: Cyborgs (humans augmented with machine parts), hybrids (synthetic bodies controlled by human consciousness) and a collection of insidious space insects that add new horrors besides the face-hugging variety. Sure, a chest-bursting sequence in an Alien movie can be unsettling to watch. Babou Ceesay plays Morrow, a cyborg security officer employed by Weyland-Yutani in Alien: Earth. Audiences have never seen Olyphant play a character like the synthetic Kirsh. She is also an advanced synthetic human infused with the consciousness of a child. That said, there is ample room to create something new and explore uncharted ground in the process. Alien fans have trudged through one disappointing movie after another to get here."
  },
  {
    "title": "What&#8217;s a smut peddler to do these days?",
    "slug": "what-s-a-smut-peddler-to-do-these-days",
    "link": "https://www.theverge.com/report/756841/itchio-adult-content-creator-backlash-steam-paypal",
    "published": "2025-08-09 08:00",
    "image": "https://images.unsplash.com/photo-1615229334042-6d97a6a2a347?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsZWZ0JTIwZmVlbGluZyUyMGJldHJheWVkfGVufDB8fHx8MTc1NDc0MTcxMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "In the aftermath of itch.io pulling the sale of over 20,000 pages of adult content, the creators of that work are left feeling betrayed, exhausted, and fearful. The number of platforms that permit the sale of adult material is shrinking, and there's no guarantee the ones that remain will still permit it in the future. […]",
    "full_text": "“This time around, we’re actually doing something about it.” Others have decided to abandon the fickleness of platforms for their own websites. The storefront is one of several in recent years that have embraced adult content only to shun it later when payment processors start asking questions. “This time around, we’re actually doing something about it.” In the UK, where PixelJail lives, the recently implemented Online Safety Act requires that online platforms have “strong age checks” in place to prevent children from accessing pornographic or “harmful” content. “I made my site years ago and didn’t use it much at first,” PixelJail said. While all payment processors have guidelines prohibiting the sale of illegal material, many host platforms overcorrect, banning material that would ostensibly be permitted in order to avoid the increased scrutiny (and cost) hosting that content requires. To blunt the blow caused by platform disruption, creators often turn to their communities, both the ones made up of other creators and those made up of their personal fans. “There are a lot of intense visuals in VILE: Exhumed,” Cara Cadaver wrote. There has virtually never been a stable time to be an adult creator on the internet."
  },
  {
    "title": "Best VPN for iPhone 2025: Boost Your Privacy on the Go",
    "slug": "best-vpn-for-iphone-2025-boost-your-privacy-on-the-go",
    "link": "https://www.cnet.com/tech/services-and-software/best-vpn-for-iphone/#ftag=CAD590a51e",
    "published": "2025-08-09 12:00",
    "image": "https://www.cnet.com/a/img/resize/adc9fbfe682910a9f70aa633c36b107e8536c2b1/hub/2024/04/24/de233b43-f2e8-4a9e-af29-4796b3bcd0ce/vpn-online-safety-protection-9292.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Improve your privacy while browsing the web, stream foreign Netflix libraries and avoid mobile traffic shaping with the best iPhone VPNs on the market.",
    "full_text": "With so many iPhone VPN apps available, it can be difficult to choose the right one. We recommend checking any provider’s privacy policy and reading its audit reports closely, as it’ll give you a good understanding of whether a VPN provider is serious about your privacy. Many of the best VPNs are also rolling out post-quantum protections that help protect against potential future threats from quantum computers, which is essential for privacy-critical users now and in the future. Finally, your provider should offer either a RAM-only server infrastructure or employ full-disk encryption on its hard drives, both of which can help ensure that your data remains secure. Generally, we've found that the best VPNs for iPhone only drop your internet download speed by an average of 25% or less. For bandwidth-demanding applications like competitive gaming or video streaming, you'll want a fast VPN. A good VPN for iPhone should run smoothly and be easy to use, regardless of your technical expertise. For instance, if you're in New York City but connected to a server in the UK, apps like Netflix will think you're across the pond. Luckily, there are plenty of ways to save money on your VPN subscription. (Disclosure: IPVanish is owned by the same parent company as CNET, Ziff Davis.)"
  },
  {
    "title": "Impersonators are targeting companies with fake TechCrunch outreach",
    "slug": "impersonators-are-targeting-companies-with-fake-techcrunch-outreach",
    "link": "https://techcrunch.com/2025/08/08/impersonators-are-targeting-companies-with-fake-techcrunch-outreach/",
    "published": "2025-08-09 00:36",
    "image": "https://images.unsplash.com/photo-1588200618450-3a5b1d3b9aa5?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxpbXBlcnNvbmF0aW5nJTIwdGVjaGNydW5jaCUyMHJlcG9ydGVyc3xlbnwwfHx8fDE3NTQ3NDM1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Fraudsters are impersonating TechCrunch reporters and event leads, and reaching out to companies. Here's what we're doing about it, and what you can look out for.",
    "full_text": "We’ve discovered that scammers are impersonating TechCrunch reporters and event leads and reaching out to companies, pretending to be our staff when they absolutely are not. Here’s an example of the most common scheme we’ve been tracking: Impostors impersonating our reporters to extract sensitive business information from unsuspecting targets. In several cases we know about, scammers have adopted the identity of actual staff members, crafting what looks like a standard media inquiry about a company’s products and requesting an introductory call. But these schemes evolve quickly; bad actors keep refining their tactics, mimicking reporters’ writing styles and referencing startup trends to make their pitches increasingly convincing. As for what to do about it, if someone reaches out claiming to be from TechCrunch and you have even the slightest doubt about whether they’re legitimate, please don’t just take their word for it. We’ve made it easy for you to verify. If you do see someone’s name on our staff page, but our employee’s job description doesn’t square with the request you are receiving (i.e., a TechCrunch copy editor is suddenly very interested in learning about your business! ), a bad actor may be trying to con you. If it sounds like a legitimate request but you want to make doubly certain, you should also feel free to contact us directly and just ask. By being vigilant about verification, you’re not just protecting your own company — you’re helping preserve the trust that legitimate journalists depend on to do their jobs."
  },
  {
    "title": "Sam Altman addresses ‘bumpy’ GPT-5 rollout, bringing 4o back, and the ‘chart crime’",
    "slug": "sam-altman-addresses-bumpy-gpt-5-rollout-bringing-4o-back-and-the-chart-crime",
    "link": "https://techcrunch.com/2025/08/08/sam-altman-addresses-bumpy-gpt-5-rollout-bringing-4o-back-and-the-chart-crime/",
    "published": "2025-08-08 21:06",
    "image": "https://images.unsplash.com/photo-1607215928867-f4d927e310ee?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxyZWRkaXQlMjBhbWElMjBnb3QlMjBzcGljeXxlbnwwfHx8fDE3NTQ3OTIxMDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The Reddit AMA got spicy as users peppered OpenAI with questions, and some asked the company to bring back its previous model.",
    "full_text": "During a Reddit ask-me-anything session on Friday, OpenAI CEO Sam Altman and key members of the GPT-5 team were peppered with questions about the new model and requests to bring back its previous model, GPT-4o. One of the new features that GPT-5 rolled out is a real-time router that decides which model to use for a particular prompt, either responding quickly or taking additional time to “think” through answers. We will make it more transparent about which model is answering a given query,” Altman promised. We are trying to gather more data on the tradeoffs,” he wrote. And Altman also promised, “We are going to double rate limits for Plus users as we finish rollout.” This should give people a chance to play and learn the new model, adopt it to their use cases without worry of running out of monthly prompts. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. GPT-5 reviewer Simon Willison, who had early access and generally liked the model’s performance, also pointed out that turning data into a table was “good example of a GPT-5 failure.”"
  },
  {
    "title": "RIP, Microsoft Lens, a simple little app that’s getting replaced by AI",
    "slug": "rip-microsoft-lens-a-simple-little-app-thats-getting-replaced-by-ai",
    "link": "https://techcrunch.com/2025/08/08/rip-microsoft-lens-a-simple-little-app-thats-getting-replaced-by-ai/",
    "published": "2025-08-08 19:41",
    "image": "https://images.unsplash.com/photo-1623824204241-f851d3bcfaf5?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxoYW5keSUyMG1vYmlsZSUyMHNjYW5uaW5nJTIwYXBwfGVufDB8fHx8MTc1NDgwNjUwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Microsoft is killing Lens, a handy mobile scanning app with over 90 million downloads.",
    "full_text": "Now that app is being discontinued, Microsoft says, as it directs its users to its Copilot AI chat app instead. After that date, no new scans will be possible, but access to prior scans will remain in the app as long as it stays on the user’s device. First launched in 2015, Microsoft Lens (then known as Office Lens) evolved from an application originally designed for Windows Phone devices. While its core functionality was similar to other mobile scanning applications, it didn’t try to upcharge users for certain functionality or push them into a subscription — a rarity in today’s App Store. It also lacks Lens’ accessibility features like read-out-loud and Immersive Reader integration, the site notes. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Despite its age, Lens remains fairly popular, having pulled in over 322,000 downloads on the App Store and Google Play over the past 30 days, according to data from app intelligence provider Appfigures."
  },
  {
    "title": "ChatGPT is bringing back 4o as an option because people missed it",
    "slug": "chatgpt-is-bringing-back-4o-as-an-option-because-people-missed-it",
    "link": "https://www.theverge.com/news/756980/openai-chatgpt-users-mourn-gpt-5-4o",
    "published": "2025-08-08 15:30",
    "image": "https://images.unsplash.com/photo-1576553900855-eb7cbf707841?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxvcGVuYWklMjBjZW8lMjBzYW0lMjBhbHRtYW4lMjBjb25maXJtZWR8ZW58MHx8fHwxNzU0NzY5NjE0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "OpenAI is bringing back GPT-4o in ChatGPT just one day after replacing it with GPT-5. In a post on X, OpenAI CEO Sam Altman confirmed that the company will let paid users switch to GPT-4o after ChatGPT users mourned its replacement. “We will let Plus users choose to continue to use 4o,” Altman says. “We […]",
    "full_text": "OpenAI is bringing back GPT-4o in ChatGPT just one day after replacing it with GPT-5. For months, ChatGPT fans have been waiting for the launch of GPT-5, which OpenAI says comes with major improvements to writing and coding capabilities over its predecessors. But shortly after the flagship AI model launched, many users wanted to go back. “This morning I went to talk to it and instead of a little paragraph with an exclamation point, or being optimistic, it was literally one sentence. As part of GPT-5’s launch, OpenAI removed the model picker from ChatGPT. This dropdown menu previously housed a cluster of OpenAI’s confusingly-named models, allowing users to swap between them for different purposes. “Now it’s just gone, feels like someone died.” Another user called upon other members of the r/ChatGPT subreddit to contact OpenAI if they “miss” GPT-4o. People using ChatGPT for emotional support weren’t the only ones complaining about GPT-5. But many users on the r/ChatGPT subreddit said that the chatbot’s responses were slower, shorter, and less accurate when compared to previous versions. It’s not uncommon for chatbot updates to at least temporarily alienate users with their changes, or for people to mourn old models; one group of fans even recently held a funeral to mark the retirement of Anthropic’s Claude 3 Sonnet."
  },
  {
    "title": "Former Googlers’ AI startup OpenArt now creates ‘brain rot’ videos in just one click",
    "slug": "former-googlers-ai-startup-openart-now-creates-brain-rot-videos-in-just-one-click",
    "link": "https://techcrunch.com/2025/08/08/former-googlers-ai-startup-openart-now-creates-brainrot-videos-in-just-one-click/",
    "published": "2025-08-08 19:01",
    "image": "https://images.unsplash.com/photo-1582499520676-c432ca4c5596?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxoZWxwJTIwY3JlYXRvcnMlMjBtYWtlJTIwYWl8ZW58MHx8fHwxNzU0NzkzOTA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "OpenArt launched a new feature to help creators make AI-generated brain rot videos.",
    "full_text": "AI-generated “brain rot” videos are popping up all over the internet and getting a lot of attention. One startup driving this trend is OpenArt, founded by two former Google employees in 2022. Users can edit individual clips by revisiting the editor’s storyboard mode and tweaking prompts for a more refined result. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. One aspect that OpenArt believes sets it apart is its ability to maintain character consistency. The advanced plan costs $30 per month for 12,000 credits and includes up to 12 One-Click stories. Additionally, the company said it’s on track to achieve an annual revenue rate of over $20 million."
  },
  {
    "title": "Don’t let your competitor steal the brand spotlight — secure your exhibit table at TechCrunch Disrupt 2025",
    "slug": "dont-let-your-competitor-steal-the-brand-spotlight-secure-your-exhibit-table-at-techcrunch-disrupt-2025",
    "link": "https://techcrunch.com/2025/08/08/dont-let-your-competitor-steal-the-brand-spotlight-secure-your-exhibit-table-at-techcrunch-disrupt-2025/",
    "published": "2025-08-08 17:45",
    "image": "https://images.unsplash.com/photo-1634368998864-8984df61cdda?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZWNoY3J1bmNoJTIwZGlzcnVwdHxlbnwwfHx8fDE3NTQ3Njc4MDV8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "For 20 years, startups have come to TechCrunch Disrupt to meet their first investors, land their biggest partnerships, and spark the idea that takes them to the next level.",
    "full_text": "For 20 years, startups have come to TechCrunch Disrupt to meet their first investors, land their biggest partnerships, and spark the idea that takes them to the next level. In 2025, that launchpad could be your exhibit table. Visibility where it counts: No table = no chance to showcase your product to thousands of investors, partners, and press walking the Expo Hall. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Skipping this means leaving serious value on the table. A 6’ x 30” branded exhibit table in the high-traffic Expo Hall for all three days. Shoutouts during key event moments and closing ceremonies."
  },
  {
    "title": "NASA and Google are building an AI medical assistant to keep Mars-bound astronauts healthy",
    "slug": "nasa-and-google-are-building-an-ai-medical-assistant-to-keep-mars-bound-astronauts-healthy",
    "link": "https://techcrunch.com/2025/08/08/nasa-and-google-are-building-an-ai-medical-assistant-to-keep-mars-bound-astronauts-healthy/",
    "published": "2025-08-08 17:17",
    "image": "https://images.unsplash.com/photo-1573804633927-bfcbcd909acd?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxydW5zJTIwaW5zaWRlJTIwZ29vZ2xlJTIwY2xvdWQlMjAlRTIlODAlOTl8ZW58MHx8fHwxNzU0NzkzMDA1fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The multimodal tool, which includes speech, text, and images, runs inside Google Cloud’s Vertex AI environment.",
    "full_text": "As human-spaceflight missions grow longer and travel farther from Earth, keeping crews healthy gets more challenging. Astronauts on the International Space Station can depend on real-time calls to Houston, regular cargo deliveries of medicines, and a quick ride home after six months. All of that may soon change as NASA and its commercial partners, like Elon Musk’s SpaceX, look to conduct longer-duration missions that would take humans to the moon and Mars. The tool, called Crew Medical Officer Digital Assistant (CMO-DA), is designed to help astronauts diagnose and treat symptoms when no doctor is available or communications to Earth are blacked out. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. NASA scientists said in a slide deck that they are planning on adding more data sources, like medical devices, and training the model to be “situationally aware” — that is, attuned to space medicine-specific conditions like microgravity. Cruley was vague about whether Google intends to pursue regulatory clearance to take this type of medical assistant into doctor’s offices here on Earth, but it could be an obvious next step if the model is validated on orbit."
  },
  {
    "title": "How to use Instagram Map and protect your privacy",
    "slug": "how-to-use-instagram-map-and-protect-your-privacy",
    "link": "https://techcrunch.com/2025/08/08/how-to-use-instagram-map-and-protect-your-privacy/",
    "published": "2025-08-08 16:53",
    "image": "https://images.unsplash.com/photo-1678481645061-6d32b3daffc7?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxpbnN0YWdyYW0lMjBoZWFkJTIwYWRhbSUyMG1vc3NlcmklMjByZWFzc3VyZWQlMjB1c2Vyc3xlbnwwfHx8fDE3NTQ4MjE4MDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Following concerns about safety, Instagram head Adam Mosseri reassured users that the feature is opt-in, and noted that some people are “confused” about how the feature works.",
    "full_text": "Following Wednesday’s launch of Instagram’s new Snap Map-like opt-in “Instagram Map” feature — which lets U.S. users share their most recent active location with others and discover location-based content — Instagram head Adam Mosseri is having to reassure people that their location is only visible to others if they decide to share it. Although Meta has made it clear that location sharing is off by default, there have been numerous posts on social media urging users to turn off location sharing, incorrectly claiming that it’s automatically turned on. Mosseri also said that some people are “confused” about how the feature works. It’s worth noting that this isn’t new, as Instagram already had location tags visible to users in its map view. However, the new Instagram Map feature makes this information a lot easier to access. If you turn on your location on Instagram Map, your location only updates when you open the app or have it running in the background, meaning it doesn’t provide continuous, real-time location updates. This is different from Snap Map, which lets users choose whether their location is updated only when they open the app or in real time. For those who want to ensure their location is turned off on Instagram Map, we’ll walk you through the steps below. If it’s your first time accessing the feature, you’ll likely see a pop-up message notifying you about the new Map. Here, you will be able to change your settings."
  },
  {
    "title": "Pinterest CEO says agentic shopping is still a long way out",
    "slug": "pinterest-ceo-says-agentic-shopping-is-still-a-long-way-out",
    "link": "https://techcrunch.com/2025/08/08/pinterest-ceo-says-agentic-shopping-is-still-a-long-way-out/",
    "published": "2025-08-08 16:33",
    "image": "https://images.unsplash.com/photo-1570223054025-abbe1dbfc90e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwaW50ZXJlc3QlMjBjZW8lMjBiaWxsJTIwcmVhZHklMjB0YWxrc3xlbnwwfHx8fDE3NTQ3OTAzMDV8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Pinterest CEO Bill Ready talks about the agentic web and where the social network will fit in the AI era.",
    "full_text": "Investors are likely concerned that if AI began to understand users’ interests, they could preemptively direct users to shop from their own personalized recommendations instead of using platforms like Pinterest. “But when users say things like ‘Pinterest just gets me,’ it’s because they can open the app and the app is going to make recommendations to them proactively on things that they’re really interested in, that align with their taste and their style, the way that a really great personal shopping assistant would,” he said. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Not addressed were the growing user concerns that too much of Pinterest is now filled with AI-generated, low-quality content. The discussion also omitted mention of mass user bans, which users believe stem from an overreliance on poorly designed AI moderation systems. On the call, Ready also spoke about how Pinterest aims to compete in the war for AI talent, saying that people who want to work there care about AI that’s used for good and used “responsibly.” “Both in terms of what we’re doing with tuning AI for positivity, creating a more positive alternative to what’s happening in the rest of social media,” he said."
  },
  {
    "title": "OpenAI priced GPT-5 so low, it may spark a price war",
    "slug": "openai-priced-gpt-5-so-low-it-may-spark-a-price-war",
    "link": "https://techcrunch.com/2025/08/08/openai-priced-gpt-5-so-low-it-may-spark-a-price-war/",
    "published": "2025-08-08 16:10",
    "image": "https://images.unsplash.com/photo-1592917907180-4da58801827f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0b3V0aW5nJTIwZ3B0fGVufDB8fHx8MTc1NDc5NzUwNnww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Developers who have had early access are touting GPT-5's pricing as much better than competing models.",
    "full_text": "“Very happy with the pricing we are able to deliver!” he tweeted. This pricing mirrors Google’s Gemini 2.5 Pro basic subscription, which is also popular for coding-related tasks. (Note that Cursor offered GPT-5 as an option minutes after it was announced.) They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. If so, we could be witnessing the start of a much-awaited LLM price war. Silicon Valley has been hoping that the LLM price-to-performance ratio will eventually improve, along with inference costs. In the face of such enormous expenses, costs typically go one way: up. Yet this week, OpenAI threw down the gauntlet to put pressure on prices not just once but twice."
  },
  {
    "title": "SoftBank reportedly bought Foxconn’s Ohio factory for the Stargate AI project",
    "slug": "softbank-reportedly-bought-foxconns-ohio-factory-for-the-stargate-ai-project",
    "link": "https://techcrunch.com/2025/08/08/softbank-reportedly-bought-foxconns-ohio-factory-for-the-stargate-ai-project/",
    "published": "2025-08-08 16:00",
    "image": "https://images.unsplash.com/photo-1539876782331-cdcf975877af?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmb3hjb25uJTIwc3BlbnQlMjB5ZWFycyUyMHByb21pc2luZyUyMGVsZWN0cmljJTIwdmVoaWNsZXMlMjB3b3VsZHxlbnwwfHx8fDE3NTQ3Njk2MDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Foxconn spent years promising electric vehicles would be built at the former Chevy Cruze factory. Now it will make AI servers.",
    "full_text": "The report comes just a few days after Foxconn announced it had sold the factory, along with electric vehicle manufacturing equipment that was inside of it, to a buyer it only referred to as “Crescent Dune LLC” — an entity that was created in Delaware in late July. Neither company immediately responded to requests for comment. It’s unclear what this means for Monarch Tractor, a California-based startup that develops electric and autonomous farm equipment. Monarch CEO Praveen Penmetsa has not responded to emailed requests for comment. SoftBank, OpenAI, and Oracle announced the Stargate project one day after Donald Trump’s inauguration. The effort currently involves a large data center that is being built in Texas, but the companies involved have said they want to build infrastructure in other states and countries. In May, Bloomberg reported that SoftBank was struggling to line up funding for the project and that it was already being hampered by Trump’s myriad trade wars. Foxconn bought the factory in late 2021 from electric vehicle startup Lordstown Motors. At the time, Foxconn chairman Young Liu said his company wanted to develop the site into the “most important electric vehicle manufacturing and R&D hub in North America.” Prospective customers like Fisker Inc. and California startup IndiEV also went out of business."
  },
  {
    "title": "What founders need to know before choosing their exit — straight from Jai Das and Roseanne Wincek — at TechCrunch Disrupt 2025",
    "slug": "what-founders-need-to-know-before-choosing-their-exit-straight-from-jai-das-and-roseanne-wincek-at-techcrunch-disrupt-2025",
    "link": "https://techcrunch.com/2025/08/08/what-founders-need-to-know-before-choosing-their-exit-at-techcrunch-disrupt-2025/",
    "published": "2025-08-08 14:30",
    "image": "https://images.unsplash.com/photo-1703192163733-be72ef568828?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZWNoY3J1bmNoJTIwZGlzcnVwdCUyMDIwMjV8ZW58MHx8fHwxNzU0ODIzNjA2fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Hear from Jai Das, Sapphire Ventures, and Roseanne Wincek, Renegade Partners, on how founders can prep for an exit at TechCrunch Disrupt 2025. Register here.",
    "full_text": "That’s why we’re bringing this essential conversation to the Going Public Stage at TechCrunch Disrupt 2025, happening October 27-29 in San Francisco’s Moscone West. Whether you’re already eyeing a liquidity event or just starting to scale, this is your chance to hear what top VCs are looking for and how to set up your company for long-term success. Two of the best in the business — Roseanne Wincek of Renegade Partners and Jai Das of Sapphire Ventures — will break down the decision-making process, from when to make a move to how to be ready when the moment comes. Why this session belongs on your calendar Startups can no longer afford to treat exit planning as an afterthought. It’s a candid, high-level look at how the best founders are preparing for every possible outcome. He’s led investments in more than a dozen IPOs and two dozen acquisitions, with a deep focus on enterprise tech and AI-driven SaaS. Get in the room where high-impact decisions start TechCrunch Disrupt 2025 brings together over 10,000 startup and VC leaders from around the world, and this session is your front-row seat to one of the most important conversations founders will face. Register now to get your pass for Disrupt (with savings of up to $600+) and take the guesswork out of your exit strategy."
  },
  {
    "title": "Meta acquires AI audio startup WaveForms",
    "slug": "meta-acquires-ai-audio-startup-waveforms",
    "link": "https://techcrunch.com/2025/08/08/meta-acquires-ai-audio-startup-waveforms/",
    "published": "2025-08-08 14:24",
    "image": "https://images.unsplash.com/photo-1598620616655-7fce1a6fdf87?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwZXIlMjBwaXRjaGJvb2slMjBkYXRhfGVufDB8fHx8MTc1NDc3MDUwN3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "WaveForms, founded just eight months ago, last raised $40 million in a round led by Andreessen Horowitz that valued the company at $160 million pre-money, per PitchBook data.",
    "full_text": "In Brief Meta has acquired AI voice startup WaveForms for an undisclosed sum, The Information reports. It’s the company’s latest buy to strengthen its new AI unit, Superintelligence Labs, and Meta’s second major AI audio acquisition in the last month after it bought PlayAI. WaveForms, founded just eight months ago, raised $40 million from Andreessen Horowitz in a round that valued the company at $160 million pre-money, per PitchBook data. Two of the startup’s co-founders — former Meta and OpenAI researcher Alexis Conneau, and former Google advertising strategist Coralie Lemaitre — have reportedly joined Meta. While at OpenAI, Conneau co-created GPT4-o Advanced Voice Mode neural networks. TechCrunch has reached out to WaveForms to find out whether its chief technologist, Kartikay Khandelwal, will also join Meta, as well as the outcome of the deal for the roughly 14 other staffers (per LinkedIn) at the company. WaveForms appears to have taken down its own website, but the company’s LinkedIn page describes its mission as solving the “Speech Turing Test,” which tries to measure if a listener can distinguish between human and AI-generated speech. WaveForms was also developing “Emotional General Intelligence,” which focuses on understanding individual self-awareness and management. Correction: A previous version of this article misstated Khandelwal’s role at WaveForms."
  },
  {
    "title": "Google tests revamped Google Finance with AI upgrades, live news feed",
    "slug": "google-tests-revamped-google-finance-with-ai-upgrades-live-news-feed",
    "link": "https://techcrunch.com/2025/08/08/google-tests-revamped-google-finance-with-ai-upgrades-live-news-feed/",
    "published": "2025-08-08 13:50",
    "image": "https://images.unsplash.com/photo-1578016981482-d4dd3db297b1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhY2Nlc3MlMjBhZHZhbmNlZCUyMGNoYXJ0aW5nJTIwdG9vbHN8ZW58MHx8fHwxNzU0NzgwNDA4fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Users will now be able to research their financial questions with AI, access advanced charting tools, and get real-time data and news.",
    "full_text": "Google announced on Friday that it’s giving Google Finance, its tool that provides financial information and business news, an AI update. Users will now be able to research their financial questions with AI, access advanced charting tools, and get real-time data and news. With the update, users can now ask detailed questions about finance and get a comprehensive AI response that includes links to relevant sites. Instead of having to look up individual stock details, users can ask complex questions in one go. As for the new charting tools, Google says these “will help you visualize financial data beyond simple asset performance. You can view technical indicators, like moving average envelopes, or adjust the display to see candlestick charts and more.” Google Finance is also getting additional market data, including commodities and additional cryptocurrencies. Additionally, there’s a new live news feed that lets you see real-time headlines. With this update, Google is looking to take on platforms like Yahoo Finance and Seeking Alpha. The company also likely hopes that by supercharging Google Finance with AI answers and charts, people are less likely to leave the service and go to an AI chatbot like ChatGPT for answers to complex questions."
  },
  {
    "title": "Openvibe combines news and social media in one app",
    "slug": "openvibe-combines-news-and-social-media-in-one-app",
    "link": "https://techcrunch.com/2025/08/08/openvibe-combines-news-and-social-media-in-one-app/",
    "published": "2025-08-08 13:00",
    "image": "https://images.unsplash.com/photo-1612643557374-13914ebd60c6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzb2NpYWwlMjBuZXR3b3JraW5nJTIwYXBwc3xlbnwwfHx8fDE3NTQ3ODQ5MDd8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The addition makes Openvibe more useful for keeping up with your interests and other important information without having to switch between multiple newsreaders, websites, or social networking apps.",
    "full_text": "The addition makes Openvibe more useful for keeping up with your interests and other important information without having to switch between multiple newsreaders, websites, or social networking apps. Openvibe CEO Matej Svancer says RSS support was always part of the app’s longer-term roadmap since its launch last year. While RSS can also be used to track podcasts and YouTube channels, Openvibe isn’t yet focused on those formats, Svancer tells TechCrunch. It may be technically possible to add them in the app today, but it won’t offer a good user experience, he explains — unless you don’t mind having to open each item in a browser. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. The company has been testing the RSS feature ahead of launch with just over 100 people who have, combined, added over 4,000 feeds. RSS support is now available in Openvibe’s iOS and Android apps."
  },
  {
    "title": "xAI’s legal chief steps down after whirlwind year",
    "slug": "xais-legal-chief-steps-down-after-whirlwind-year",
    "link": "https://techcrunch.com/2025/08/07/xais-legal-chief-steps-down-after-whirlwind-year/",
    "published": "2025-08-08 04:49",
    "image": "https://images.unsplash.com/photo-1653498290920-a6277e169727?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsaWZldGltZSUyMCUyQyUyMiUyMHJvYmVydCUyMGtlZWxlJTIwc2FpZHxlbnwwfHx8fDE3NTQ3NzQxMTN8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Despite calling his time at xAI \"incredible\" and working with Musk \"the adventure of a lifetime,\" Robert Keele said he couldn't keep \"riding two horses at once — the family and the job.\"",
    "full_text": "Robert Keele said this week that he has stepped down as xAI’s head of legal after just over a year, saying he wants to spend more time with his children. In his announcement, Keele also acknowledged “daylight between our worldviews” with boss Elon Musk, who hasn’t commented on Keele’s exit. “I love my two toddlers and I don’t get to see them enough,” Keele wrote, posting the news on both X and LinkedIn. Keele arrived just before xAI announced a massive $6 billion Series B funding round in May 2024, backed by heavy hitters like Andreessen Horowitz and Sequoia Capital, valuing the company at $24 billion. Before his entrepreneurial stint, Keele had been head of legal at autonomous aircraft maker Elroy Air and general counsel at Airbus’ Silicon Valley innovation center. X CEO Linda Yaccarino left last month, and Tesla has lost several top executives recently. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "Tesla shuts down Dojo, the AI training supercomputer that Musk said would be key to full self-driving",
    "slug": "tesla-shuts-down-dojo-the-ai-training-supercomputer-that-musk-said-would-be-key-to-full-self-driving",
    "link": "https://techcrunch.com/2025/08/07/tesla-shuts-down-dojo-the-ai-training-supercomputer-that-musk-said-would-be-key-to-full-self-driving/",
    "published": "2025-08-07 22:19",
    "image": "https://images.unsplash.com/photo-1511548774318-563182fe8d03?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhaSUyMGNvbXBhbnklMjBkdWJiZWQlMjBkZW5zaXR5YWklMjBmb2N1c2VkfGVufDB8fHx8MTc1NDc5OTMwOHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The disbanding of Tesla’s Dojo efforts follows the departure of around 20 workers, who left the automaker to start their own AI company dubbed DensityAI focused on data center services for industries.",
    "full_text": "CEO Elon Musk has pushed to get shareholders to view Tesla as an AI and robotics company, despite a limited robotaxi launch in Austin this past June that featured Model Y vehicles with a human in the front passenger seat and resulted in a number of reported incidents of the vehicles exhibiting problematic driving behavior. Musk has said that Dojo would be the cornerstone of Tesla’s AI ambitions and its goal to reach full self-driving due to its ability to “process truly vast amounts of video data.” He talked about Dojo, albeit briefly, as recently as the company’s second-quarter earnings call. Just last year, Musk noted that Tesla’s AI team would “double down” on Dojo in the lead-up to Tesla’s robotaxi reveal, which happened in October. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. But talk about Dojo halted around August 2024, when Musk began touting Cortex instead, Tesla’s “giant new AI training supercluster being built at Tesla HQ in Austin to solve real-world AI.” The automaker also said it was working on a next-gen D2 chip that would solve any information flow bottlenecks of its predecessor. During Tesla’s second-quarter earnings call, Musk hinted at potential redundancies."
  },
  {
    "title": "Rocket Lab eyes big defense opportunities with new acquisition",
    "slug": "rocket-lab-eyes-big-defense-opportunities-with-new-acquisition",
    "link": "https://techcrunch.com/2025/08/07/rocket-lab-eyes-big-defense-opportunities-with-new-acquisition/",
    "published": "2025-08-07 21:23",
    "image": "https://images.unsplash.com/photo-1493934558415-9d19f0b2b4d2?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzcGFjZSUyMGNvbXBhbnl8ZW58MHx8fHwxNzU0ODI3MjA5fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Rocket Lab is taking the concept of an 'end-to-end' space company to new heights with a forthcoming acquisition.",
    "full_text": "The results also highlighted the company’s acquisition strategy and how its purchase of a new optical payloads company will make it more competitive for lucrative government contracts. The company’s net loss widened to $66.4 million. Rocket Lab founder and CEO Peter Beck highlighted the “busy quarter of M&A activity” as the company gets close to closing its deal to buy Geost, a company that builds optical payloads. Through that acquisition, which will close at $275 million in cash and equity, Rocket Lab is opening a new business unit called Optical Systems to scale electro-optical and infrared sensor manufacturing. The acquisition is also one part of a larger play from Rocket Lab — spelled out quite explicitly in the company’s earnings presentation — to bid for multibillion-dollar DOD initiatives like Golden Dome. Rocket Lab has already won some major defense contracts, including a $515 million, 18-satellite build contract to support the Space Development Agency’s constellation of missile-tracking satellites. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "High costs and thin margins threatening AI coding startups",
    "slug": "high-costs-and-thin-margins-threatening-ai-coding-startups",
    "link": "https://techcrunch.com/2025/08/07/the-high-costs-and-thin-margins-threatening-ai-coding-startups/",
    "published": "2025-08-07 21:05",
    "image": "https://images.unsplash.com/photo-1505238680356-667803448bb6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjb2RpbmclMjBhc3Npc3RhbnQlMjBzdGFydHVwc3xlbnwwfHx8fDE3NTQ3OTg0MTR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Coding assistant startups are highly unprofitable, says a source familiar with Windsurf financials.",
    "full_text": "That deal didn’t happen, according to a source familiar with the matter. Insiders tell TechCrunch that for all the popularity and hype around AI coding assistants, they can actually be massively money-losing businesses. This is a challenge compounded by fierce competition in the vibe-coding and code-assist market. Rivals include companies that already have huge customer bases like Anysphere’s Cursor and GitHub Copilot. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “Margins on all of the ‘code gen’ products are either neutral or negative. Anysphere CEO Michael Truell later apologized for unclear communication about the pricing change in a blog post."
  },
  {
    "title": "IPO hopeful Brex scored major win to sell in the EU, plans UK expansion",
    "slug": "ipo-hopeful-brex-scored-major-win-to-sell-in-the-eu-plans-uk-expansion",
    "link": "https://techcrunch.com/2025/08/07/ipo-hopeful-brex-scored-major-win-to-sell-in-the-eu-plans-uk-expansion/",
    "published": "2025-08-07 18:52",
    "image": "https://images.unsplash.com/photo-1589704976002-9eb970d55a31?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3b3JrYXJvdW5kcyUyMHJlcXVpcmVkJTIwJTJDJTIyJTIwY2VvJTIwcGVkcm8lMjBmcmFuY2VzY2hpJTIwc2FpZHxlbnwwfHx8fDE3NTQ3MTI5MTF8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The EU has authorized Brex to sell its spend management products directly in all 30 countries, \"no workarounds required,\" CEO Pedro Franceschi said.",
    "full_text": "That means it can now directly issue credit and debit cards and offer its spend management products to any business in all 30 EU countries with “no workarounds required,” as co-founder and CEO Pedro Franceschi wrote in a blog post. While the corporate spend management startup previously supported 60 currencies in 200 countries, it could only sell its products to companies with a U.S. presence. With the expansion, Brex is now authorized to sell spend management (complete with issuing cards) and other tools like embedded payments to EU companies and startups, a spokesperson tells TechCrunch. However, there’s a caveat: Banking and bill pay will not be initially available. Brex’s claim to fame is offering startups expense management cards for their employees even if they wouldn’t yet qualify from traditional banks. Without a bank account offering, the youngest EU startups will still have to weigh their options. That’s quite the turnaround from a shaky moment in 2023 when Brex conducted layoffs and reportedly told employees that its cash burn was too high. There has been no hint yet as to when that IPO may take place, though. Brex’s competitive win in the international market comes as its U.S. fintech competitors are having an overall moment. Brex has not publicly announced new equity VC funding since 2022, when it raised $300 million in a Series D-2 round at a $12.3 billion valuation."
  }
]