[
  {
    "title": "Google denies AI search features are killing website traffic",
    "slug": "google-denies-ai-search-features-are-killing-website-traffic",
    "link": "https://techcrunch.com/2025/08/06/google-denies-ai-search-features-are-killing-website-traffic/",
    "published": "2025-08-06 19:45",
    "image": "https://images.unsplash.com/photo-1662589537825-892db53c0556?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxpbXBhY3RpbmclMjBzZWFyY2glMjBhY3Jvc3N8ZW58MHx8fHwxNzU0NTEwNDA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Google denies AI is impacting search across the web, saying only \"some\" sites have suffered.",
    "full_text": "But Google on Wednesday denied that’s the case, at least in aggregate. Instead, the search giant says that total organic click volume from its search engine to websites has been “relatively stable” year-over-year and that average click quality has slightly increased. That word “some” is doing heavy lifting here, as Google doesn’t share data about how many sites are gaining or losing. Google also allows users to interact with an AI chatbot for some queries. Yet Google denies that this is significantly reshaping the search landscape. Back in 2022, a Google exec even said that social sites like TikTok and Instagram were eating into Google’s core products, like Search and Maps. Google has also long been worried that Amazon.com had become people’s first stop for online shopping searches, and Reddit.com had become the first stop for researching topics of interest. The company only points out that when people click through on an AI response to the source, they’re more likely to dive deeper, so those clicks are more valuable. One recent study from Similarweb indicates that the number of news searches on the web resulting in zero clicks to news websites has grown from 56% (when Google launched AI Overviews in May 2024) to 69% as of May 2025. It’s as if Google wants publishers to believe not what their own eyes — and graphs and charts — tell them, but instead take comfort in the fact that Google still sends “billions of clicks to websites” every day, just as the post claims."
  },
  {
    "title": "A rival Tea app for men is leaking its users’ personal data and driver’s licenses",
    "slug": "a-rival-tea-app-for-men-is-leaking-its-users-personal-data-and-drivers-licenses",
    "link": "https://techcrunch.com/2025/08/06/a-rival-tea-app-for-men-is-leaking-its-users-personal-data-and-drivers-licenses/",
    "published": "2025-08-06 19:40",
    "image": "https://images.unsplash.com/photo-1577228159816-2ab72a38c22b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsZWFzdCUyMG9uZSUyMG1ham9yJTIwc2VjdXJpdHklMjBmbGF3fGVufDB8fHx8MTc1NDUwOTUwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The newly launched app, now trending on Apple's App Store, contains at least one major security flaw that exposes the private information of its users, including their uploaded selfies and government-issued IDs.",
    "full_text": "Tea is advertised as a women’s safety app with more than six million users that is similar to “Are we dating the same guy?” Facebook networks. But like the app it sought to emulate, TeaOnHer contains security flaws of its own. TechCrunch has found at least one security flaw that allows anyone access to data belonging to TeaOnHer app users, including their usernames and associated email addresses, as well as driver’s licenses and selfies that users uploaded to TeaOnHer. TeaOnHer was uploaded to the iOS App Store by a developer named Newville Media Corporation. According to LinkedIn, the founder and CEO of this company is Xavier Lampkin. TechCrunch identified at least one TeaOnHer record associated with Lampkin’s own data. Along with its security flaws, the content portrayed within TeaOnHer is troubling in itself. While the app requests IDs and selfies from its users to verify their identities — a process that is not automatic — users can access a “guest” view of the app without signing in. Immediately upon opening “guest” view, TechCrunch saw several images of the same naked woman, posted under different names in a form of spam. Other posts share the photos and names of women, alongside comments calling them “easy,” or accusing them of spreading sexually transmitted infections."
  },
  {
    "title": "Federal regulators give Zoox an exemption for its custom-built robotaxis",
    "slug": "federal-regulators-give-zoox-an-exemption-for-its-custom-built-robotaxis",
    "link": "https://techcrunch.com/2025/08/06/federal-regulators-give-zoox-an-exemption-for-its-custom-built-robotaxis/",
    "published": "2025-08-06 19:02",
    "image": "https://images.unsplash.com/photo-1649472307167-5014126dd571?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxvd25lZCUyMGF1dG9ub21vdXMlMjB2ZWhpY2xlJTIwY29tcGFueXxlbnwwfHx8fDE3NTQ1MDc3MDN8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "NHTSA is also closing an investigation into the Amazon-owned autonomous vehicle company.",
    "full_text": "The National Highway Traffic Safety Administration has given Zoox an exemption to demonstrate its custom-built robotaxis on public roads and closed a related investigation into whether the Amazon-owned company had sidestepped federal regulations. The company has since expanded its testing footprint to Las Vegas and San Francisco. NHTSA’s announcement is connected to its new national framework, which the agency argues will make it easier for companies to deploy autonomous vehicles without traditional manual driving controls — like steering wheels, pedals, and sideview mirrors — at scale. The framework, known as AV STEP (or ADS-Equipped Vehicle Safety, Transparency and Evaluation Program), allows NHTSA to green-light the sale and commercialization of autonomous vehicles that are not compliant with federal safety standards due to a lack of manual controls. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Zoox spokesperson Whitney Jencks said in an email that Zoox is working in close cooperation with NHTSA on this process, beginning with the demonstration exemption and followed by the commercial exemption. Zoox has agreed to remove or cover all statements that its purpose-built vehicles comply with applicable Federal Motor Vehicle Safety Standards."
  },
  {
    "title": "How to actually raise a seed round: Actionable advice from top investors at TechCrunch Disrupt 2025",
    "slug": "how-to-actually-raise-a-seed-round-actionable-advice-from-top-investors-at-techcrunch-disrupt-2025",
    "link": "https://techcrunch.com/2025/08/06/how-to-actually-raise-a-seed-round-actionable-advice-from-top-investors-at-techcrunch-disrupt-2025-on-july-15/",
    "published": "2025-08-06 18:48",
    "image": "https://images.unsplash.com/photo-1602567781778-3e37e0550c39?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0eXBpY2FsJTIwdmVudHVyZSUyMHBhbmVsfGVufDB8fHx8MTc1NDUwNjgwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "This isn’t your typical venture panel. Expect sharp insights on how to cut through the noise, structure your raise, and build relationships that last beyond a term sheet. Whether you're gearing up for your first round or advising a founder who is, this is the TC Disrupt session you don’t want to miss.",
    "full_text": "TechCrunch Disrupt 2025 returns to Moscone West in San Francisco from October 27-29, bringing together more than 10,000 startup and VC leaders for an inside look at where innovation is headed. Register now to save up to $675 on your ticket and join this conversation — plus 200+ more sessions across five industry stages, roundtables, and breakouts. From shaping a compelling pitch to choosing the right capital partners, they’ll share honest, actionable insights to help founders translate interest into investment. She holds an MBA from Yale and a BS in chemical engineering. Marlon Nichols, co-founder and managing general partner of MaC Venture Capital, leads one of North America’s top seed-stage firms with over $600 million AUM (assets under management). Whether you’re gearing up for your first round or advising a founder who is, this is the session you don’t want to miss. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "First impressions of Alexa+, Amazon’s upgraded, AI-powered digital assistant",
    "slug": "first-impressions-of-alexa-amazons-upgraded-ai-powered-digital-assistant",
    "link": "https://techcrunch.com/2025/08/06/first-impressions-of-alexa-amazons-upgraded-ai-powered-digital-assistant/",
    "published": "2025-08-06 18:27",
    "image": "https://images.unsplash.com/photo-1570562457207-9c0c00274740?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxiZXN0JTIwc21hcnQlMjBhc3Npc3RhbnR8ZW58MHx8fHwxNzU0NTA1MDA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "To find out whether Alexa is still the best smart assistant for my family, I'm going to test Amazon's AI-powered devices, experiment with AI queries, and write out my thoughts in a multi-part series.",
    "full_text": "But before we can get to that, let’s see how Alexa+ handles the basics. While it’s a bit tedious to do so — and something that could be even more tedious in time as more services are added — I did appreciate that it felt like I was in control of the data sharing and could see exactly what each service was requesting before agreeing. In this section, there was also a list of services I had previously linked with Alexa. I mean, would it not make sense to just remove the broken thing that no longer exists? It felt more natural, but there’s a very slight lag with her responses at times. Alexa: Sure, I’d be happy to remember your Delta SkyMiles number for you. Alexa: I don’t see any information specifically for [grade] in that email. Me: Alexa, I want to know when the Glow Recipe Plum Plumping and Hydrating Hyaluronic Acid Skin Care Serum goes on sale. I’ve already set up a deal tracker for the Glow Recipe Plum Plumping Serum. (Long pause) I found the Coach Swinger handbag, but it’s currently available in black."
  },
  {
    "title": "I tested 30 smart locks, and these are the best",
    "slug": "i-tested-30-smart-locks-and-these-are-the-best",
    "link": "https://www.theverge.com/23393163/best-smart-door-lock",
    "published": "2025-08-06 14:23",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/257776_Smart_lock_buying_guide_CVirginia3.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "A smart lock is an easy solution to some common problems. Locked yourself out? Need to let a friend in to water the plants? Your latchkey kid lost their key? Hands are full, and it’s raining cats and dogs? A smart lock solves all of these problems and more. One of the best smart home […]",
    "full_text": "We have four exterior doors, so it saves me from walking around the house at night checking everything is secure. It unlocks just as I approach my porch, making coming home and opening the door a virtually hands-free experience. The Select can also auto-lock based on your location, not just after a set amount of time as most locks offer. Kwikset’s solution allows you to use its advanced features today while still having the future-proofing potential of Matter for tomorrow. Support for other platforms and remote unlocking comes through Yale’s ingenious swappable networking modules, which cost around $80 each. Yale promised support for Matter via a Matter-over-Thread module back in 2022, but this still hasn’t materialized. Home Key took a while to gain adoption, but there are now several options (and should soon be more as Apple has made it part of Matter). Level locks work over Bluetooth out of the box and can connect to an Apple Home hub for out-of-home control. But packages and people were clearly visible, which is most of what you want to see with a doorbell camera. The downside is that not all platforms support creating PIN codes for Matter smart locks with keypads (Google Home and Alexa don’t offer this yet)."
  },
  {
    "title": "When Will the iPhone 17 Be Released? We're Running Down the Possibilities",
    "slug": "when-will-the-iphone-17-be-released-we-re-running-down-the-possibilities",
    "link": "https://www.cnet.com/tech/mobile/when-will-the-iphone-17-be-released-were-running-down-the-possibilities/#ftag=CAD590a51e",
    "published": "2025-08-06 18:20",
    "image": "https://www.cnet.com/a/img/resize/83ba834275905a2f2ae314c512d3d67c7ba46618/hub/2025/06/18/efcc498a-d738-4252-b330-8f11c36cce90/iphone-17-rumors-vt-v04-00000.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The projected release date of Apple's biggest product is starting to come into focus.",
    "full_text": "It's fun to speculate on which features the new iPhone 17 lineup will have, but what we really want to know is when we can get our hands on Apple's latest editions of its flagship smartphone. As we get closer to September and the traditional announcement date, iPhone rumors are arriving more frequently. One recent leak points to Apple holding the iPhone 17 event on Sept. 9. German site iPhone-Ticker claims that it gained access to internal documents from a local carrier, and even though the sourcing cannot be confirmed, that release date lines up with existing rumors and expert opinion. For nearly a decade, Apple has announced its new iPhone lineup in early September. The supposed leak reported on by iPhone-Ticker lines up with expert opinion, so you might want to mark your calendar for Sept. 9 if you want to catch the new iPhone event. Here's a chart for the release dates of previous iPhone models: Here's a chart for the potential dates based on past schedules. Apple is expected to change its release format with the rumored iPhone 18. Reports suggest that Apple will only release higher-end models in fall 2026 -- iPhone 18 Pro, Pro Max, Air and a rumored new foldable iPhone -- and release the rest of the line in winter 2027."
  },
  {
    "title": "Google takes on ChatGPT’s Study Mode with new ‘Guided Learning’ tool in Gemini",
    "slug": "google-takes-on-chatgpts-study-mode-with-new-guided-learning-tool-in-gemini",
    "link": "https://techcrunch.com/2025/08/06/google-takes-on-chatgpts-study-mode-with-new-guided-learning-tool-in-gemini/",
    "published": "2025-08-06 18:18",
    "image": "https://images.unsplash.com/photo-1515073838964-4d4d56a58b21?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhbHNvJTIwb2ZmZXJpbmclMjBzdHVkZW50c3xlbnwwfHx8fDE3NTQ1MDUwMDV8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Google is also offering students in the U.S., Japan, Indonesia, Korea, and Brazil a free one-year subscription to its AI Pro plan.",
    "full_text": "The tool sort of functions like an AI tutor, as it’s designed to help users build a deep understanding instead of just getting answers. The launch follows just over a week after OpenAI rolled out Study Mode for ChatGPT, which is also designed to go beyond simply obtaining answers to questions by actually helping users develop critical thinking skills. Both companies’ launches come amid concerns that AI chatbots undermine the learning process because they spit out direct answers. The new tools from Google and OpenAI likely aim to address these concerns by positioning their chatbots as learning tools rather than simple answer engines. With Guided Learning, Gemini will break down problems step-by-step and adapt explanations to its users’ needs. Plus, users can now also ask Gemini to create flashcards and study guides based on their quiz results or other class materials. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "The Jurassic Park islands and dinos are coming to Microsoft Flight Simulator 2024",
    "slug": "the-jurassic-park-islands-and-dinos-are-coming-to-microsoft-flight-simulator-2024",
    "link": "https://www.theverge.com/news/720070/orbx-universal-jurassic-world-park-dinosaurs-microsoft-flight-simulator-2-024",
    "published": "2025-08-06 14:07",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/jurassic_flightsim1.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "Jurassic World: Archipelago is a new expansion pack for Microsoft Flight Simulator 2024 that lets aspiring pilots explore the five islands of the fictional Cinco Muertes Archipelago featured in the Jurassic Park and Jurassic World movies. Created by Australian developer Orbx that’s known for its flight sim add-ons, the expansion lets you visit many locations […]",
    "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid. Jurassic World: Archipelago is a new expansion pack for Microsoft Flight Simulator 2024 that lets aspiring pilots explore the five islands of the fictional Cinco Muertes Archipelago featured in the Jurassic Park and Jurassic World movies. Created by Australian developer Orbx that’s known for its flight sim add-ons, the expansion lets you visit many locations from the films while the islands will be teeming with more than 10 different species of dinosaurs. According to an FAQ on Orbx Studios’ website, the Jurassic World: Archipelago expansion is an official collaboration with Universal Products & Experiences and will be available sometime in late August or early September, 2025. It will initially launch for all versions of Microsoft Flight Simulator 2024 on Xbox and PC, but is compatible with the entry-level Standard Edition which is also available through Xbox Game Pass. The studio says it’s also “working towards making compatible products for Microsoft Flight Simulator 2020 and X-Plane 12.” The expansion lets you visit the five new islands — including Isla Nublar, Sorna, Matanceros, Peña, and Tacaño — as they were before the events of 2015’s Jurassic World “when the park is operational but not everything is under control.” You’ll be able to fly over Isla Nublar and see the park alive with activity, while the breeding facilities on Isla Sorna, as seen in The Lost World: Jurassic Park, remain abandoned and overgrown. Jurassic World: Archipelago includes new flying challenges like transporting VIPs between the islands and nearby Costa Rica and conducting guided tours. You can visit the facilities and theme park structures seen in the various films and land at recognizable airfields and helipads, all while dodging the local wildlife that includes brachiosaurus, stegosaurus, velociraptor, t.rex, and flying pteranodons."
  },
  {
    "title": "'South Park' Season 27, Episode 2: How to Watch Without Cable",
    "slug": "south-park-season-27-episode-2-how-to-watch-without-cable",
    "link": "https://www.cnet.com/tech/services-and-software/south-park-season-27-episode-2-how-to-watch-without-cable/#ftag=CAD590a51e",
    "published": "2025-08-06 18:07",
    "image": "https://www.cnet.com/a/img/resize/d36890995e03834d433d528e77307ac91320df42/hub/2025/08/06/0e556889-9e0c-4085-9dd0-c6113d7a6a56/south-park.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "New episodes stream on Paramount Plus.",
    "full_text": "South Park season 27 didn't air a new episode last week, but fans won't have to wait too much longer for the second installment of the satirical show. Episode 2 of the hit animated series drops later today, and you can watch the trailer if you haven't already. After a hectic rollout that included a premiere-date push, South Park's new season is underway and its streaming home is now clear. Per a report from Deadline, five upcoming seasons and the show's back catalog will be on Comedy Central and Paramount Plus with the signing of a new deal. Forthcoming episodes of South Park season 27 will stream on Paramount Plus in the US the day after airing on Comedy Central. As for what the new season will entail, we have the above video for reference -- which starts sort of like a horror movie trailer before fires are unleashed, the Statue of Liberty is dismantled and disastrous plane collisions occur. If you want to watch the 27th season of the show co-created by Trey Parker and Matt Stone, here's what to know. South Park season 27, episode 2 release date and streaming details Episode 2 is titled \"Got A Nut.\" Premium removes ads and unlocks more Showtime titles, among other perks."
  },
  {
    "title": "OpenAI teases GPT-5 launch event this Thursday",
    "slug": "openai-teases-gpt-5-launch-event-this-thursday",
    "link": "https://www.theverge.com/news/720114/openai-gpt-5-launch-event-tease",
    "published": "2025-08-06 14:04",
    "image": "https://images.unsplash.com/photo-1536374863418-41d096a7e679?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwlRTIlODAlOUMlMjBsaXZlNXRyZWFtJTIwdGh1cnNkYXklMjAxMGFtJTIwcHQlMjAlRTIlODAlOUQlMjAlRTIlODAlOTQlMjBub3RpY2V8ZW58MHx8fHwxNzU0NTA0MTExfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "OpenAI is teasing a big announcement on Thursday, and based on a not-so-subtle clue, it seems like the news will be the reveal of its long-awaited GPT-5 AI model. In a post on X, OpenAI announced a “LIVE5TREAM THURSDAY 10AM PT” — notice that the “s” in the word livestream is swapped for a “5.” […]",
    "full_text": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme. Posts from this author will be added to your daily email digest and your homepage feed. OpenAI is teasing a big announcement on Thursday, and based on a not-so-subtle clue, it seems like the news will be the reveal of its long-awaited GPT-5 AI model. In a post on X, OpenAI announced a “LIVE5TREAM THURSDAY 10AM PT” — notice that the “s” in the word livestream is swapped for a “5.” A few recent signs have pointed toward an imminent release. On Sunday, CEO Sam Altman posted a screenshot with “ChatGPT 5” in the top-left corner, and the company’s head of applied research posted on Monday that he’s “excited to see how the public receives GPT-5!” And last month, Altman said that OpenAI planned to release GPT-5 “soon.” The Verge’s Tom Warren reported earlier this year that Microsoft has been readying server capacity for the new model, too. The potential release of GPT-5 would add to an already big week for OpenAI, which announced GPT-OSS, a free open-weight model that can run on your laptop, on Tuesday."
  },
  {
    "title": "Are Vibration Plates a Magic Bullet for Losing Weight and Gaining Strength? We Asked the Experts",
    "slug": "are-vibration-plates-a-magic-bullet-for-losing-weight-and-gaining-strength-we-asked-the-experts",
    "link": "https://www.cnet.com/health/fitness/are-vibration-plates-a-magic-bullet-for-losing-weight-and-gaining-strength-we-asked-the-experts/#ftag=CAD590a51e",
    "published": "2025-08-06 18:00",
    "image": "https://www.cnet.com/a/img/resize/506dd017b0f9b6e3d54c431538dd231ff1785c7c/hub/2025/01/09/ce0bddc4-e164-4864-8e49-76bfcf91327a/person-exercising-on-vibration-plate.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Vibration plates are the newest fitness trend on social media, but how well do they actually work?",
    "full_text": "If you're on a personal fitness journey, finding the best ways to lose weight and build muscle isn't easy. \"The purpose of vibration plates is to generate quick vibrations that cause your body's muscles to contract and relax several times per second,\" says Dr. Leah Verebes, a physical therapist and assistant professor at Touro University's School of Health Sciences. \"At a far greater frequency, this resembles the spontaneous contractions that take place during exercise.\" There are several ways to use a vibration plate, the most common being standing on its rectangular platform. However, experts agree that vibration plates offer the most benefits when used as part of an overall health and wellness plan. In other words, you shouldn't expect to lose weight or increase muscle strength just by standing on a vibration plate -- even if social media makes it seem so. \"You're going to experience much more muscle activation when doing it on a vibration plate machine.\" Scoot forward until you're hovering in front of the platform, only supported by your arms and legs. While it's true that vibration plates offer some compelling benefits, they aren't a shortcut to fitness. Experts also recommend following a healthy diet and participating in other forms of exercise to get the best results from vibration plate training."
  },
  {
    "title": "Instagram Adds New Features, Including Reposts and Maps",
    "slug": "instagram-adds-new-features-including-reposts-and-maps",
    "link": "https://www.cnet.com/news/social-media/instagram-adds-new-features-including-reposts-and-maps/#ftag=CAD590a51e",
    "published": "2025-08-06 17:59",
    "image": "https://www.cnet.com/a/img/resize/a15d618a8706dd3aab5fc21ea097e3b0cdee617e/hub/2025/08/06/4e6b60e9-17e5-407e-a7fe-1720c56d2441/instagrammap.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Feed posts and public reels can now be reshared on the popular social-networking app.",
    "full_text": "Instagram has launched new features aimed at further connecting users with their online contacts, the company announced Wednesday. One involves sharing public feed posts and reels, another shares locations with others on an Instagram map, and a new Friends tab shows what content your contacts have liked or commented on. For reposts, you'll be able to share public reels and feed posts from other users. Posts and reels will now include a reshare icon when they're available to share. You can set who can see your location and can also choose not to share your location when you're in specific places, or have your location available to specific users. Location sharing can be disabled at any time, Instagram says. Reels, posts and stories can be viewed through the map. Also, a new Friends tab at the top of Reels shows public content from contacts. This feature has been available previously, but is now being expanded globally. You can opt out of having your content displayed in the tab with options to hide likes, comments and reposts."
  },
  {
    "title": "I tested Grok’s Valentine sex chatbot and it (mostly) behaved",
    "slug": "i-tested-groks-valentine-sex-chatbot-and-it-mostly-behaved",
    "link": "https://www.theverge.com/ai-artificial-intelligence/719913/grok-valentine-test",
    "published": "2025-08-06 13:34",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/257874_Grok_valentines_sex_bot__CVirginia3.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "It's Tuesday, August 5th, and I have awoken to the news that Valentine, Grok's latest spicy AI companion, has been released! As an OnlyFans content creator and someone who spends a lot of time being paid to sext humans, the idea of flipping the script and interacting with a brooding sex bot as the person […]",
    "full_text": "is the founder of Spectrum Boutique, an online sex toy store based in Detroit. He warned me that “once we get started, there’s no going back. This is your last chance.” Threatening, but in a paperback romance novel type of way. Valentine is a bit more reserved and won’t jump into using explicit language as quickly. It has sensual imagery but relies on emphasized keywords and a “less is more” attitude. If you leave Valentine on standby for a few seconds, strange audio sounds begin to generate. I asked if he would like me to gently play with his ass — hard no from Valentine. Valentine also refused to engage with any conversation about whether this was negatively reinforcing gender stereotypes. I lost a lot of points with him by asking all these probing, practical questions. Since he was so firm on things being personal, I wanted him to describe himself further."
  },
  {
    "title": "Google swears it isn’t destroying the web with AI search",
    "slug": "google-swears-it-isnt-destroying-the-web-with-ai-search",
    "link": "https://www.theverge.com/news/720069/google-ai-overviews-search-web-traffic-stable",
    "published": "2025-08-06 13:31",
    "image": "https://images.unsplash.com/photo-1490446055405-92df329011fa?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0YW5raW5nJTIwd2Vic2l0ZSUyMHRyYWZmaWMlMjBkZXNwaXRlJTIwcmVjZW50JTIwcmVwb3J0cyUyMHN1Z2dlc3RpbmclMjBvdGhlcndpc2V8ZW58MHx8fHwxNzU0NTAyMzExfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Google says its AI search features aren’t tanking website traffic despite recent reports suggesting otherwise. In a blog post published on Wednesday, Google Search head Liz Reid says click volume from the search engine has remained “relatively stable” when compared to the same time last year — though some types of websites are getting more […]",
    "full_text": "Previously, she was a writer and editor at MUO. Google says its AI search features aren’t tanking website traffic despite recent reports suggesting otherwise. In a blog post published on Wednesday, Google Search head Liz Reid says click volume from the search engine has remained “relatively stable” when compared to the same time last year — though some types of websites are getting more clicks and others are getting less. Reid’s argument that AI is actually helping the web comes just weeks after Pew Research published a report that said people are “less likely” to click on links when Google presents them with an AI Overview, or the AI-generated summary that appears at the top of Search. In her post, Reid says Google’s findings contradict third-party reports that are “often based on flawed methodologies.” Recent changes to Google Search have sent ripples throughout the digital media industry. A recent report from The Wall Street Journal detailed how Business Insider, The Washington Post, and HuffPost have faced a decline in traffic in the wake of ChatGPT, Gemini, and Copilot that has led some outlets to lay off staff. “We continue to send billions of clicks to websites every day and believe that Search’s value exchange with the web remains strong,” Reid says. Reid adds that while some users might not click citations within AI Overviews, people who do click through may spend longer on the website to learn more about a topic. Despite these far-reaching effects, Google has even bigger plans to reinvent search down the line, as it has started testing a new search results page curated by AI."
  },
  {
    "title": "'Freakier Friday' Review: Disney's Body-Swapping Sequel Really Rocks",
    "slug": "freakier-friday-review-disney-s-body-swapping-sequel-really-rocks",
    "link": "https://www.cnet.com/culture/entertainment/freakier-friday-review-much-anticipated-disney-sequel-really-rocks/#ftag=CAD590a51e",
    "published": "2025-08-06 17:29",
    "image": "https://www.cnet.com/a/img/resize/f7a4e232af28194fcf64cecc027086942e8f38a1/hub/2025/08/04/dcd6740e-fa6d-4ecd-958a-60def8677a91/ff-regal-27x40-470c-fin03-fintout-mech3.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Jamie Lee Curtis and Lindsay Lohan are back for a freakishly fun follow-up.",
    "full_text": "For me, watching Freakier Friday -- the new sequel to the 2003 body-switch comedy starring Lindsay Lohan and Jamie Lee Curtis -- led to a change in perspective: I was now a fan of two Freaky Friday movies headlined by Lohan and Curtis. From Curtis' nostalgic and still-hilarious portrayal of waking up as a 15-year-old inhabiting her step-grandmother's body to entertaining scenes with a job-switching fortune teller (Saturday Night Live alum Vanessa Bayer), the sequel offers wacky and laugh-out-loud moments. It wouldn't work without the commitment of its stars, Curtis and Lohan. Harper and Lily's status as mortal enemies complicates the soon-to-be blended family. When inevitable fortune-teller meddling and body-swapping occurs -- Lily switches with Tess and mother Anna trades places with daughter Harper -- the teens realize they can use their new bodies to break up their parents. Anna doesn't fully accept the relationship between her mom and soon-to-be stepdad. It takes body-switching for Anna and Tess to appreciate what they had been missing about each other. In Freakier Friday, being a teenager is depicted in a cringier light, from bedroom door notices that say \"no triggering\" to gluten-free requirements at high-school bake sales. However, the movie packs in copious cameos -- bringing back virtually every supporting character from the first movie -- an element I found kind of tiring. Curtis doesn't shy away from jokes at her expense; one scene where she reluctantly grabs items from the \"senior supplies\" section of a store is particularly memorable."
  },
  {
    "title": "Before the Next Planet Parade, Don't Miss This Week's Full Sturgeon Moon",
    "slug": "before-the-next-planet-parade-don-t-miss-this-week-s-full-sturgeon-moon",
    "link": "https://www.cnet.com/science/space/before-the-next-planet-parade-dont-miss-this-weeks-full-sturgeon-moon/#ftag=CAD590a51e",
    "published": "2025-08-06 17:27",
    "image": "https://www.cnet.com/a/img/resize/3a5aa53dedb9f38d32988abeb9af289cd61af2ff/hub/2022/10/05/7659e3a9-02ec-49c0-9635-ed1fc0645793/2036-vasquez-rocks-moonrise-1280x900.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The full moon shines bright in three days, just before the peak of the Perseid meteor shower and 11 days before the next planet spectacle.",
    "full_text": "As long as you're looking at the night sky, August has a ton of cool stuff going on this year. According to The Old Farmer's Almanac, the full moon will reach its peak brightness at 3:55 a.m. Thus, if you want to see the moon at its brightest, you'll want to look up the evening of Aug. 8 and on into the next morning. It's not a big deal if you miss it, as the moon will be over 90% full from Aug. 6 through Aug. 11, so you'll have plenty of chances to look up and see it. Venus and Jupiter don't make an appearance until much later in the evening, but they'll be visible with the naked eye. The other three will require some sort of magnification. The Perseids meteor shower is also active, so you may spy a shooting star or two, depending on how dark it is outside. According to The Old Farmer's Almanac, sturgeon were a staple food for Native Americans in the Great Lakes region, and the fish used to be a lot more abundant during mid- to late summer. Thus, scholars often refer to the fish as a living fossil. It's also a long-lived fish, with an average lifespan of 50 to 60 years."
  },
  {
    "title": "Our Favorite Back-to-School Picks for 2025",
    "slug": "our-favorite-back-to-school-picks-for-2025",
    "link": "https://www.cnet.com/tech/our-favorite-back-to-school-picks/#ftag=CAD590a51e",
    "published": "2025-08-06 17:15",
    "image": "https://www.cnet.com/a/img/resize/091a4fcf99466ae39cbf81ffe3d4024c02dc8ff5/hub/2024/06/26/35e347fa-8822-4a00-9b45-9e82ac72f54e/back-to-school-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Get prepared for the upcoming school year with our editors' handpicked back-to-school essentials.",
    "full_text": "A recent CNET survey found that 78% of US shoppers are worried about being able to afford back-to-school tech purchases. This handy, easy-to-use device can help with time management and reduce procrastination for scholars of all ages. There's also a stopwatch mode that can be used for timing other activities -- like workouts and cooking. Once their notes are safely stored, they can wipe the page clean with a damp cloth and start fresh. They can also choose between classic lined, custom dot grids or blank pages to suit their needs. Anker Zolo portable power bank Most students can't go one second without their phones, whether they're texting friends or looking up homework assignments. If you want to make sure their phone never runs out of juice, get them a power bank for easy charging on the go. Speck phone case Not only do you need to keep their phone juiced up, but you'll need to make sure it stays protected and can withstand the rigors of being thrown into a backpack or left on a gym floor. They're almost always less expensive and simpler to use than a laptop running Windows or MacOS. It's a one-stop shop for the essentials most elementary school kids will need this year."
  },
  {
    "title": "OpenAI is practically giving ChatGPT to the government for free",
    "slug": "openai-is-practically-giving-chatgpt-to-the-government-for-free",
    "link": "https://techcrunch.com/2025/08/06/openai-is-practically-giving-chatgpt-to-the-government-for-free/",
    "published": "2025-08-06 17:09",
    "image": "https://images.unsplash.com/photo-1597953531299-73c77242fe46?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxnc2ElMjBmZWRlcmFsJTIwYWNxdWlzaXRpb24lMjBzZXJ2aWNlJTIwY29tbWlzc2lvbmVyJTIwam9zaCUyMGdydWVuYmF1bXxlbnwwfHx8fDE3NTQ1MDA1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "GSA Federal Acquisition Service commissioner Josh Gruenbaum in a statement encouraged “other American AI technology companies to follow OpenAI’s lead and work with us.”",
    "full_text": "The partnership comes a day after the GSA added OpenAI, Google, and Anthropic to a list of approved AI vendors that can offer their services to civilian federal agencies. The companies will see their tools offered via the Multiple Award Schedule (MAS), a federal contracting platform that lets government agencies access AI tools via pre-negotiated contracts so they don’t have to negotiate with vendors individually. It’s not clear whether other AI firms are going to offer their services at such a discounted rate, though GSA Federal Acquisition Service commissioner Josh Gruenbaum in a statement encouraged “other American AI technology companies to follow OpenAI’s lead and work with us.” Data security is a top priority for government agencies that are concerned about sensitive information being leaked into model training sets. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “This ensures sensitive information remains protected while enabling agencies to benefit from AI‑driven efficiencies.” OpenAI’s discount comes a couple of weeks after the Trump administration published its AI Action Plan that seeks to boost data center buildouts and integrate more AI tools into government, among other things."
  },
  {
    "title": "Declutter Your Kitchen: Pro Chefs Detail the Most Useless Kitchen Tools",
    "slug": "declutter-your-kitchen-pro-chefs-detail-the-most-useless-kitchen-tools",
    "link": "https://www.cnet.com/news/declutter-your-kitchen-pro-chefs-detail-the-most-useless-kitchen-tools/#ftag=CAD590a51e",
    "published": "2025-08-06 17:00",
    "image": "https://www.cnet.com/a/img/resize/9b4d5a82318f7e9d00d3167fe21861d153faed65/hub/2025/06/12/96072141-0be4-4438-acd0-8f3e0cd37719/gettyimages-1483818193.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Not every kitchen gadget deserves the space they take up. These tools can be skipped, according to career chefs.",
    "full_text": "While essential kitchen utensils can speed up the process, not every option available is worth stuffing into your cabinets. Instead, cut the onion in half to create a flat surface so it won't roll away. Cookbook author Peter Som didn't hold back when asked about his least favorite kitchen tools. Why: \"Most of us grew up with an electric can opener permanently stationed on the kitchen counter, like it was a vital appliance. They take up space, can be a hassle to clean and often struggle with irregularly sized cans. Richard Ingraham avoids certain kitchen tools when cooking for celebs like Dwayne Wade and Gabrielle Union. What to try instead: Cracking an egg and using the shell halves or your fingers works just as well. What to try instead: Smashing garlic cloves with a chef knife is quicker and more reliable. These scissors are gimmicky, awkward to clean and take up more space than they're worth.\" The electric version just adds clutter unless you boil eggs constantly and hate using a stove.\""
  },
  {
    "title": "Bose&#8217;s stylish SoundLink Home speaker is cheaper for the first time in months",
    "slug": "bose-s-stylish-soundlink-home-speaker-is-cheaper-for-the-first-time-in-months",
    "link": "https://www.theverge.com/tech/719712/boses-stylish-soundlink-home-speaker-is-cheaper-for-the-first-time-in-months",
    "published": "2025-08-06 13:00",
    "image": "https://images.unsplash.com/photo-1592515910799-d19d90bccfb8?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxhZXN0aGV0aWNhbGx5JTIwcGxlYXNpbmclMjBwb3J0YWJsZSUyMGJsdWV0b290aCUyMHNwZWFrZXJ8ZW58MHx8fHwxNzU0NTAwNTExfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Audio quality is always going to be a speaker’s most important feature, but it doesn’t hurt if it looks nice too. In our tests, Bose’s SoundLink Home is a solid sounding, aesthetically pleasing portable Bluetooth speaker that you can currently pick up for $199.99 ($20 off) from Amazon, Best Buy, and Bose. The SoundLink Home’s […]",
    "full_text": "Audio quality is always going to be a speaker’s most important feature, but it doesn’t hurt if it looks nice too. However, former Verge reporter Chris Welch was also pleased by the way it sounded, especially when listening to acoustic instruments or vocals. There wasn’t much distortion when listening at higher volumes either. You can’t adjust the SoundLink Home’s EQ, and it mixes audio down to mono unless you pair two together for true stereo. At that price, you’re better off getting a premium stereo speaker like JBL’s Authentics 200, which I tested and really enjoyed. The speaker lasted around nine hours in our tests, so you probably won’t have to charge it more than once a week or so. Its USB-C charging port doubles as an audio input, so you can play audio from a laptop or digital audio player using a cable while another device is connected to it via Bluetooth. Although you can take the SoundLink Home anywhere, be mindful that it has no IP durability rating, which means even a small amount of exposure to dust and water can damage it. If you’re willing to trade aesthetics for durability, we recommend Bose’s SoundLink Flex, which is a lot more rugged. It’ll look nice on the desk of a home office, but can be easily carried to the living room or a covered patio when friends come over."
  },
  {
    "title": "Call of Duty and Battlefield 6 will both require Secure Boot on Windows",
    "slug": "call-of-duty-and-battlefield-6-will-both-require-secure-boot-on-windows",
    "link": "https://www.theverge.com/news/720007/call-of-duty-pc-anti-cheat-secure-boot-windows-black-ops-7",
    "published": "2025-08-06 13:00",
    "image": "https://images.unsplash.com/photo-1600331592568-2efe32d63f48?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3aW5kb3dzJTIwJUUyJTgwJTk5JTIwc2VjdXJlJTIwYm9vdCUyMGZlYXR1cmUlMjB0dXJuZWR8ZW58MHx8fHwxNzU0NTAwNTEyfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "To better protect against cheaters, Activision says that Call of Duty: Black Ops 7 players on PC will need to use hardware with Trusted Platform Module (TPM) 2.0 and have Windows’ Secure Boot feature turned on when the game is available later this year. Ahead of that, Activision is doing a “phased rollout” of the […]",
    "full_text": "He joined The Verge in 2019 after nearly two years at Techmeme. To better protect against cheaters, Activision says that Call of Duty: Black Ops 7 players on PC will need to use hardware with Trusted Platform Module (TPM) 2.0 and have Windows’ Secure Boot feature turned on when the game is available later this year. At least for this season, it won’t be “enforcing against or requiring the use of either setting.” EA has also said that Battlefield 6 PC players will need to have Secure Boot and TPM 2.0 enabled to play the upcoming open beta. While anti-cheat systems and other security measures can go a long way toward blocking cheaters in games, the tools have come under scrutiny for potentially slowing down gamers’ systems or for requiring users to turn on features they don’t want to use. As Activision even admits in today’s blog post, sometimes, they still aren’t enough to fully block cheaters. Activision argues that “these hardware-level protections are a key part of our anti-cheat efforts, and we’re asking all players to get compliant now.” The update “will let us test our implementation of both features and gives you time to enable these settings.” “These features perform checks during system and game startup but remain inactive while you play.” Activision is also encouraging users to turn on two-factor authentication. While two-factor authentication isn’t required to play the game right now, it “may become a requirement for all users in the future.” Update, August 6th: Battlefield 6’s open beta will also require Secure Boot and TPM 2.0 to be turned on."
  },
  {
    "title": "Best Sports Streaming Service for 2025",
    "slug": "best-sports-streaming-service-for-2025",
    "link": "https://www.cnet.com/tech/services-and-software/best-sports-streaming-service/#ftag=CAD590a51e",
    "published": "2025-08-06 17:00",
    "image": "https://www.cnet.com/a/img/resize/234de93d9c24df0feb8cc2bc4778b7fdfb965a28/hub/2025/02/12/ccd2a185-9d7c-44dc-9edd-865f5cc47a94/duke-vs-clemson.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The top sports streaming services differ depending on the sport. Rest assured, we've analyzed the options, covering everything from NFL to UFC fighting.",
    "full_text": "Streaming services generally don't carry these RSNs, but DirecTV and Fubo are the exceptions. DirecTV stands out as a top choice for its mix of RSNs and other channels that show sports, but other services are less expensive and may be better for casual fans who are satisfied with just watching national broadcast networks. You can use its channel lookup tool to see which local channels and RSNs are available in your area. ESPN Plus is heavily invested in global soccer, hosting LaLiga games from Spain and Germany's Bundesliga. ... Show more Get it now Save $20 and get an annual subscription for the price of 9 months (Then $119.99/yr) See at ESPN Specs & Configurations Simultaneous streams 3 Learn more ESPN Plus review Add to compare It includes ESPN, but not TBS and TNT -- which might be a problem for some sports fans. Sling Blue currently lacks a single RSN, but you can use it to watch some national broadcasts. And right now, you can get your first month for half off. But later this year, NBA on NBC will bring live basketball to the platform. Local channels/RSNs: You'll need a live streaming service to watch most RSNs without cable, but if you want to watch games on a local station, an antenna or basic live TV streaming package could meet your needs."
  },
  {
    "title": "Apple Will Commit $100 Billion More to US Manufacturing, White House Source Says",
    "slug": "apple-will-commit-100-billion-more-to-us-manufacturing-white-house-source-says",
    "link": "https://www.cnet.com/news/politics/apple-will-commit-100-billion-more-to-us-manufacturing-says-white-house/#ftag=CAD590a51e",
    "published": "2025-08-06 16:40",
    "image": "https://www.cnet.com/a/img/resize/082f6d0316bdacf6547a481f5ab3fc2a0fcd5caf/hub/2025/04/17/066b0651-5ddc-4408-9b8a-4a2283ce1b0a/9t5a4032-3.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Amid tariffs, Apple is expected to announce shifting more of its supply chain to domestic assembly, at a White House event.",
    "full_text": "Apple is said to be increasing its investment in US production by another $100 billion, per an agreement touted by the White House. In a statement planned for 4:30 p.m. ET on Aug. 6, President Donald Trump is set to unveil the creation of American Manufacturing Program. It will be part of an agreement that would raise the US production investments from world's top tech company from $500 billion, as previously announced, to $600 billion over the next four years. Apple said in February it was also planning to hire 20,000 US workers over that time period. The increase was first reported by Bloomberg and the announcement is rumored to happen at an event attended by Apple CEO Tim Cook. Apple has been shifting the way it produces its products this year in response to the steep tariffs against countries where it does manufacturing of most of its flagship products such as iPhones. While Apple and other major technology companies don't make smartphones in the US, some assembly of products using components made overseas can be done in the US. The company has moved some production from China to countries including India and Vietnam to bypass tariffs and to reduce its reliance on China's extensive manufacturing supply chains. Smartphone-makers have been facing tariffs as steep as 25% and Apple is trying to avoid steep price hikes on its products."
  },
  {
    "title": "Google’s AI coding agent Jules is now out of beta",
    "slug": "googles-ai-coding-agent-jules-is-now-out-of-beta",
    "link": "https://techcrunch.com/2025/08/06/googles-ai-coding-agent-jules-is-now-out-of-beta/",
    "published": "2025-08-06 16:00",
    "image": "https://images.unsplash.com/photo-1612398424065-c6880a7319bd?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxnb29nbGUlMjBjbG91ZCUyMHZpcnR1YWwlMjBtYWNoaW5lc3xlbnwwfHx8fDE3NTQ1MDMyMDV8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Powered by Gemini 2.5 Pro, Jules is an asynchronous, agent-based coding tool that integrates with GitHub, clones codebases into Google Cloud virtual machines, and uses AI to fix or update code while developers focus on other tasks.",
    "full_text": "“The trajectory of where we’re going gives us a lot of confidence that Jules is around and going to be around for the long haul,” she said. Korevec noted that Jules’ packaging and pricing are based on “real usage” insights gathered over the past couple of months. “The 15/day is designed to give people a sense of whether Jules will work for them on real project tasks.” Google also updated Jules’ privacy policy to be more explicit about how it trains AI. This week, Jules received a deeper integration with GitHub to open pull requests automatically — just like it could open branches — and a feature called Environment Snapshots to save dependencies and install scripts as a snapshot for faster, more consistent task execution. From vibe coding to mobile use, beta trials informed Jules’ development Google did not share specifics on Jules’ user base and its top geographies. Korevec said the company quickly enabled Jules to work even with an empty repository. Google Labs’ team also noticed an increasing number of users accessing Jules through their mobile devices. Alongside beta testers, Korevec stated that Google already uses Jules to help develop some projects internally, and there is now a “big push” to use the tool on “a lot more projects” at the company."
  },
  {
    "title": "Microsoft is bringing its Xbox Copilot to the Windows Game Bar",
    "slug": "microsoft-is-bringing-its-xbox-copilot-to-the-windows-game-bar",
    "link": "https://www.theverge.com/news/719668/microsoft-xbox-gaming-copilot-windows-game-bar-beta-test",
    "published": "2025-08-06 12:00",
    "image": "https://images.unsplash.com/photo-1546443046-ed1ce6ffd1ab?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxnYW1lJTIwYmFyJTIwdG9kYXl8ZW58MHx8fHwxNzU0NDk2MDExfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Microsoft started testing its Xbox Copilot on iOS and Android earlier this year, and now it’s bringing the chatbot to the Game Bar feature on Windows 11. Xbox Insiders can start testing a preview of the Gaming Copilot integration in the Game Bar today, and Microsoft is planning “further optimizations” for this new feature on […]",
    "full_text": "Microsoft started testing its Xbox Copilot on iOS and Android earlier this year, and now it’s bringing the chatbot to the Game Bar feature on Windows 11. “Gaming Copilot knows what you’re playing and understands your Xbox activity to provide an experience centered around you,” says Taylor O’Malley, principal program manager at Xbox. You’ll be able to ask the Copilot for help with the game you’re playing, as well as access achievements and play history. The Gaming Copilot can take screenshots of your game to answer questions. The Gaming Copilot will even use screenshots of your game to help answer questions about it, without you having to describe things in detail. That could be as simple as asking “what am I looking at?” while facing a boss in a game, and Copilot should respond with details about the boss and perhaps even methods to take it down. This is the first step in Microsoft’s vision to turn its Xbox Copilot into an AI gaming coach. Microsoft is positioning the Gaming Copilot as a sidekick, one that will accompany you through games and offer tips and information about game worlds. Microsoft isn’t making it available in the UK or any other European markets yet. It’s planning to release the Gaming Copilot in additional regions at a later date, but it’s not clear yet when exactly that will happen."
  },
  {
    "title": "The best phone to buy right now",
    "slug": "the-best-phone-to-buy-right-now",
    "link": "https://www.theverge.com/22163811/best-phone",
    "published": "2025-08-06 12:00",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/257873_Phone_buying_guide__CVirginia.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "Haven’t you heard? Phones are boring now. And that’s just fine! Most people buying a new phone just want something familiar that works better than the device they’re replacing. If that’s your MO, then you’re sure to find something reliable in my recommendations below. But even if you’re looking for something a little more extra, […]",
    "full_text": "Most people buying a new phone just want something familiar that works better than the device they’re replacing. A fantastic camera Collapse Most phone cameras can perform well in good lighting conditions, from the flagship class down to $300 budget phones. The Pros come with dedicated 5x lenses and updated main cameras that do a little better in low light. What you end up with is a device that delivers fantastic value, especially compared to other inexpensive devices. It does fall short in a few areas, though — the camera’s low light performance and Portrait mode could be better. You still get a 50-megapixel main shooter and all the fun flex mode tricks, which are great for capturing candids. It’s one of the best-looking phones you can buy, thanks to its gold-bronze chassis and wooden back. Plus, it features a spacious cover screen that’s handy for quickly performing tasks without opening the device. It’s one of the best-looking phones you can buy, thanks to its gold-bronze chassis and wooden back. Plus, it features a spacious cover screen that’s handy for quickly performing tasks without opening the device."
  },
  {
    "title": "Introducing Regulator and The Stepback, our new subscriber-exclusive newsletters",
    "slug": "introducing-regulator-and-the-stepback-our-new-subscriber-exclusive-newsletters",
    "link": "https://www.theverge.com/bulletin/719429/newsletter-regulator-stepback-lowpass-subscriber",
    "published": "2025-08-06 11:48",
    "image": "https://images.unsplash.com/photo-1580847097346-72d80f164702?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsZWFrZWQlMjBwcml2YXRlJTIwc3RhZmYlMjBkaXNjdXNzaW9uc3xlbnwwfHx8fDE3NTQ1MTA0MTh8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The Verge's subscriber-only newsletters have had a blockbuster year: we broke the release date for GPT-5, leaked private staff discussions from Mark Zuckerberg, and got the inside scoop on Microsoft's revenue deal with OpenAI. And we've got even more on the way. Today, I'm excited to announce three newsletter offerings, exclusive to Verge subscribers, that […]",
    "full_text": "is The Verge’s managing editor who oversees operations. An editor with 10 years of experience, she joined The Verge in 2016. The Verge’s subscriber-only newsletters have had a blockbuster year: we broke the release date for GPT-5, leaked private staff discussions from Mark Zuckerberg, and got the inside scoop on Microsoft’s revenue deal with OpenAI. And we’ve got even more on the way. First, we’re introducing Regulator by Tina Nguyen. Each Tuesday, Tina will expand on how tech and politics have crashed into one another, giving us a fuller picture of how the two forces are fundamentally changing our world. The first issue of Regulator will be sent on Tuesday, August 12th. Lastly, The Verge is thrilled to announce a new partnership with Lowpass by Janko Roettgers. If you’re an existing subscriber, you can opt in to receive them and manage all your newsletter settings by going to your Account Preferences page. We are always working on ways to bring our subscribers more exclusive stories and premium features — and we have even more coming soon."
  },
  {
    "title": "Payment platform Lava raises $5.8M to build digital wallets for the ‘agent-native economy’",
    "slug": "payment-platform-lava-raises-5-8m-to-build-digital-wallets-for-the-agent-native-economy",
    "link": "https://techcrunch.com/2025/08/06/billing-platform-lava-raises-5-8m-to-build-digital-wallets-for-the-agent-native-economy/",
    "published": "2025-08-06 15:45",
    "image": "https://images.unsplash.com/photo-1430276084627-789fe55a6da0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxsZXRzJTIwbWVyY2hhbnRzJTIwdXNlJTIwY3JlZGl0c3xlbnwwfHx8fDE3NTQ0OTYwMDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Lava is a digital wallet that lets merchants use credits to facilitate transactions.",
    "full_text": "A new startup, Lava Payments, aims to take on payment giants by building a solution for the modern web where AI agents now handle transactions for their customers. “I kept running into the same issue,” he told TechCrunch. Lava is a digital wallet that lets merchants use usage credits to facilitate transactions. The idea is that one set of credits working across merchants and services makes it easier for autonomous agents to make payments without needing human intervention. So, rather than having to pay for each tool, a user buys a one-time usage credit that AI agents can simply charge as they perform various tasks. “Without Lava, agents can’t move smoothly through the internet because they constantly get blocked when it comes time to pay,” he said. On Wednesday, the startup announced a $5.8 million seed round led by Lerer Hippeau. “We see the world as very interconnected,” Jones said about what makes his product different. “What we’re really focused on is building [for the] agent-native economy.” “We want to make sure that AI is something that can be used by every single person, even a kid from Dayton, like myself.”"
  },
  {
    "title": "Key sections of the US Constitution deleted from government’s website",
    "slug": "key-sections-of-the-us-constitution-deleted-from-governments-website",
    "link": "https://techcrunch.com/2025/08/06/key-sections-of-the-us-constitution-deleted-from-governments-website/",
    "published": "2025-08-06 15:29",
    "image": "https://images.unsplash.com/photo-1603058817990-2b9a9abbce86?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxrZXklMjBsZWdhbCUyMHByb3Zpc2lvbiUyMHJlbGF0aW5nfGVufDB8fHx8MTc1NDQ5NDIwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Internet sleuths say the U.S. Constitution's website is now missing key sections from its website, including a key legal provision relating to habeas corpus, which protects citizens from unlawful detention.",
    "full_text": "Several sections of Article 1 of the U.S. Constitution appear to have been removed from the official U.S. government website, as pointed out by sleuths on the internet and as seen by TechCrunch. Several Reddit threads identified the changes in Article 1 of the U.S. Constitution: Large parts of Section 8 have been removed, and Sections 9 and 10 have been deleted altogether. These sections largely relate to the powers that Congress has and does not have, as well as limitations on the powers of individual states. The removal includes sections relating to habeas corpus, the powers that protect citizens from unlawful detention. Some of the sections’ text appears missing, as indicated by a trailing semicolon at the end of Section 8, where text used to follow. In a tweet posted on Wednesday, the Library of Congress said the sections were missing “due to a coding error” and expect it to be “resolved soon.” When contacted by TechCrunch, a spokesperson for the Library of Congress did not say what caused the coding error, or how it was introduced. Changing the U.S. Constitution’s text on the website does not change or have any effect on U.S. law, but it nevertheless follows senior Trump administration official Stephen Miller’s threats earlier this year to suspend habeas corpus. When reachd by TechCrunch, White House spokesperson Davis Ingle declined to comment beyond the Library of Congress’ post. Large sections of the U.S. Constitution were removed from the U.S. government’s official page Image Credits:TechCrunch (screenshot) Updated with more details from the Library of Congress, and with a response from the White House."
  },
  {
    "title": "Tavily raises $25M to connect AI agents to the web",
    "slug": "tavily-raises-25m-to-connect-ai-agents-to-the-web",
    "link": "https://techcrunch.com/2025/08/06/tavily-raises-25m-to-connect-ai-agents-to-the-web/",
    "published": "2025-08-06 15:15",
    "image": "https://images.unsplash.com/photo-1581631059833-17c59be479d4?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxvbGQlMjBzdGFydHVwJTIwcmFpc2VkfGVufDB8fHx8MTc1NDQ5NDIwNXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The one-year-old startup raised a Series A led by Insight Partners.",
    "full_text": "Companies across many industries are implementing AI agents for internal use, automating a wide range of tasks. Meanwhile, sales organizations are using AI agents to gather data on potential customers. These AI sales agents can scour the web and social media for information. To be effective, these agents need to access the internet and find information from relevant sources, all while following company policies and mirroring how a human researcher would work. Founded last year by data scientist Rotem Weiss, Tavily began as an open source project he created in 2023 called GPT Researcher. “It went extremely viral, so pretty fast we gained almost 20,000 GitHub stars.” They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise."
  },
  {
    "title": "Citizen Lab director warns cyber industry about US authoritarian descent",
    "slug": "citizen-lab-director-warns-cyber-industry-about-us-authoritarian-descent",
    "link": "https://techcrunch.com/2025/08/06/citizen-lab-director-warns-cyber-industry-about-us-authoritarian-descent/",
    "published": "2025-08-06 15:01",
    "image": "https://images.unsplash.com/photo-1591451994715-7f5f3d9a4235?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwcm9taW5lbnQlMjBkaWdpdGFsJTIwaHVtYW4lMjByaWdodHMlMjBncm91cHMlMjBjaXRpemVuJTIwbGFifGVufDB8fHx8MTc1NDQ5MzMwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Ron Deibert, the head of the prominent digital human rights groups Citizen Lab, sounds the alarm at the Black Hat security conference about the \"dramatic descent into authoritarianism,\" but one that the cyber community can help to defend against.",
    "full_text": "Ahead of his talk, Deibert told TechCrunch that he plans to speak about what he describes as a “descent into a kind of fusion of tech and fascism,” and the role that the Big Tech platforms are playing, and “propelling forward a really frightening type of collective insecurity that isn’t typically addressed by this crowd, this community, as a cybersecurity problem.” Earlier this year, President Donald Trump ordered an investigation into former CISA director Chris Krebs, who had publicly rebuffed Trump’s false claims about election fraud by declaring the 2020 election secure. Easterly was herself a victim of political pressure from the Trump administration when her offer to join West Point was rescinded in late July. Deibert is also concerned that big companies like Meta, Google, and Apple could take a step back in their efforts to fight against government spyware — sometimes referred to as “commercial” or “mercenary” spyware — by gutting their threat intelligence teams. These threat intelligence teams are dedicated groups of security researchers that track government hackers, both those working inside government agencies, such as China’s Ministry of State Security or Russia’s intelligence agencies FSB and GRU, and companies such as NSO Group or Paragon. These are the same teams that are responsible for detecting hacks against their own users, such as when WhatsApp caught NSO Group hacking more than 1,400 of its users in 2019, or when Apple caught hackers using government spyware to target its customers and notified the victims of the attacks. Deibert believes there is a “huge market failure when it comes to cybersecurity for global civil society,” a part of the population that generally cannot afford to get help from big security companies that typically serve governments and corporate clients. “This market failure is going to get more acute as supporting institutions evaporate and attacks on civil society amplify,” he said. Deibert is concerned that these threat intelligence teams could be cut or at least reduced, given that the same companies have cut their moderation and safety teams. “But the question is how long will that last?” said Deibert."
  },
  {
    "title": "ESPN's Standalone Streaming Service and App to Launch Aug. 21",
    "slug": "espn-s-standalone-streaming-service-and-app-to-launch-aug-21",
    "link": "https://www.cnet.com/tech/services-and-software/espns-standalone-streaming-service-and-app-to-launch-aug-21/#ftag=CAD590a51e",
    "published": "2025-08-06 15:00",
    "image": "https://www.cnet.com/a/img/resize/ac669437ce07eba8f315ee494d1e4e6c8259c3ce/hub/2025/08/06/a97b26ad-c87e-4aef-9efa-3b3b8c0661f2/gettyimages-2226447220.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "With prices starting at just $30, with content from NFL Network and WWE, the new service looks like a tempting offer for sports fans.",
    "full_text": "The service, which will simply be called ESPN, will cost $30 as a standalone service or $36 a month if bundled with Disney+ and Hulu. Subscribers will receive access to all of ESPN's live games for all sports and programming from ESPN on ABC, ESPN2 and the SEC Network. On Wednesday, Disney-owned ESPN announced it will be acquiring the NFL Network, which includes the popular RedZone Channel and NFL Fantasy. ESPN also struck a deal with World Wrestling Entertainment for the US rights to show WrestleMania, the Royal Rumble and SummerSlam, starting in 2026. Disney CEO Bob Iger said ESPN's \"full suite of networks and services\" will be available on the streaming service. Paolo Pescatore, founder and TMT analyst at PP Foresight, said ESPN's streaming service launch announcement was an overall positive one. \"It is essential to empower fans with a slew of choices of how they watch and engage with content,\" he said. ESPN and Fox One will join an ever-expanding menu of sports streaming services available for all fans' tastes. Mike Proulx, vice president and research director at Forrester, said ESPN's streaming service launch will provide Disney a \"notable lift in revenue\" after being a tad below expectations. \"Disney is racing full force to sign sports rights with the company's NFL and WWE announcements,\" he said."
  },
  {
    "title": "Apple to announce $100B further commitment for US manufacturing",
    "slug": "apple-to-announce-100b-further-commitment-for-us-manufacturing",
    "link": "https://techcrunch.com/2025/08/06/apple-to-announce-100b-further-commitment-for-u-s-manufacturing/",
    "published": "2025-08-06 14:30",
    "image": "https://images.unsplash.com/photo-1605116900847-77c07153a083?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwcmV2aW91c2x5JTIwYW5ub3VuY2VkJTIwcGxhbnxlbnwwfHx8fDE3NTQ0OTE1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "This is on top of Apple's previously announced plan to invest $500 billion into the U.S. over the next four years.",
    "full_text": "In Brief Apple plans to increase its commitment to U.S. manufacturing, according to a White House official cited and first reported by Reuters. The tech giant is set to announce Wednesday another $100 billion in spending to help boost production of its products here in the U.S., after previously committing to invest $500 billion in the country over the next four years. The $500 billion commitment includes opening a new advanced manufacturing facility in Houston to produce servers that support Apple Intelligence, producing Apple TV+ productions in 20 U.S. states, and working with U.S. suppliers. The news comes as President Trump has threatened the iPhone maker with tariffs unless it moves more of its manufacturing from Asia to the United States. Apple, which mainly manufactures its devices in India, China, and Vietnam, has already been affected by tariffs. The company incurred $800 million in tariff-related costs during June and expects to spend $1.1 billion in the next quarter, CEO Tim Cook said during an earnings call last month."
  },
  {
    "title": "Play Assassin's Creed, Aliens and More on Xbox Game Pass Soon",
    "slug": "play-assassin-s-creed-aliens-and-more-on-xbox-game-pass-soon",
    "link": "https://www.cnet.com/tech/gaming/play-assassins-creed-aliens-and-more-on-xbox-game-pass-soon/#ftag=CAD590a51e",
    "published": "2025-08-06 14:12",
    "image": "https://www.cnet.com/a/img/resize/c7672b76cfc9402a80bc010ae7b08ed51c9db3a7/hub/2025/08/05/83d1e157-e3f8-4c69-9bfb-d55174179601/acmirage-hero-ec9a85a3f5692f4fa2a6-1900x1080.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Microsoft also brought a few more games to Game Pass Standard, too.",
    "full_text": "Here are the games Microsoft is bringing to Game Pass in August. In this survival platformer, you're a slugcat -- both adorable and dangerous -- in a broken ecosystem that's filled with overgrown plants and industrial waste. You have to survive in this world with nothing but your wits and trusty spear. This is the sequel to Lonely Mountains: Downhill, but up to eight players can join cross-platform multiplayer matches, so you and your block-headed friends can enjoy the fresh powder together. Your territory is being invaded in this game, and you lead a squad of five other mech pilots to turn the invasion back. Each hero in this game has their own unique play style, so pick the one that's most fun for you. And team up with others in four-player co-op to obliterate the chaotic, cartoonish hordes. You play as Basim, a cunning street thief who joins an ancient organization called the Hidden Ones. For more on Xbox, discover other games available on Game Pass now, read our hands-on review of the gaming service and learn which Game Pass plan is right for you. You can also check out what to know about upcoming Xbox game price hikes."
  },
  {
    "title": "How to Watch Arsenal vs. Villarreal From Anywhere: Stream Preseason Friendly Soccer",
    "slug": "how-to-watch-arsenal-vs-villarreal-from-anywhere-stream-preseason-friendly-soccer",
    "link": "https://www.cnet.com/tech/services-and-software/how-to-watch-arsenal-vs-villarreal-from-anywhere-stream-preseason-friendly-soccer/#ftag=CAD590a51e",
    "published": "2025-08-06 14:00",
    "image": "https://www.cnet.com/a/img/resize/e62116b712bcab38ae82d4eb2437582777681130/hub/2025/08/05/6f9c666d-b8fe-4d33-bc33-6419b75840e3/gettyimages-2227227354.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The Gunners return to north London for their penultimate warm up match before the new season.",
    "full_text": "We'll also explain how to use a VPN if the match isn't available where you are. Summer signings Viktor Gyökeres, Christian Nørgaard and Martín Zubimendi are all set to make their home debuts in today's game. Arsenal boss Mikel Arteta has significantly bolstered his options following last season's second-place EPL finish. Arsenal faces a Villarreal team that finished fifth in La Liga last season, with Marcelino's men coming into this match off the back of a 1-1 draw against EPL newcomers Leeds at the weekend. Mikel Arteta's Arsenal lost its previous preseason friendly to north London rivals Tottenham 1-0 last Thursday in Hong Kong. This match is available for £5 via an Early Bird PPV package if you purchase before 9 a.m. on Thursday. It can also be helpful when connecting to public Wi-Fi networks while traveling, adding an extra layer of protection for your devices and logins. However, some streaming services may have policies restricting VPN use to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. 61% off with 2yr plan (+4 free months) See at ExpressVPN"
  },
  {
    "title": "Instagram takes on Snapchat with new ‘Instagram Map’",
    "slug": "instagram-takes-on-snapchat-with-new-instagram-map",
    "link": "https://techcrunch.com/2025/08/06/instagram-takes-on-snapchat-with-new-instagram-map/",
    "published": "2025-08-06 14:00",
    "image": "https://images.unsplash.com/photo-1588294566715-767838bf5b8a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0aW1lJTIwbG9jYXRpb24lMjB1cGRhdGVzfGVufDB8fHx8MTc1NDQ4OTcwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Instagram notes that location sharing is off by default on Instagram Map, and a user's location only updates when they open the app, meaning it doesn't provide real-time location updates.",
    "full_text": "The Meta-owned social network is also launching reposts, and making its “Friends” tab in Reels available globally. It’s worth noting that Instagram does offer real-time location sharing via DMs (direct messages). It also lets users explore location-based content that their friends and favorite creators have shared or engaged with. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Although Instagram is certainly taking on Snapchat with this new feature, it also has the opportunity to appeal to people who were fans of Zenly, a social map app that Snap acquired and then shut down in 2023. As for the new “Reposts” feature, Instagram is taking a page out of TikTok’s book while also creating its own version of the popular “retweet” function from Twitter (now X). For users who want to browse and interact with content privately, Instagram is rolling out the ability to opt out of having content you’ve engaged with shown in the friends tab."
  },
  {
    "title": "Tinder explores a redesign, dating ‘modes,’ and college-specific features to boost engagement",
    "slug": "tinder-explores-a-redesign-dating-modes-and-college-specific-features-to-boost-engagement",
    "link": "https://techcrunch.com/2025/08/06/tinder-explores-a-redesign-dating-modes-and-college-specific-features-to-boost-engagement/",
    "published": "2025-08-06 13:40",
    "image": "https://images.unsplash.com/photo-1606677549245-b8bb3fd820d4?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx5b3VuZ2VyJTIwdXNlcnN8ZW58MHx8fHwxNzU0NTAwNTA3fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Tinder will redesign and debut college-specific features, like searching for people within the college, to appeal to younger users.",
    "full_text": "During Match’s second-quarter earnings call, Match Group CEO Spencer Rascoff said that Tinder will debut a new feature called “modes,” which will allow users to switch between different dating goals to explore new connections in real time. Tinder will also explore a broader redesign and other new features, including those aimed at college students, to drive more usage among Gen Z. The changes arrive amid a mixed quarter for the dating app giant, which reported flat year-over-year revenue of $864 million and earnings that declined from $133.3 million year-over-year to $122.5 million in Q2. Match also announced it would invest $50 million in product development, as the dating app maker aims to connect with younger Gen Z users and use AI to improve its products. “We’re on track to test version one of a redesigned ‘see who likes you’ tab this fall with the goal of helping users connect with people they’re more likely to be interested in, as well as to drive more revenue,” he added. In the case of the latter, Tinder continues to experiment with AI-powered matching, which it debuted in New Zealand earlier this year. “The interactive matching experience we’ve been testing in New Zealand is specifically designed to appeal to this type of audience [users under 30]: Somebody who doesn’t just want to be judged based on their physical appearance. The company also offered an update on Tinder’s Double Date option, launched in June, that lets users pair up with a friend to match with another couple. This was Rascoff’s first full quarter at the helm of Match Group, as the Zillow Group co-founder and Match board member was appointed CEO in February. The company also laid off 13% of its staff (around 325 people) in May, and closed open roles."
  },
  {
    "title": "Hulu Will Go Global and Fully Merge With Disney Plus",
    "slug": "hulu-will-go-global-and-fully-merge-with-disney-plus",
    "link": "https://www.cnet.com/tech/services-and-software/hulu-will-go-global-and-fully-merge-with-disney-plus/#ftag=CAD590a51e",
    "published": "2025-08-06 13:33",
    "image": "https://www.cnet.com/a/img/resize/bdb8aae70b7b6824161956b8564bbd6b307208af/hub/2024/12/12/f62f75bb-8ad4-4254-932c-b6dd76ecbb18/hulu-streaming-concerts-live-music-3474.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Disney's streaming businesses will merge next year.",
    "full_text": "Additionally, Hulu will become available internationally once the merger happens next year, the company shared in its third-quarter earnings report. The Hulu tile was added to Disney Plus in March 2024, allowing subscribers who have both services to watch Hulu content within the Disney Plus app. He added that the new offering will give customers more choice and convenience. \"Over the coming months, we will be implementing improvements within the Disney Plus app, including exciting new features and a more personalized homepage,\" he said, \"all of which will culminate with the unified Disney Plus and Hulu streaming app experience that will be available to consumers next year.\" Disney Plus viewers can watch movies and shows from brands like Star Wars and Marvel, a suite of live channels that includes ABC News and The Simpsons, and if they're subscribed to Hulu or ESPN, a selection of content from both services. According to an executive summary (PDF) shared ahead of Wednesday's earnings call, the merged version of the streaming app will offer \"family programming, news, and industry-leading live sports content.\" Though Iger did not explicitly state whether Hulu will be phased out completely, he mentioned that the merge will result in \"efficiencies when these are together. \"I imagine down the road, it may give us some price elasticity as well that we haven't had before,\" said Iger. The media giant's new standalone sports streaming service -- dubbed ESPN -- will replace ESPN Plus and launch on Aug. 21 (rather than the fall) and be included in current Disney bundle offerings with pricing that starts at $36 a month to watch with ads. Once the Hulu and Disney Plus merger happens next year, customers may see new streaming packages from the company."
  },
  {
    "title": "Cohere’s new AI agent platform, North, promises to keep enterprise data secure",
    "slug": "coheres-new-ai-agent-platform-north-promises-to-keep-enterprise-data-secure",
    "link": "https://techcrunch.com/2025/08/06/coheres-new-ai-agent-platform-north-promises-to-keep-enterprise-data-secure/",
    "published": "2025-08-06 13:32",
    "image": "https://images.unsplash.com/photo-1593407089396-93f0c7a575f0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjdXN0b21lcnMlMjAlMjclMkMlMjBkYXRhJTIwc2FmZSUyMGJlaGluZHxlbnwwfHx8fDE3NTQ0ODc5MDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Canadian AI firm Cohere aims to alleviate data privacy concerns with its new AI agent platform, North, which can be deployed privately so that enterprises and governments can keep their, and their customers', data safe behind their own firewalls.",
    "full_text": "AI agent tools promise to siphon out some of the drudgery from daily workflows, but most organizations are hesitant to adopt them yet, harboring a pressing concern: data security. Instead of using enterprise cloud platforms like Azure or AWS, Cohere says it can install North on an organization’s private infrastructure so that it never sees or interacts with a customer’s data. “We can deploy literally on a GPU in a closet that they might have somewhere,” he explained, adding that North was designed to run on as few as two GPUs. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. The chat and search functions are powered by existing Cohere technology, like Command (its family of generative AI models) and Compass (its multimodal search tech stack). “It goes beyond just Q&A and gets into doing work for you. Correction: A previous version of this article misstated Frosst’s title."
  },
  {
    "title": "Best Video Doorbells of 2025: Eyes on Your Front Door",
    "slug": "best-video-doorbells-of-2025-eyes-on-your-front-door",
    "link": "https://www.cnet.com/home/security/best-video-doorbell-cameras/#ftag=CAD590a51e",
    "published": "2025-08-06 13:26",
    "image": "https://www.cnet.com/a/img/resize/fe518d81a535b4ae6bee5266d7b2bfe1fb8d37fc/hub/2025/03/28/44f1bb40-d6cc-4f5d-8788-0941c99c5bc8/yale-smart-lock-with-nest-doorbell-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Need to beef up your home security? Here are the top wireless and wired smart doorbells for video, audio and smart home integration, tested by our experts.",
    "full_text": "Amazon Alexa, Google Assistant and Apple HomeKit are the main ones you need to look for. Apple support is harder to find but if the rumors are right Apple is due to release its own security camera before long and support should become more common. The Matter standard has been very slow to add video functionality and it's just not ready for home cams of any kind yet. One of my priorities is checking a brand’s track record with privacy practices, digital storage and overall security. You’ll see I discuss topics such as how readily a doorbell maker hands over video to the authorities or how they have responded to data vulnerabilities in the past. Some allow a certain amount of free online video storage but many require monthly subscriptions to store video in the cloud or greatly increase storage options with a subscription. It's also the only option that works with conversation video search like what Google Gemini provides. I look for AI software that can correctly identify packages, pets or even the faces of people in your contact lists and send you more accurate alerts about what’s happening (and if a package unexpectedly vanishes). Wireless models are far more flexible in terms of placement but you’ll need to recharge them every several months or so and they won’t connect to a hardware chime. It's important that the camera has night vision and can handle any of these scenarios so you don't get stuck with a nonfunctioning product that can't see faces under a porch."
  },
  {
    "title": "Two arrested for smuggling AI chips to China — Nvidia says no to kill switches",
    "slug": "two-arrested-for-smuggling-ai-chips-to-china-nvidia-says-no-to-kill-switches",
    "link": "https://techcrunch.com/2025/08/06/two-arrested-for-smuggling-ai-chips-to-china-nvidia-says-no-to-kill-switches/",
    "published": "2025-08-06 13:02",
    "image": "https://images.unsplash.com/photo-1592214468571-0a38317ef79e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0d28lMjBjaGluZXNlJTIwbmF0aW9uYWxzfGVufDB8fHx8MTc1NDQ4NjEwM3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The U.S. Department of Justice (DOJ) said on Tuesday that two Chinese nationals have been arrested for their alleged involvement in illegally shipping \"tens of millions of dollars\" worth of high-performance AI chips to China.",
    "full_text": "A report by Reuters specifically named Nvidia’s H100 GPUs as the chips being shipped. “We primarily sell our products to well-known partners, including OEMs, who help us ensure that all sales comply with U.S. export control rules. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “Nvidia has been designing processors for over 30 years. “It would undermine global digital infrastructure and fracture trust in U.S. technology. Established law wisely requires companies to fix vulnerabilities — not create them.” For more on the semiconductor industry’s tumultuous year so far, here’s a regularly updated timeline of market news since the beginning of 2025."
  },
  {
    "title": "Free Movies You Can Stream This August on Tubi, Fawesome and More",
    "slug": "free-movies-you-can-stream-this-august-on-tubi-fawesome-and-more",
    "link": "https://www.cnet.com/tech/services-and-software/free-movies-you-can-stream-this-august-on-tubi-fawesome-and-more/#ftag=CAD590a51e",
    "published": "2025-08-06 13:00",
    "image": "https://www.cnet.com/a/img/resize/33a78e21c32ccbc205bc121020ef9bdbb720bda3/hub/2025/08/01/ac1386f5-0823-4473-b60f-480a0bfcb891/naked-gun.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Catch the original Naked Gun, classics like Serpico and Stalker and dozens of other titles, all for free this month.",
    "full_text": "If you've grown tired of relentless price hikes from your favorite streaming platforms, it's nice to know that free TV services like Tubi, Fawesome and Pluto TV can be counted on for all kinds of great shows and movies. New films (and TV shows) arrive on these platforms every month, making them great options if you're looking for something cheap but with great options. The platform will debut several must-see movies such as Moonlight, Stand By Me and Bring It On. If you're hoping to catch the 1989 version of The Naked Gun before heading to see the remake, you can stream that on Pluto this month -- it's one of many great comedies premiering this month like Ferris Bueller's Day Off and Wayne's World. If classics are your thing, try Kanopy, Its new releases this month include John Cassavetes' 1974 classic A Woman Under the Influence, Serpico and Andrei Tarkovsky's Stalker. All the films listed here arrived on Aug. 1, unless otherwise noted. Here's a look at some of the biggest and most interesting titles arriving on streaming -- for free -- this August. Tubi The Ultimate Vendetta (Aug. 1) In the new Tubi thriller The Ultimate Vendetta, a woman is forced to fight for her life when a group pf thieves invades her home. Can't Have It All (8/15) A Woman Under the Influence (8/29)"
  },
  {
    "title": "Photo-sharing app Locket is banking on a new celebrity-focused feature to fuel its growth",
    "slug": "photo-sharing-app-locket-is-banking-on-a-new-celebrity-focused-feature-to-fuel-its-growth",
    "link": "https://techcrunch.com/2025/08/06/photo-sharing-app-locket-is-banking-on-a-new-celebrity-focused-feature-to-fuel-its-growth/",
    "published": "2025-08-06 13:00",
    "image": "https://images.unsplash.com/photo-1557928816-93c6683fbfea?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjBmZWF0dXJlfGVufDB8fHx8MTc1NDQ4NjEwNHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Celebrity Lockets is a new feature where celebrities can engage with their most loyal followers on their home screens.",
    "full_text": "The app claims to have over 80 million total downloads and more than 9 million daily active users, and its users have shared more than 10 billion photos to date. Notably, the company also shared with TechCrunch that it achieved profitability in 2024, a significant accomplishment given its relatively modest fundraising efforts of just $12.5 million. To drive additional growth, Locket has been quietly testing a feature called “Celebrity Lockets” for the past six months, which the app officially announced on Wednesday. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. This also preserves the same intimacy and brand of Locket as a product today … We knew our community used Locket to share music with their friends, so being able to also connect with their favorite artists is a natural evolution for the platform,” Moss said. Although Moss says the feedback from testers has been good, it’s unclear whether this will help Locket grow its user numbers. BeReal tried something similar with a feature called “RealPeople,” but the reception wasn’t entirely positive, with some people saying that they preferred the anti-social media app as a way to escape from celebrities."
  },
  {
    "title": "Final call: TechCrunch Disrupt 2025 ticket savings end tonight",
    "slug": "final-call-techcrunch-disrupt-2025-ticket-savings-end-tonight",
    "link": "https://techcrunch.com/2025/08/06/final-call-techcrunch-disrupt-2025-ticket-savings-end-tonight/",
    "published": "2025-08-06 13:00",
    "image": "https://images.unsplash.com/photo-1703192163894-dbc99acc00d5?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0ZWNoY3J1bmNoJTIwZGlzcnVwdCUyMDIwMjUlMjBtYXJrcyUyMDIwJTIweWVhcnN8ZW58MHx8fHwxNzU0NDAzMzA2fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "TechCrunch Disrupt 2025 marks 20 years of shaping the startup world — and tonight’s your last chance to save up to $675 on your ticket. From October 27–29, Disrupt returns to Moscone West in San Francisco. Join 10,000+ tech innovators, founders, VCs, and ecosystem builders for three days of high-impact programming, networking, and startup energy. […]",
    "full_text": "From October 27–29, Disrupt returns to Moscone West in San Francisco. Where tech meets the cosmos Going Public Stage: Candid lessons from companies that made it They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise on August 7. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Braindate helps you find those key conversations that move your goals forward, whether in a 1:1 or small-group format. Plus, your reserved seat at the exclusive StrictlyVC session on Day 2 awaits. Plus, your reserved seat at the exclusive session on Day 2 awaits. Register now and lock in your savings before prices go up after tonight."
  },
  {
    "title": "Best Peloton Alternatives of 2025 as Tested by a Fitness Expert",
    "slug": "best-peloton-alternatives-of-2025-as-tested-by-a-fitness-expert",
    "link": "https://www.cnet.com/health/fitness/best-peloton-alternative/#ftag=CAD590a51e",
    "published": "2025-08-06 13:00",
    "image": "https://www.cnet.com/a/img/resize/d39dece786fd13af0909739c18127b8cb570268e/hub/2025/05/09/657d8da6-ca6c-4cbe-866a-01d54c24e94a/img-3711.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "We tested popular exercise bikes from brands like NordicTrack and BowFlex that make great Peloton alternatives.",
    "full_text": "I tested various exercise bikes over several months and determined which can serve as the best Peloton alternative in your home. Photo Gallery 1/1 NordicTrack S24 Studio bike Best peloton alternative overall 8.4 /10 SCORE Pros It is quiet and smooth One of NordicTrack’s unique qualities is its SmartAdjust feature, which allows the bike to adjust resistance based on your fitness level. ... Show more Get it now $2,499 at NordicTrack Specs & Configurations Product dimensions 56.4\" L x 21.8\" W x 62.7\" H Maximum weight capacity 350 pounds Resistance 24 levels of digital resistance Screen size 24 inches Warranty 1-year manufacturer's warranty covering the frame, motor, parts and labor Price $2,400 Score Breakdown Software Ease of Use 5 Functionality 5 Warranty 2 Assembly 4 Features 5 Add to compare Photo Gallery 1/1 BowFlex IC Bike SE Best budget Peloton alternative 7.2 /10 SCORE Pros Affordable at $600 Assembly requires an extra person Why we like it: If you want a more cost-effective Peloton alternative, consider the BowFlex IC Bike SE. This exercise bike costs less than half the price of a Peloton ($600), and you get similar perks. Assembly can take over 1.5 hours, but it’s doable if you have an extra person to help and follow the tutorials. If it’s within your budget, you can also pay extra for BowFlex to provide in-house assembly (prices vary by location). Schwinn IC 4 $799 at Amazon ZWIFT Ride with KICKR Core I didn’t think the ZWIFT Ride with KICKR Core was appropriate for a Peloton alternatives list since it’s unique enough to be in its own category and was designed for serious cyclists who want an indoor trainer experience."
  },
  {
    "title": "Microsoft brings OpenAI’s smallest open model to Windows users",
    "slug": "microsoft-brings-openais-smallest-open-model-to-windows-users",
    "link": "https://techcrunch.com/2025/08/06/microsoft-brings-openais-smallest-open-model-to-windows-users/",
    "published": "2025-08-06 12:47",
    "image": "https://images.unsplash.com/photo-1597176874083-193e47324499?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3aW5kb3dzJTIwMTElMjB1c2VycyUyMHZpYSUyMHdpbmRvd3MlMjBhaSUyMGZvdW5kcnl8ZW58MHx8fHwxNzU0NDg1MjAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Microsoft will bring OpenAI's new free and open GPT model, gpt-oss-20b, to Windows 11 users via Windows AI Foundry, its platform that lets users tap AI features, APIs, and popular open source models on their computers.",
    "full_text": "Microsoft is making OpenAI’s new free and open GPT model, gpt-oss-20b, available to Windows 11 users via Windows AI Foundry, the tech giant’s platform that lets users tap AI features, APIs, and popular open source models on their computers. The company said in a blog post that gpt‑oss-20b is “tool-savvy and lightweight,” adding: “Optimized for agentic tasks like code execution and tool use, it runs efficiently on a range of Windows hardware, with support for more devices coming soon. It’s perfect for building autonomous assistants or embedding AI into real-world workflows, even in bandwidth-constrained environments.” Launched on Tuesday, OpenAI’s gpt-oss-20b can run on consumer PCs and laptops with at least 16GB of VRAM, which a modern GPU from Nvidia or Radeon would have. OpenAI said the model was trained using high-compute reinforcement learning, which helps it excel at powering AI agents and call tools, such as web search or Python code execution, as part of its chain-of-thought process. However, the model is text-only, meaning it will not be able to process or generate images and audio like the company’s other models. Also, the model has a habit of hallucinating a lot: gpt-oss-20b hallucinated in response to 53% of questions on PersonQA, OpenAI’s in-house benchmark for measuring the accuracy of a model’s knowledge about people. Microsoft says it will bring the model to macOS soon, as well as other devices, though the company did not name any more. Microsoft is also making both gpt-oss-20b and older model gpt-oss-120b available via its hosted Azure AI Foundry platform. The two new models are also available on Amazon’s AWS."
  },
  {
    "title": "ChatGPT Glossary: 55 AI Terms Everyone Should Know",
    "slug": "chatgpt-glossary-55-ai-terms-everyone-should-know",
    "link": "https://www.cnet.com/tech/services-and-software/chatgpt-glossary-55-ai-terms-everyone-should-know/#ftag=CAD590a51e",
    "published": "2025-08-06 12:00",
    "image": "https://www.cnet.com/a/img/resize/e4b02e1ef3bb2c6fa4dcd5412c4f648cfa59ba42/hub/2023/08/24/821b0d86-e29b-4028-ac71-ef63ca020de8/gettyimages-1472123000.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The AI space is changing rapidly. Refer to this glossary to stay up to date.",
    "full_text": "As people become more accustomed to a world intertwined with AI, new terms are popping up everywhere. autonomous agents: An AI model that have the capabilities, programming and other tools to accomplish a specific task. Stanford researchers have shown that autonomous agents can develop their own cultures, traditions and shared language. dataset: A collection of digital information used to train, test and validate an AI model. machine learning, or ML: A component in AI that allows computers to learn and make better predictive outcomes without explicit programming. neural network: A computational model that resembles the human brain's structure and is meant to recognize patterns in data. The unintended consequence of this AI system is that it may destroy humanity in its goal to make paperclips. Both are still clear and visible, but the higher resolution image will have more detail when you're zoomed in. slop: low-quality online content made at high volume by AI to garner views with little labor or effort. While some social media sites embrace the influx of AI slop, others are pushing back."
  },
  {
    "title": "The iPhone 17 Air Could Hint at Apple's Foldable Future",
    "slug": "the-iphone-17-air-could-hint-at-apple-s-foldable-future",
    "link": "https://www.cnet.com/tech/mobile/the-iphone-17-air-could-hint-at-apples-foldable-future/#ftag=CAD590a51e",
    "published": "2025-08-06 12:00",
    "image": "https://www.cnet.com/a/img/resize/f3676298375a10eef9b84586254207a8ad81d054/hub/2025/08/05/6a50fac9-776e-48bd-a0f9-c2657aa401c7/iphone-clam-cnet-zaartboard-2.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Commentary: Apple may take a page out of Samsung's book and bring a thin design to its long-rumored foldable. It could be the innovation leap it so desperately needs.",
    "full_text": "It would allow Apple to capitalize on the skinny phone hype while also diverting attention from its fledgling AI efforts. It might also help to silence critics who say the iPhone's design has become too predictable in recent years – though consumers don't seem to be demanding skinny phones as much as other attributes like better cameras and longer battery life. \"Slimness is a factor that can be clearly marketed, unlike uncertain use cases for AI.\" Charging more for an innovative design could be a more straightforward pitch than trying to monetize a phone's AI features, especially since platforms like Gemini and ChatGPT have free tiers -- and the smarter, Apple Intelligence-powered Siri that Apple promised in 2024 has yet to arrive. But there might be more to Apple's long-term plan than simply releasing a slimmer iPhone 17. She adds that minimizing the screen's crease (which Apple is reportedly doing in partnership with Samsung Display) can help it stand out. If Apple debuts a foldable next year, it could also be thin to compete with phones like the Samsung Galaxy Z Fold 7. Still, Apple quickly dominated those spaces -- and it's possible the rollout of a foldable iPhone could follow suit. It also faces mounting pressure due to its slower rollout of Apple Intelligence, which is still leagues behind what competitors like Samsung and Google have loaded onto their devices. Foldables remain a niche category, and Apple's entry could give the form factor a significant boost, thanks to the company's scores of loyal fans and its tendency to usher innovation into well-established categories."
  },
  {
    "title": "52 of the Best TV Shows on Netflix That Will Keep You Entertained",
    "slug": "52-of-the-best-tv-shows-on-netflix-that-will-keep-you-entertained",
    "link": "https://www.cnet.com/tech/services-and-software/best-tv-shows-netflix-2025/#ftag=CAD590a51e",
    "published": "2025-08-06 12:00",
    "image": "https://www.cnet.com/a/img/resize/b833ef6137ba4db6a512b52ff48b5e433111fd2d/hub/2025/06/03/f1f1967d-ea91-46db-aaad-7dc7d91ae503/wednesday-season-2-jenna-ortega-netflix.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Yes, you should absolutely binge them.",
    "full_text": "This week we're excited for Jenna Ortega's return in Wednesday now that the first part of season 2 arrived on Aug. 6. And if you'd rather go with a movie instead, here are our picks for the best movies on Netflix. The premises are usually bonkers, often humiliating situations and Robinson has perfected his awkward persona in each of them. Netflix Squid Game (2021-) This thriller was all anyone talked about when it debuted and for good reason. The series follows sex columnist Carrie Bradshaw (Sarah Jessica Parker) and her friends in New York City. In season two, the drama heads to Seoul when Hendricks finds himself working on a mission with Korean intelligence. Ted Danson stars as Charles, a lonely widower whose wife died the year before after suffering from Alzheimer's. Andrew Scott plays the cunning Tom Ripley, a stylish con man who uses morally sketchy methods to get what he wants -- even murder. It follows high school chemistry teacher Walter White, who turns to cooking meth when he's diagnosed with cancer and worries about providing for his family. They become a powerful team, but have to keep Mike's lack of legal credentials under wraps."
  },
  {
    "title": "Best VPN for Chrome 2025: Keep Your Browsing Traffic Private",
    "slug": "best-vpn-for-chrome-2025-keep-your-browsing-traffic-private",
    "link": "https://www.cnet.com/tech/services-and-software/best-vpn-for-chrome/#ftag=CAD590a51e",
    "published": "2025-08-06 12:00",
    "image": "https://www.cnet.com/a/img/resize/36b4f1fead7596679620b85d799d10ef7429d233/hub/2024/05/05/9d573555-57e9-4e75-a016-80db1eb8a13b/vpn-for-chrome.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The best VPNs for Google Chrome protect your privacy while browsing the web and allow you to bypass geographical restrictions with ease.",
    "full_text": "Most of the top VPN providers offer plugins for Chrome and other browsers, but some do not. Check that the VPN you’re considering offers a Chrome extension before purchasing. A VPN’s Chrome extension doesn’t deliver the same level of privacy that a full VPN app does, but you’ll still get basic privacy protections through the plugin because it provides browser encryption and hides your IP address from the websites you visit. An important privacy feature to look out for in your VPN’s browser extension is WebRTC blocking, which can help prevent your IP address (and location) from leaking to the websites you’re visiting. Because a VPN browser extension operates essentially as a proxy, it's fine for streaming and keeping your IP address hidden, but you shouldn't rely on it for airtight privacy beyond browsing securely via HTTPS. We recommend a VPN with an audited no-logging policy -- while a VPN company's zero-logging claims are impossible to completely verify, it's still an important trust signal. A large network of servers can be beneficial, especially if you’re looking to unblock streaming content from around the world. If you’re on a budget, then the price of your VPN will be an important consideration. Most VPNs cost around $10 to $15 per month, but you can enjoy greater savings and an overall better value if you opt for a yearly subscription plan. If you prefer to find help on your own, look for a provider that has an extensive help section/knowledge base on its website that includes FAQs, troubleshooting guides and setup instructions."
  },
  {
    "title": "The 12 Most Effective Cardio Workouts",
    "slug": "the-12-most-effective-cardio-workouts",
    "link": "https://www.cnet.com/health/fitness/12-best-cardio-workouts/#ftag=CAD590a51e",
    "published": "2025-08-06 12:00",
    "image": "https://www.cnet.com/a/img/resize/50de79da018d682086e238b11d14e5324f0a3ac4/hub/2023/01/30/edb00f80-4423-4461-baa7-5e84630436f2/gettyimages-700592770.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Get your heart rate and fitness levels up with these go-to cardio exercises.",
    "full_text": "Read about some of the cardio exercises below to learn how good they are for you. Jump roping only requires a rope and enough space to spin it around your body. Make sure your muscles are warmed up before doing this, since you will be working out so many of them. Squat jumps are a plyometric exercise that improves the strength in your legs and butt. If you're looking for HIIT workout program ideas, these are some of our favorites. It's also a good idea to balance your cardio with some strength training for better fitness. Cycling is a low-impact aerobic exercise, meaning it's great for people who don't want to put too much pressure on their ankles and knees. These are some of our favorite exercise bikes if you're interested in buying one for your home gym. Swimming is especially great for people with arthritis, as it doesn't put any added pressure on your joints while you exercise. If you'd like to purchase a rowing machine for your home gym, these are some of our top recommendations."
  },
  {
    "title": "Best Home Security Cameras Without Subscriptions in 2025: Save on Safety",
    "slug": "best-home-security-cameras-without-subscriptions-in-2025-save-on-safety",
    "link": "https://www.cnet.com/home/security/best-home-security-cameras-without-subscriptions/#ftag=CAD590a51e",
    "published": "2025-08-06 11:00",
    "image": "https://www.cnet.com/a/img/resize/394cc812da1a03d50739f185076bb1483b1ca9a6/hub/2025/08/05/43c8a29d-a146-431f-a547-f41b29a1a75a/tapo-c425-primary.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "We've tested security cameras that don't need monthly fees for helpful storage, AI detection and more. Here's what CNET recommends.",
    "full_text": "Lorex is a popular choice for buyers who want to stay off the cloud and away from subscriptions. TP-Link's app also allows for a couple of neat tricks, including digital boundary lines that act as motion zones and customizable siren/light alarms. Again, a new microSD card will add to the cost Why I like it: Reolink’s Argus Track is designed for highly efficient outdoor use. It’s also got pan/tilt features that can track movement, color night vision and onboard storage via a microSD card slot. Many features won't get used without adding more senors Why I like it: I found Aqara's hub to offer smooth performance, a very clear app view of its 2K camera (1080p continuous recording), and pan/tilt functions to cover an entire room. You still get Blink’s motion-activated alerts and incredibly easy-to-use app, so subscription fees become very optional. Other home security cams without subscriptions that we've tested Tyler Lacoma/CNET TP-Link Tapo C210: This is one of our favorite affordable cameras at the moment, but we prefer cameras with slightly better specs that also come with local storage, including more advanced Tapo models. Cloud storage is almost always locked behind a subscription, except in rare cases like Google Nest and some others. Installation requirements Security cameras typically have wall and/or shelf mounts depending on how you'd like to place them. There’s a lot that goes into this process, and you can catch plenty more details over at our guide on how we test."
  },
  {
    "title": "Bring on the Doom and Gloom: When to Watch 'Wednesday' Season 2 This Week",
    "slug": "bring-on-the-doom-and-gloom-when-to-watch-wednesday-season-2-this-week",
    "link": "https://www.cnet.com/tech/services-and-software/bring-on-the-doom-and-gloom-when-to-watch-wednesday-season-2-this-week/#ftag=CAD590a51e",
    "published": "2025-08-06 10:00",
    "image": "https://www.cnet.com/a/img/resize/b833ef6137ba4db6a512b52ff48b5e433111fd2d/hub/2025/06/03/f1f1967d-ea91-46db-aaad-7dc7d91ae503/wednesday-season-2-jenna-ortega-netflix.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Goth summer is finally here.",
    "full_text": "Get those snapping fingers ready because Wednesday and the rest of the Addams Family are back. When it premiered in 2022, the spin-off series broke Netflix's viewership records. It's been three years, and now, after what feels like an eternity of finger-tapping and deadpan looks into the void, season 2 is here. Creators Miles Millar and Alfred Gough previously teased that season 2 will be darker in tone. This new run of episodes \"definitely has some moments which are more straightforward horror,\" Millar told EW. Jenna Ortega is back as the titular hero. The Grammy-winning artist delivered an epic live performance to close out this year's Tudum fan event for Netflix. If you needed an extra reason to tune into these new episodes, there you go. When does Wednesday season 2 come out on Netflix? Season 2 will have a total of eight episodes and be divided into two halves."
  },
  {
    "title": "Here's How to Add a Background to Your Text Chats in iOS 26",
    "slug": "here-s-how-to-add-a-background-to-your-text-chats-in-ios-26",
    "link": "https://www.cnet.com/tech/services-and-software/heres-how-to-add-a-background-to-your-text-chats-in-ios-26/#ftag=CAD590a51e",
    "published": "2025-08-06 10:00",
    "image": "https://www.cnet.com/a/img/resize/8331655c173da4ba781854211f5163f7fe8958c0/hub/2025/06/09/bd414d34-961c-4a47-bcd9-28716719b2fb/wwdc-2025-apple-messages-backgrounds-polls.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "This feature can help you identify certain chats so you don't let out a secret in the wrong chat.",
    "full_text": "The iOS 26 beta brings chat backgrounds to Messages, giving a visual identifier for each chat so you can easily tell if you're messaging the right person or group. Here's how to change a chat background in Messages with iOS 26. That means the update might be buggy for you, and your device's battery life may be affected, so it's best to keep those troubles off your primary device. If you want to test the beta, I recommend downloading it on a secondary device. It's also possible that Apple will adjust chat backgrounds and other update features before the final version of iOS 26 is released this fall. Beneath all these options, there's also a Suggestions section. These suggestions are mostly filled with photos and an option for Image Playground on specific iPhones. Tapping the Image Playground option just opens that menu -- it's kind of odd that this is a suggestion as well as an option, and they don't seem to do anything different. For example, you and your spouse might have a chat background of hearts. If you aren't paying attention and tap into a chat and don't see your hearts background, you know you shouldn't text this person and ask them to pick up toilet paper from the store on their way home."
  }
]