[
  {
    "title": "A mushroom casket marks a first for ‘green burials’ in the US",
    "slug": "a-mushroom-casket-marks-a-first-for-green-burials-in-the-us",
    "link": "https://www.theverge.com/science/710180/mushroom-casket-living-cocoon-mycelium-loop-biotech-green-burial",
    "published": "2025-07-19 10:05",
    "image": "https://images.unsplash.com/photo-1587334900448-1b1b6c83a370?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmaW5hbCUyMGhvbWUlMjAlMkMlMjIlMjBib2IlMjBoZW5kcmlreCUyMHRlbGxzfGVufDB8fHx8MTc1MjkzNDUxMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "\"I'm probably the only architect who created a final home,\" Bob Hendrikx tells The Verge. Tombs and catacombs aside, Hendrikx might be the only one to make a final home using mushrooms. Hendrikx is the founder and CEO of Loop Biotech, a company that makes caskets out of mycelium, the fibrous root structure of mushrooms. […]",
    "full_text": "Tombs and catacombs aside, Hendrikx might be the only one to make a final home using mushrooms. Bob Hendrikx and Marsya Ancker at a ceremony for her father in Maine. The casket, which Loop Biotech calls a “Living Cocoon” and sells for around $4,000, is made entirely of mycelium and can be grown in seven days. It can then biodegrade completely in about 45 days, according to the company. “He would have gotten a kick out of it, out of the fact that he was the first [to be buried in a Living Cocoon],” Marsya adds. Marsya described an iconic photo of her dad sitting on a green Volkswagen bus on the way to Woodstock, looking out over a traffic jam with binoculars, soon after Marsya was born and came home from the hospital. Marsya also finds the chemicals used in embalming “gross.” A desire to minimize waste and pollution is another reason some people are turning away from standard caskets or cremation. A “green” burial doesn’t have to incorporate mushrooms, of course. The goal is primarily to encourage decomposition and use natural materials in a sustainable way, Bar says. Ever the architect, Hendrikx has also kept comfortable design in mind with his Living Cocoon."
  },
  {
    "title": "Nothing Phone 3 review: flagship-ish",
    "slug": "nothing-phone-3-review-flagship-ish",
    "link": "https://www.theverge.com/mobile/709093/nothing-phone-3-review",
    "published": "2025-07-19 10:00",
    "image": "https://images.unsplash.com/photo-1734907607812-9f80d93cc51c?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmaXJzdCUyMHRydWUlMjBmbGFnc2hpcCUyMHBob25lJTIwJTJDJTIyfGVufDB8fHx8MTc1MjkzNDUxMnww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Nothing says that the Phone 3 is its \"first true flagship phone,\" and it has put its money where its mouth is. The phone is getting a full US launch, and at $799, it costs exactly the same as a Pixel 9, Galaxy S25, or iPhone 16. That makes reviewing the Phone 3 refreshingly simple, […]",
    "full_text": "Nothing includes some notification icons of its own design, like this one I used for WhatsApp. The Glyph Matrix can display pictures and icons, so instead of trying to remember which light show you programmed for phone calls from your mom, you can set an emoji to represent her (you could even use a photo, but these are just as illegible as the old lights when rendered on the dot matrix). You can set the clocks or battery indicator to run perpetually as a form of always-on display, too, which is a boring use case but the best part of it for me. This is a beta “smart” layout of the app drawer, with automated categories. But there’s more to being a flagship than just looking the part. 1 / 19 The Phone 3’s main camera produces attractive results in good lighting. Back to the big question: should you buy this over other flagships? It’s likely to beat the upcoming Pixel and iPhone models on those fronts. Depending on your taste, that may be a point in their favor. If that appeals, then the Nothing Phone 3 is a unique flagship."
  },
  {
    "title": "Fast Fusion scratches the hyper fast F-Zero itch",
    "slug": "fast-fusion-scratches-the-hyper-fast-f-zero-itch",
    "link": "https://www.theverge.com/games-review/705627/fast-fusion-review-f-zero-nintendo-switch-2",
    "published": "2025-07-19 09:00",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/screenshot01.jpg?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200",
    "summary": "The Switch 2 technically launched with an F-Zero game, as F-Zero GX was available on Nintendo Switch Online's premium tier as part of the GameCube lineup. But if you're looking for a new F-Zero or Wipeout, the console has a spiritual successor that costs just $14.99: Shin'en's Fast Fusion. Fast Fusion pits you in futuristic […]",
    "full_text": "He joined The Verge in 2019 after nearly two years at Techmeme. The Switch 2 technically launched with an F-Zero game, as F-Zero GX was available on Nintendo Switch Online’s premium tier as part of the GameCube lineup. They all feel distinct, too: In one, you’ll drive over a sandy desert as whale-like creatures jump above you. A course in space forced me to dodge meteors falling on the track. One stage set around a volcano was filled with magma. If you tire of cups, there are a few other fun modes to play and earn money from. My favorite was “Super Hero Mode,” where you have to get first place in a track without blowing up — with the added twist that your boost meter is also a shield meter, similar to F-Zero. You can pay a small fee to “fuse” vehicles together to make better racers, though I honestly couldn’t tell that much of a difference between the different options. Fast Fusion isn’t exactly the same as F-Zero, and I really wish Nintendo would make a brand-new entry in that series. And I’m not getting my hopes up for a new Wipeout game anytime soon."
  },
  {
    "title": "Samsung Galaxy Z Fold 7 review: stunning, bendy, and spendy",
    "slug": "samsung-galaxy-z-fold-7-review-stunning-bendy-and-spendy",
    "link": "https://www.theverge.com/reviews/709990/samsung-galaxy-z-fold-7-review",
    "published": "2025-07-19 09:00",
    "image": "https://images.unsplash.com/photo-1722156163505-7d3d5d5dd85a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxnYWxheHklMjB6JTIwZm9sZCUyMDd8ZW58MHx8fHwxNzUyOTMwOTEyfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "I've been using the Galaxy Z Fold 7 for a week, and I've run out of ways to say \"It's so nice.\" It's not essential, or life-changing; it's nice. It's an understatement, though. Samsung joins the likes of Honor and Oppo in making a folding phone that's almost as thin as a regular phone, and […]",
    "full_text": "It works just like a regular slab-style phone outside of some extreme use cases. Nobody’s buying a folding phone for its power efficiency, and I think these results are pretty good. None of the above is new or exclusive to the Fold 7, but I can’t emphasize this enough: this all feels like you’re getting away with something, because the experience of using this phone while it’s closed feels normal. No more chunky brick in the side pocket of my yoga pants. Good news: this phone is way thinner than the Z Fold 6 (top). There wasn’t any water in the tub when that happened, but still. It keeps up just fine, and I had no problems running Diablo Immortal at the highest display settings. The Z Fold 7 still doesn’t have a formal dust resistance rating; its IP48 means it’s fully water-resistant but only immune to very small particles, not specks of dust. Take extra care and consider adding Samsung’s extended warranty plan to cover pricey inner screen repairs. Low-light photos are detailed, provided your subject isn’t moving too much, and Samsung’s preference for vibrant reds and blues is on full display."
  },
  {
    "title": "Samsung S95F OLED TV Review: Best Picture Quality for 2025",
    "slug": "samsung-s95f-oled-tv-review-best-picture-quality-for-2025",
    "link": "https://www.cnet.com/tech/home-entertainment/samsung-s95f-oled-tv-review-fantastic-picture-superior-anti-glare/#ftag=CAD590a51e",
    "published": "2025-07-19 13:00",
    "image": "https://www.cnet.com/a/img/resize/f5a22fb420701eb47c30e1218f44c91691d8f3e4/hub/2025/06/16/5b061826-001a-4fd9-8e9c-9888b713b63a/samsung-s95f-1.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The Samsung S95F OLED's ability to banish reflections helps it produce the best TV image quality yet.",
    "full_text": "In 2025, two OLED TVs stand out -- Samsung's S95F and the LG G5. With breakthroughs such as \"four stack\" and blue phosphor, future TVs could be even brighter. Having a separate box is most useful if you're continually swapping things out connected to your TV. If you use an AV receiver or other switch box it's not necessary. The onboard smart TV systems of most televisions are pretty homogenous at this point and Samsung's can't be faulted for such consistency. Home is the default and when displaying streaming services it features a series of relevant thumbnails. I preferred the chunky and colorful remotes of old but you did have to put batteries in those. If you use your TV as a switch, the lack of an input button will likely rankle. New advances such as LG's blue phosphor tech mean that future TVs promise to be even better. while I could almost use the quite-reflective Hisense to check my teeth for parsley."
  },
  {
    "title": "Electric Cooler vs. Ice Cooler: I Camped With Anker's Solix EverFrost 2 and an RTIC Ice Box to See Which Is Better",
    "slug": "electric-cooler-vs-ice-cooler-i-camped-with-anker-s-solix-everfrost-2-and-an-rtic-ice-box-to-see-which-is-better",
    "link": "https://www.cnet.com/news/electric-cooler-vs-ice-cooler-camping-to-see-which-is-better/#ftag=CAD590a51e",
    "published": "2025-07-19 13:00",
    "image": "https://www.cnet.com/a/img/resize/c57b75a12b2265c5fbd21ff140ccfdd38817b176/hub/2025/03/28/371c801d-70eb-4b5f-8de4-905cf3452ca9/final.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Both an electric cooler and a traditional icebox can keep drinks cool when outdoors, but which lasts longer?",
    "full_text": "Keeping drinks and food cold while camping can be a challenge, especially in the summer. I set out to test a \"regular\" icebox-style cooler -- specifically, RTIC's icebox -- against Anker's new Solix EverFrost 2 to see how it would fare in real-world use against the best coolers on the market. They can hold ice but the main attraction is you don't need it to keep your food and drinks cool. You should be able to pick it up in just about any supermarket or gas station and as long as the cooler is well-insulated, it should last for hours, if not days. The EverFrost 2 has a pull out handle that can double as tray table. To test this, I loaded up both coolers with just 40 cans of soda. This time, I did not open and check the coolers every 15 minutes. You can recharge the EverFrost 2 with solar panels, a car charger and power outlet. The duration that ice can last in a normal cooler depends greatly on how often it is opened. During testing, a cooler opened every 15 minutes lost most of its ice within hours."
  },
  {
    "title": "Best Internet Providers in Columbia, South Carolina",
    "slug": "best-internet-providers-in-columbia-south-carolina",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-columbia-sc/#ftag=CAD590a51e",
    "published": "2025-07-19 12:34",
    "image": "https://www.cnet.com/a/img/resize/678275a78ca19eb5fae4a1a3a1b170d774fea103/hub/2023/07/26/5974d05a-a702-4692-91e8-8f660e386723/columbia-sc-gettyimages-184939611.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "From high-speed fiber to budget-friendly cable internet, Columbia residents have a decent variety of providers to choose from. CNET's internet experts recommend the following.",
    "full_text": "CNET’s top pick for the best internet in Columbia, South Carolina is AT&T Fiber. (Disclosure: Ookla is owned by the same parent company as CNET, Ziff Davis). While AT&T Fiber offers blazing-fast multi-gig plans up to 5,000Mbps, Spectrum’s $30 plan for 100Mbps is one of the most affordable deals in town. Hughesnet: Columbia residents likely won’t need satellite internet (SpaceX's Starlink is also available almost everywhere in the city). Columbia residents have access to its Fusion plans, a satellite and wireless home internet combo. The best internet deals and top promotions in Columbia depend on what discounts are available during a given time. For a more extensive list of promos, check out our guide on the best internet deals. To evaluate how happy customers are with an ISP's service, we look at sources including the American Customer Satisfaction Index and J.D. Most Columbia residents will be well served by Spectrum's cable connection which is widely available in the city. With its high marks on customer satisfaction surveys and variety of options in terms of price and speed -- CNET calls it a \"terrific value\" -- AT&T’s fiber internet will be the best choice for most Columbia residents."
  },
  {
    "title": "The Art of Freelancing Like a Boss, According to the Folks Who Do It",
    "slug": "the-art-of-freelancing-like-a-boss-according-to-the-folks-who-do-it",
    "link": "https://www.cnet.com/personal-finance/the-art-of-freelancing-like-a-boss-according-to-the-folks-who-do-it/#ftag=CAD590a51e",
    "published": "2025-07-19 12:00",
    "image": "https://www.cnet.com/a/img/resize/4992371455244953ddd0f46ac8d5ac7bbed518d5/hub/2025/07/16/91c95631-7df2-4ac9-8075-bd01ef0d9ac3/image.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "From a side hustle to your main gig, here's your guide to becoming self-employed.",
    "full_text": "Jamie Brindle has been freelancing for 16 years and is on a mission to \"demystify\" the freelance world. \"People are finally coming over to my side and agreeing that building something for yourself is the safe option now,\" Brindle told me. Whether by choice or necessity, millions of people are turning to freelancing as a long-term business strategy. Yet the self-employed span nearly every industry and skill level, from entry-level musicians to highly specialized brand consultants. But in today's competitive job market, setting up your own gig could be the easiest way to guarantee some income. When making the leap from a conventional employee to an independent contractor, don't wipe your slate clean. Setting up a separate legal structure will give you liability protection, tax flexibility and the ability to secure loans. Though Fiverr and Upwork can help you get started, many independent contractors don't recommend relying on them as the foundation of your business. Sites like these have \"pay to play\" elements or take a percentage of each transaction as commission. If you can't afford to hire someone, try different platforms or accounting software such as QuickBooks and HoneyBook."
  },
  {
    "title": "For privacy and security, think twice before granting AI access to your personal data",
    "slug": "for-privacy-and-security-think-twice-before-granting-ai-access-to-your-personal-data",
    "link": "https://techcrunch.com/2025/07/19/for-privacy-and-security-think-twice-before-granting-ai-access-to-your-personal-data/",
    "published": "2025-07-19 12:00",
    "image": "https://images.unsplash.com/photo-1640158615573-cd28feb1bf4e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxwZXJzb25hbCUyMGRhdGF8ZW58MHx8fHwxNzUyOTI3MzA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "AI chatbots, assistants and agents are increasingly asking for gross levels of access to your personal data under the guise of needing your information to make them work.",
    "full_text": "AI is being forced on us in pretty much every facet of life, from phones and apps to search engines and even drive-throughs, for some reason. This kind of access is not normal, nor should it be normalized. Not so long ago, you would be right to question why a seemingly innocuous-looking free “flashlight” or “calculator” app in the app store would try to request access to your contacts, photos, and even your real-time location data. Perplexity says much of this data is stored locally on your device, but you’re still granting the company rights to access and use your personal information, including to improve its AI models for everyone else. Perplexity isn’t alone in asking for access to your data. There are serious security and privacy risks associated with using AI assistants that rely on your data. All of this for the sake of performing a task that ostensibly saves you time — or, to Whittaker’s point, saves you from having to actively think about it. When things go wrong (and they do, a lot), it’s common practice for humans at AI companies to look over your private prompts to figure out why things didn’t work. From a security and privacy point of view, a simple cost-benefit analysis of connecting AI to your most personal data just isn’t worth giving up access to your most private information. Any AI app asking for these levels of permissions should send your alarm bells ringing, just like the flashlight app wanting to know your location at any moment in time."
  },
  {
    "title": "BMW M5 review: a PHEV worth its weight",
    "slug": "bmw-m5-review-a-phev-worth-its-weight",
    "link": "https://www.theverge.com/bmw/689434/bmw-m5-review-phev-specs-price",
    "published": "2025-07-19 08:00",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/06/2025BMWM5PHEVPeterNelson19.jpg?quality=90&strip=all&crop=0%2C10.840672443973%2C100%2C78.318655112054&w=1200",
    "summary": "After 40 years and six generations, 2025 marks the beginning of a new generation of the BMW M5: the G90 chassis. Featuring a ground-up redesign and a new plug-in hybrid powertrain, the specs are impressive. It's not just its horsepower and torque numbers but its curb weight of 5,390 pounds, too. That's no small figure, […]",
    "full_text": "There’s a lot to like about the newest M5, especially in its corner-carving competence and how it acts around town solely propelled by electrons. But in other areas, this $123,275 super sedan lacks some necessary traits to its class. But there’s no hiding it: this thing is dimensionally massive in every sense of the word. Inside, the G90 possesses BMW’s latest screen and capacitive touch-focused interior design. All controls are laid out in an organized manner, and their touch response is quite good. Besides some jerkiness while shifting through gears with the pedal mashed, its acceleration is still ample for daily commuting. There’s a lot to like about the newest M5, especially in its corner-carving competence. In light of these gripes, it may sound like the latest M5’s overall tuning errs more on the side of comfort and restraint than ever before, but its ride quality tells a different story. It has a chill PHEV / muscular sedan demeanor and squabs on twisty roads like nobody’s business. But due to its lack of personality and rough ride quality, it feels like a step in the wrong direction."
  },
  {
    "title": "How to design an actually good flash flood alert system",
    "slug": "how-to-design-an-actually-good-flash-flood-alert-system",
    "link": "https://www.theverge.com/science/709362/flash-flood-warning-system-experts-texas-sirens-blue-alert",
    "published": "2025-07-19 08:00",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/gettyimages-2224712696.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "Flash floods have wrought more havoc in the US this week, from the Northeast to the Midwest, just weeks after swollen rivers took more than 130 lives across central Texas earlier this month. Frustrations have grown in the aftermath of that catastrophe over why more wasn't done to warn people in advance. Local officials face […]",
    "full_text": "These are all important questions to answer that can help keep history from repeating itself in another disaster. In Texas and elsewhere, the solution is more wide-ranging than fixing any single channel of communication. But not everyone received alerts on their phones with safety instructions from Kerr County officials during crucial hours, according to records obtained by NBC News. Murphy’s company is now using its mapping tools to help state and federal agencies find dozens of people still missing since the July 4th floods. Sirens can be critical for reaching people outdoors who may not have cell service and are hard to reach. But there are also warning systems that people can opt in to for alerts, including CodeRed weather warnings. Frustrations have flared up on social media this month over a statewide Blue alert issued for someone suspected of being involved in the “serious injury” of a police officer at an Immigration and Customs Enforcement (ICE) detention facility in Alvarado, Texas. “Alert fatigue” is a concern if it pushes people to ignore warnings or opt out of receiving them altogether. “It’s really frustrating when they choose to send a Blue alert through an imminent threat channel,” Sutton says. (On July 4th, floodwaters rose in the dead of night — making it even harder to notify people as they slept.)"
  },
  {
    "title": "Best Fiber Internet Providers for July 2025",
    "slug": "best-fiber-internet-providers-for-july-2025",
    "link": "https://www.cnet.com/home/internet/best-fiber-internet-providers/#ftag=CAD590a51e",
    "published": "2025-07-19 12:00",
    "image": "https://www.cnet.com/a/img/resize/6a91c7992f42deb1e56b9355d95977d9c146d496/hub/2024/06/13/5c3bb9c9-9d76-463a-9a6f-eb30035708d7/broadband-internet-connectivity-wireless-fiber-9720.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "We consider fiber internet to be the gold standard of broadband. Here are some of the top fiber providers.",
    "full_text": "Compared to other big-name providers, AT&T is among the cheapest when considering cost per Mbps and there are no hidden fees. Fast speeds, relatively low pricing and customer-friendly service terms have earned AT&T high customer satisfaction ratings in recent years. Note : Verizon is acquiring Frontier Fiber in a $20 billion deal, which was just approved by the FCC. Read full review Or call to learn more: (888) 461-3204 Check with Verizon Compare Connection Fiber Speed range 300 - 2,000 Mbps Price range $50 - $120 per month Pros and Cons Pros All Verizon Fios plans are 100% fiber, with symmetrical download and upload speeds Note : AT&T just announced a nearly $6 billion deal to purchase 95% of Quantum Fiber's network. But if you're living in the suburbs or a rural area, your best chance to get fiber internet is from Kinetic by Windstream. Those in a Kinetic service area will also appreciate the low pricing -- $25 per month for speeds up to 100Mbps. In fact, fiber technically doesn't use a modem at all but an optical network terminal that performs the same function. Check out our guide to finding the right internet speed for help selecting a fiber plan that best meets your needs. It's true that fiber internet plans are often the best value, but you may find cheaper options from cable or 5G providers."
  },
  {
    "title": "Best VPN for iPhone 2025: Enhance Your Privacy on the Go",
    "slug": "best-vpn-for-iphone-2025-enhance-your-privacy-on-the-go",
    "link": "https://www.cnet.com/tech/services-and-software/best-vpn-for-iphone/#ftag=CAD590a51e",
    "published": "2025-07-19 12:00",
    "image": "https://www.cnet.com/a/img/resize/adc9fbfe682910a9f70aa633c36b107e8536c2b1/hub/2024/04/24/de233b43-f2e8-4a9e-af29-4796b3bcd0ce/vpn-online-safety-protection-9292.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Improve your privacy, stream foreign Netflix libraries and avoid mobile traffic throttling with the best iPhone VPNs on the market.",
    "full_text": "With so many iPhone VPN apps available, it can be difficult to choose the right one. We recommend checking any provider’s privacy policy and reading its audit reports closely, as it’ll give you a good understanding of whether a VPN provider is serious about your privacy. Many of the best VPNs are also rolling out post-quantum protections that help protect against potential future threats from quantum computers, which is essential for privacy-critical users now and moving forward. Finally, your provider should offer either a RAM-only server infrastructure or employ full-disk encryption on its hard drives, both of which can help ensure that your data remains secure. Generally, we've found that the best VPNs for iPhone only drop your internet download speed by an average of 25% or less. For bandwidth-demanding applications like competitive gaming or video streaming, you'll want a fast VPN. A good VPN for iPhone should run smoothly and be easy to use, regardless of your technical expertise. For instance, if you're in New York City but connected to a server in the UK, apps like Netflix will think you're across the pond. If you want to save some money, you can choose an annual subscription, where prices can range from roughly $30 to $100 per year. (Disclosure: IPVanish is owned by the same parent company as CNET, Ziff Davis.)"
  },
  {
    "title": "The Best Protein Bar: 5 Dietitians Explain Which Ingredients to Look For",
    "slug": "the-best-protein-bar-5-dietitians-explain-which-ingredients-to-look-for",
    "link": "https://www.cnet.com/health/best-protein-bar-dietitians-ingredients/#ftag=CAD590a51e",
    "published": "2025-07-19 12:00",
    "image": "https://www.cnet.com/a/img/resize/ff10e5abdba462058e850869aa84720271b627c7/hub/2025/03/19/09f10239-d18e-4019-a848-29274a657a6b/gettyimages-1389479822.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "If you're overwhelmed by the countless protein bars out there, we asked dietitians to help narrow down which are the best.",
    "full_text": "So if you know your stomach can't handle too much fiber, stick with less processed options. The protein bar you're eyeing likely has added sweeteners in order to make it appetizing. Nosek cautions clients with gastric issues to be mindful of the bars marketed as \"no sugar added\" or \"low carb\" because this may indicate that they contain sugar alcohols. \"This ingredient may raise cholesterol and increase risk for heart disease,\" she said. If you're vegan, reach for plant-based bars that blend high-quality plant proteins and other whole-food ingredients like dates or oats. If you're on a tight budget, purchasing protein bars in bulk can be more cost-effective. If you're aiming to use protein bars as a meal replacement, Ti suggests sticking with bars that have a balance of all the macronutrients like protein, complex carbohydrates and healthy fats. These are some of the protein bars dietitians recommended to us and that you can pick up in store or online: Ideally, you should receive protein from whole foods like lean meats and plant-based options. Remember that supplements should help add to an already healthy diet, not serve as a replacement for long-term use."
  },
  {
    "title": "My Early Time Testing the Galaxy Z Flip 7 Brought a Smashing Surprise",
    "slug": "my-early-time-testing-the-galaxy-z-flip-7-brought-a-smashing-surprise",
    "link": "https://www.cnet.com/tech/mobile/my-early-time-testing-the-galaxy-z-flip-7-brought-a-smashing-surprise/#ftag=CAD590a51e",
    "published": "2025-07-19 11:30",
    "image": "https://www.cnet.com/a/img/resize/ff577bd625832ab590ea517bea0517f0c83f2169/hub/2025/07/11/898c4fbe-331b-44b3-a08b-de46106c2087/img-2664.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Commentary: Samsung rolled out a major change to its foldable phones. And I can definitely vouch for the Galaxy Z Flip 7's sturdiness.",
    "full_text": "After less than six hours with the Galaxy Z Flip 7, I accidentally performed my own informal drop test. I watched helplessly as Samsung's newest foldable phone fell to the ground. For some perspective, here's how the Flip 7 compares to its clamshell kinfolk: The original Galaxy Z Flip had a tiny, 1.1-inch pill-shaped cover display. The Flip 6 had a 6.7-inch display, but that extra 0.2 inches on the Flip 7's screen makes it feel much bigger, which my middle-aged eyes are grateful for. In terms of functionality, the cover screen's natural state is widgets. It takes a couple of minutes to set up, but I do wish the interface supported apps by default. Here are some of my favorite photos from the Galaxy Z Flip 7 so far: Enlarge Image New York streets look great at night after it rains, especially in this photo I took with the main camera. 12: The Galaxy Z Flip 7 runs on Samsung's Exynos 2500 chip."
  },
  {
    "title": "I Tested the Inmotion V9 EUC, and It's Easily One of the Best Choices for Beginners",
    "slug": "i-tested-the-inmotion-v9-euc-and-it-s-easily-one-of-the-best-choices-for-beginners",
    "link": "https://www.cnet.com/roadshow/news/inmotion-v9-euc-review-easily-one-of-the-best-choices-for-beginners/#ftag=CAD590a51e",
    "published": "2025-07-19 11:00",
    "image": "https://www.cnet.com/a/img/resize/9c03a21522c31c7f77b89b3a1929d7a84f0423b4/hub/2025/07/18/776f5b94-cd26-499f-a7c0-bcb848f55698/screenshot-2025-07-18-at-9-30-57am.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "This is the first Inmotion electric unicycle with UL certification and a built-in eSIM, which lets owners easily locate their wheel. This V9 electric unicycle is a fantastic option for first-timers.",
    "full_text": "I say that as someone who's been riding wheels for years now and prefers them to e-bikes. Weighing just over 50 pounds, the V9 is not just on the lighter side overall, but impressively light for a model with a suspension system. Riders must add air to both the suspension system's top and bottom, which can be inconvenient. The wheel can be powered on while tilted for rider protection and will autobalance once upright. The wheel isn't loud but emits a gentle purr while riding. Charging with the included 2-amp charger takes around 5 hours, but Inmotion also offers a 10-amp fast charger that can get you back on the road in about an hour. Just top off the battery, and you're ready to roll. While it's not a touchscreen like other Inmotion models, settings can be adjusted through the Inmotion app, which is also where you can track and lock the wheel. This feature is free for the first year, with a subscription required afterward. I love how these wheels are advancing while hitting a more affordable price."
  },
  {
    "title": "The GameSir G8 Plus Is a Solid Mobile Controller, With One Big Caveat",
    "slug": "the-gamesir-g8-plus-is-a-solid-mobile-controller-with-one-big-caveat",
    "link": "https://www.cnet.com/tech/gaming/the-gamesir-g8-plus-is-a-solid-mobile-controller-with-one-big-caveat/#ftag=CAD590a51e",
    "published": "2025-07-19 11:00",
    "image": "https://www.cnet.com/a/img/resize/02c36ae8c07bc63bf7374b211b789faf9d2eba0e/hub/2025/07/16/bae0be30-6455-4745-b683-19a0980a46f8/gamesir-g8-plus-on-wood.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "If you don't mind a bad app, the G8 Plus is a solid controller.",
    "full_text": "It's comfortable to hold, even for long periods of time. It feels like an Xbox controller that stretches in half to make room for your phone, which is a good thing. D-Pads often gets overlooked on mobile controllers, but it's solid here. GameSir also offers a couple different joystick tops so you can pick the one that suits your gameplay. Your own games are hidden behind a tab on the Device page. This is also where you setup the virtual touch mapping for games such as Call of Duty: Mobile that don't natively support controllers. For example, after playing COD:M on the G8 Plus, I switched back to the Elo Vagabond to find it no longer worked; my phone didn't recognize it at all. But it's also pricey at $100, especially with the poor app experience. If GameSir put some work into its app, the G8 Plus would be much easier to recommend. I also wish it came with a case, but there are some on Amazon that don't look too bad."
  },
  {
    "title": "Prime Video: 18 of the Best Sci-Fi TV Shows to Watch",
    "slug": "prime-video-18-of-the-best-sci-fi-tv-shows-to-watch",
    "link": "https://www.cnet.com/tech/services-and-software/prime-video-best-sci-fi-tv-shows-2025/#ftag=CAD590a51e",
    "published": "2025-07-19 11:00",
    "image": "https://www.cnet.com/a/img/resize/9a9efde40b081de8db339f0ca4fb1a2e91d942d2/hub/2025/04/23/46e70e86-5c08-4ad6-b7a9-92fb64fab6e4/fallout-season-1-walton-goggins.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Amazon Prime Video's sci-fi library is pretty epic.",
    "full_text": "No matter the flavor, these are all top-tier choices for your next binge night. Believe it or not, I'm just scratching the surface of Prime Video's epic content library. If you haven't figured it out yet, there's a jam-packed list of goodies to sift through. Jonathan Pryce and Rebecca Hall deliver standout performances in this quirky, slow-burn sci-fi series. This would be it if you're looking for a trippy series grounded in its writing and stellar performances. The futuristic anthology series explores how technology can impact humanity in various fantastic and horrific ways. It's seen by many as the best superhero show on TV, and for good reason. This updated twist on David Cronenberg's cult horror classic finds Rachel Weisz in the dual-starring role as doctors Elliott and Beverly Mantle. One could easily view the show as an ethereal work of art but there's also deep substance here. The show follows Alma (Rosa Salazar), a troubled 20-something whose life is turned on its head after she suffers an accident."
  },
  {
    "title": "Low-Income Internet Guide for All 50 States",
    "slug": "low-income-internet-guide-for-all-50-states",
    "link": "https://www.cnet.com/home/internet/low-income-internet-guide-for-all-50-states/#ftag=CAD590a51e",
    "published": "2025-07-19 11:00",
    "image": "https://www.cnet.com/a/img/resize/175f243f1ca0d36bc8f71e67ed160ac8e2d32290/hub/2024/06/26/7f4ddb22-d624-4355-a9e6-444103c82e48/acp-state-guideline-promo-image.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "The ACP is no longer active, but there are still options for low-cost internet service. CNET shares top picks for each state to help you stay connected.",
    "full_text": "It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts. It delivers up to 200Mbps service for $30 per month with a Wi-Fi modem, 24/7 tech support and no required contracts."
  },
  {
    "title": "Mapping the Margins: The Internet's Invisible Hand in Reproductive Care",
    "slug": "mapping-the-margins-the-internet-s-invisible-hand-in-reproductive-care",
    "link": "https://www.cnet.com/home/internet/mapping-the-margins-the-internets-invisible-hand-in-reproductive-care/#ftag=CAD590a51e",
    "published": "2025-07-19 11:00",
    "image": "https://www.cnet.com/a/img/resize/d49aea1e490e46177849b79ca48e07811b9cd32c/hub/2025/07/18/68bf0ff9-c86c-46fc-aacf-1d842e7387ad/collision-of-broadband-deserts-and-reproductive-care-deserts-v2.png?auto=webp&fit=crop&height=614&width=1092",
    "summary": "When abortion and broadband deserts collide, they can exact a devastating toll on women's lives.",
    "full_text": "We don’t often think about the internet as being good for our health. The report defines an abortion desert as a county where an abortion clinic is more than 100 miles away -- but Javaid admits that doesn’t fully capture the challenge. \"100 miles is still a long way to go,\" Javaid said. The report states that one in 10 US counties are broadband deserts, where more than half of residents do not have access to at least 100Mbps down/20Mbps up (a definition set by the Federal Communications Commission). \"We know that it is likely an undercount because of the way they collect data. Although broadband is available to 94% of US households, according to current FCC numbers, that data doesn't account for the number of homes enrolled in an internet service. A 2024 Pew Research Center survey found that only 57% of adults making less than $30,000 a year have an internet subscription, compared to 95% of adults making at least $100,000. (Disclaimer: Ookla is owned by Ziff Davis, the same company that owns CNET.) With the passing of Dobbs v. Jackson, access to safe reproductive care is more threatened than ever: Infant mortality rates increased after the passing of Dobbs, specifically in states that instituted complete or 6-week abortion bans. Some possible solutions to making broadband more affordable and ensuring access to telehealth include state low-income requirements, like New York's $15 low-income plan required for ISPs serving 20,000 households or more."
  },
  {
    "title": "Best iPhone in 2025: Here's Which Apple Phone You Should Buy",
    "slug": "best-iphone-in-2025-here-s-which-apple-phone-you-should-buy",
    "link": "https://www.cnet.com/tech/mobile/best-iphone/#ftag=CAD590a51e",
    "published": "2025-07-19 10:30",
    "image": "https://www.cnet.com/a/img/resize/bca52d83b3da64edd712d6636171eeac61ce2c8c/hub/2024/09/18/f4dfbd54-08f9-42cc-9309-1c3923a06558/iphone-16-plus-pro-pro-max-family-4559.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "We've tested and reviewed every Apple phone, including the iPhone 16, 16E and 16 Pro. Here are the iPhone models we recommend in 2025 depending on your needs.",
    "full_text": "These updates not only ensure you get many of the latest features, but also keep your phone secure. Phones are big in general, with the smallest ones having a 6.1-inch screen and larger models topping out at 6.8 inches. Also, I should note that the entry-level $999 iPhone 16 Pro only has 128GB of storage. I also think that this is a good phone for people using Android phones who want to switch and dip the proverbial toe into Apple's waters. I also think that this is a good phone for people using Android phones who want to switch and dip the proverbial toe into Apple's waters. And find out what your grace period is in case you need a quick return or exchange. Emergency SOS might be one of the most important features to come out on any phone this year. We evaluate whether a newer version of the iPhone includes enough features to make it worth upgrading from older models. Other iPhones we tested While Apple doesn't sell the iPhone 15 Pro, you can still find it at carriers and third-party retailers. And while there are already rumors about the iPhone 17, it likely won't go on sale until September 2025."
  },
  {
    "title": "Best Chest Strap Heart-Rate Monitors for Your 2025 Workouts, Fitness Expert-Approved",
    "slug": "best-chest-strap-heart-rate-monitors-for-your-2025-workouts-fitness-expert-approved",
    "link": "https://www.cnet.com/health/fitness/best-chest-strap-heart-rate-monitors/#ftag=CAD590a51e",
    "published": "2025-07-19 10:08",
    "image": "https://www.cnet.com/a/img/resize/bf53a0fd3f75115bbebd5224a91ea80a348c1dcc/hub/2019/08/03/712fcbcd-1660-47e9-baec-c19eee0d15cd/gettyimages-976211922.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Tested by our CNET fitness expert and recommended by the personal trainers we consulted, these are the best chest strap heart-rate monitors for your workouts.",
    "full_text": "Why we like it: The Polar H10 is ideal for outdoor activities. The Polar H10 can connect to two Bluetooth devices at once, so you can connect it to both your smartwatch and a compatible piece of fitness equipment, like some treadmills or exercise bikes. Once you're in the app, it's easy to go into settings and connect to the heart-rate monitor as long as your phone's Bluetooth is on. This heart-rate monitor can also be used for swimming, as it's waterproof. It picks up the most accurate data from your heart and gives out the best output for your overall heart-rate training, caloric output and can help when someone is looking to really keep track of their daily intake and output.\" Their monitors (like the H10) are comparable to ECG-level accuracy. De Leon agrees, adding that this monitor would also be great for anyone who is curious to explore more data when exercising. Who should not get it: This device is best for outdoor activities, so it may not be right for those who exercise indoors. Chakoian adds that she wouldn't recommend this device to \"someone who could potentially abuse this device or is only looking to move their body without any tracking of calories or workouts.\" De Leon agrees, stating, \"People who are recovering from an eating disorder or anyone who will obsess over hitting their numbers probably should skip the heart rate monitor.\""
  },
  {
    "title": "These Are CNET's Favorite and Most-Used Emoji. Did Yours Make the List?",
    "slug": "these-are-cnet-s-favorite-and-most-used-emoji-did-yours-make-the-list",
    "link": "https://www.cnet.com/tech/services-and-software/these-are-cnets-favorite-and-most-used-emoji-did-yours-make-the-list/#ftag=CAD590a51e",
    "published": "2025-07-19 10:00",
    "image": "https://www.cnet.com/a/img/resize/c2976e22ca84e06e959b3034d4206054f3475a9a/hub/2025/07/16/9e221b07-0ae6-442a-beb0-39c8a23d5281/emojipedia-lg-header-image.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Smileys, prayer hands and the troll all made the list.",
    "full_text": "Every July 17, the internet comes together and celebrates World Emoji Day. There was more variety in the category of favorite emoji since individual tastes are subjective, while there was more homogeneity among most used emoji -- not surprising in a work environment. 2 emoji were tied for our favorite, and the vibe is 'everything's fine' \"Melting smiley face is just a perfect encapsulation of when you're on the verge of a meltdown from things going awry but you have to keep smiling through it all,\" said CNET Editor-at-Large Bridget Carey, who voted for the melting face. The grimacing emoji is here to say 'people really didn't think this through' and 'way to pour gasoline on a fire' all in brief unicode,\" said CNET senior writer David Lumb, who voted for the grimacing face emoji. That means CNET's two favorite emoji can be used to convey negative emotions. Does that mean we're all struggling with feelings of nervousness at any given time, or always anxious? I love his awkward grin and unruly hair paired with an all-powerful wooded scepter.\" said CNET Senior Producer Wesley Ott, who voted for the seat emoji. The folded hands emoji has also been used at times to connote someone begging or requesting something."
  },
  {
    "title": "Sales Tax Holidays: 17 States Are Holding Tax-Free Back-to-School Shopping Events This Summer. Here's When",
    "slug": "sales-tax-holidays-17-states-are-holding-tax-free-back-to-school-shopping-events-this-summer-here-s-when",
    "link": "https://www.cnet.com/personal-finance/taxes/sales-tax-holidays-17-states-are-holding-tax-free-back-to-school-shopping-events-this-summer-heres-when/#ftag=CAD590a51e",
    "published": "2025-07-19 10:00",
    "image": "https://www.cnet.com/a/img/resize/6607b3a1c8a64db990112f7da4979fa8113df9d1/hub/2024/07/17/b95783dd-0926-4112-b9d0-ad2f2eb57502/tax-holiday.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "If your state participates, you can save a little extra on school supplies, clothing, laptops and more.",
    "full_text": "State sales tax holidays usually run for one weekend, though some states offer longer exemptions. If you haven't already started buying back-to-school essentials, shopping during a sales tax holiday can offer some extra savings. Here's when they're happening and which items will be tax-free. 25-27, 2025 Tax-free items Clothing and shoes: $100 or less per item. There are five US states that don't have a statewide sales tax. Just make sure you follow your state's guidelines for qualifying items. What happens if I buy a qualifying item that's over the dollar limit? Rules for sales tax holidays will vary by state, but in most states the exemption is all or nothing. We recommend reviewing your state's full item list and rules to plan accordingly. Most states require all cities and businesses therein to participate in tax-free holidays."
  },
  {
    "title": "NOBS Toothpaste Tablets: What Dentists Say About Its Main Ingredient",
    "slug": "nobs-toothpaste-tablets-what-dentists-say-about-its-main-ingredient",
    "link": "https://www.cnet.com/health/personal-care/nobs-toothpaste-tables-what-dentists-say-main-ingredient/#ftag=CAD590a51e",
    "published": "2025-07-19 09:27",
    "image": "https://www.cnet.com/a/img/resize/b23f0b1e31c0a2c8413569872c46274154c6a210/hub/2025/07/11/6fbaf2cb-a00b-4a63-b302-405cd0aa4992/person-brushing-teeth.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "These are the benefits and side effects of viral nano-hydroxyapatite toothpastes like NOBS, as well as why dentists recommend trying the fluoride-free alternative.",
    "full_text": "The NOBS (No Bad Stuff) toothpaste tablets are going viral thanks to their main ingredient of nano-hydroxyapatite, a fluoride-free alternative. As health concerns around fluoride and its presence in public drinking water continue to swirl, nano-hydroxyapatite toothpastes are becoming increasingly popular. It is a type of calcium that makes up bones and teeth,\" says Lai. \"n-HA can actually fill microscopic cracks and help reverse or arrest early cavities,\" adds dentist Dr. Sandip Sachar. \"The particle size could get into space and work better than larger particles in micro-hydroxyapatite or fluoride,\" he explains. Fluorosis occurs when you get too much fluoride as a child, causing white or brown spots on the teeth. For my high-risk patients, I often recommend a combo toothpaste that includes both ingredients when appropriate.\" \"The best scientific evidence has shown that adding fluoride to community water supplies is safe and effective. All of the experts we consulted do recommend nano-hydroxyapatite toothpaste, but only for certain patients. However, she advises that patients with moderate to high cavity risk not fully abandon fluoride."
  },
  {
    "title": "Best Internet Providers in Charleston, South Carolina",
    "slug": "best-internet-providers-in-charleston-south-carolina",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-charleston-sc/#ftag=CAD590a51e",
    "published": "2025-07-19 08:27",
    "image": "https://www.cnet.com/a/img/resize/a73a49b31fe73cdaa0927eef94ce178d91c1779a/hub/2023/07/25/63c8c729-c914-4768-a310-a4e68275005f/charleston-gettyimages-1067850632.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Charleston's top internet provider is AT&T Fiber, according to CNET's experts. But there are great alternatives available if you can't get it at your address.",
    "full_text": "That’s better than Columbia, where only 91% of households can access similar speeds. Charleston has more ISPs than many other cities in the US, providing a rather extraordinary range of options. Home Telecom : This company covers about 9% of Charleston, with availability mostly in the Daniel Island area. But it's a local outfit, equipment is included and there are no data caps or contracts. : This company covers about 9% of Charleston, with availability mostly in the Daniel Island area. But it's a local outfit, equipment is included and there are no data caps or contracts. : We recommend avoiding satellite internet in Charleston, given that cheaper and faster options are widely available. (Disclosure: Ookla is owned by the same parent company as CNET, Ziff Davis.) ISP plans and prices are subject to frequent changes; all information provided is accurate as of our prepublication fact-check. Xfinity covers the greatest number of addresses but comes with data caps and temporary discounts."
  },
  {
    "title": "Best Internet Providers in Colorado",
    "slug": "best-internet-providers-in-colorado",
    "link": "https://www.cnet.com/home/internet/best-internet-providers-in-colorado/#ftag=CAD590a51e",
    "published": "2025-07-19 07:52",
    "image": "https://www.cnet.com/a/img/resize/31d88bda84c722ca6fae4409ab51ca80e533f1f1/hub/2023/08/17/e2b84d8a-8793-4f7b-8366-22c335c2f731/colorado-gettyimages-1345729945.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "From fiber to fixed wireless, these are the top broadband service options in Colorado.",
    "full_text": "The cheapest internet in Colorado is Rise Broadband's $40-a-month plan, which offers speeds of 25 megabits per second. Our chart contains quite a few small, local fixed wireless ISPs that are focused on serving the rural reaches of Colorado. Satellite internet can be slow and expensive (especially with upfront equipment costs), but it may be the only option in some very rural locations or in areas where you don’t have a good line of sight to a fixed wireless tower. Internet pricing can get complicated when you factor in renting or buying gear and plan prices that may jump after promotional periods expire. For a more extensive list of promos, check out our guide on the best internet deals. One place you can do that is in Fort Collins, where municipal fiber broadband plans go up to an impressive 10 gigabits. ISP plans and prices are subject to frequent changes; all information provided is accurate as of publication. Based on that, the state’s broadband map shows about 94% of locations are served with those speeds. Colorado’s mountainous and rural areas can be challenging to reach, but this BEAD funding should help push through broadband improvements across the state. Colorado ranks 30th in median download speeds, according to Ookla -- leaving plenty of room for improvement."
  },
  {
    "title": "How to Watch Australia vs. British & Irish Lions From Anywhere: Stream 1st Test Rugby Union for Free",
    "slug": "how-to-watch-australia-vs-british-irish-lions-from-anywhere-stream-1st-test-rugby-union-for-free",
    "link": "https://www.cnet.com/tech/services-and-software/how-to-watch-australia-vs-british-irish-lions-from-anywhere-stream-1st-test-rugby-union-for-free/#ftag=CAD590a51e",
    "published": "2025-07-19 07:00",
    "image": "https://www.cnet.com/a/img/resize/f44507503503b4111bb07e206c7b8e86a0e0753c/hub/2025/07/18/2a3013f4-3cd1-4e6e-82c2-d4efe68f3607/gettyimages-2223337335.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Andy Farrell's Lions get their three-match series against the Wallabies underway in Brisbane.",
    "full_text": "After weeks of build up, the British & Irish Lions Test series down under finally gets underway on Saturday as Andy Farrell's men take on Australia at Suncorp Stadium in Brisbane. Kickoff is set for 8 p.m. AEST local time in Australia, which makes it a 6 a.m. Saracens captain Maro Itoje is set to lead the British & Irish Lions for this series. Rugby fans in the US can watch today's game on streaming service Paramount Plus, which has exclusive rights to show all three of this year's British & Irish Lions Tests in the US. You can also purchase a full year of either plan and save some money versus paying each month individually. How to watch the British & Irish Lions tour online from anywhere using a VPN They can also be helpful when connecting to public Wi-Fi networks while traveling, adding an extra layer of protection for your devices and logins. However, some streaming services may have policies restricting VPN use to access region-specific content. If you're considering a VPN for streaming, check the platform's terms of service to ensure compliance. 61% off with 2yr plan (+4 free months) See at Go.expressvpn"
  },
  {
    "title": "Today's NYT Mini Crossword Answers for Saturday, July 19",
    "slug": "today-s-nyt-mini-crossword-answers-for-saturday-july-19",
    "link": "https://www.cnet.com/tech/gaming/todays-nyt-mini-crossword-answers-for-saturday-july-19/#ftag=CAD590a51e",
    "published": "2025-07-19 02:18",
    "image": "https://www.cnet.com/a/img/resize/16d2290ea5c9dc928db9624c275de45ff920b828/hub/2024/07/25/50d61b9b-1c76-4678-9a92-f6eca531f4a8/nyt-mini-crossword-234876.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Here are the answers for The New York Times Mini Crossword for July 19.",
    "full_text": "Good thing I remembered how to spell it. Keep reading for help with today's Mini Crossword. Read more: Tips and Tricks for Solving The New York Times Mini Crossword Let's get to those Mini Crossword clues and answers. 9A clue: Salamander known for its regenerative abilities (and adorable appearance) 13A clue: Insect seen in Dalí's \"The Persistence of Memory\" 1D clue: Party snack made with cereal and pretzels 3D clue: Airline whose name comes from the Book of Hosea 7D clue: Command that uses the \"V\" key 8D clue: Pulling their arms might win you money"
  },
  {
    "title": "UFC 318: Holloway vs. Poirier 3 -- Everything to Know to Watch via Livestream",
    "slug": "ufc-318-holloway-vs-poirier-3-everything-to-know-to-watch-via-livestream",
    "link": "https://www.cnet.com/tech/services-and-software/ufc-318-holloway-vs-poirier-3-everything-to-know-to-watch-via-livestream/#ftag=CAD590a51e",
    "published": "2025-07-19 01:00",
    "image": "https://www.cnet.com/a/img/resize/52bf60929f342fd100e5372da5e7d17728f9768b/hub/2025/07/18/6f1d7b84-894f-4faf-b298-d91e8178aa47/gettyimages-1142542985.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "Much anticipated trilogy clash sees \"The Diamond\" looking to go out in style.",
    "full_text": "Max Holloway and Dustin Poirier go toe-to-toe for a third time on Saturday, with their eagerly awaited lightweight bout the headline act at UFC 318 in New Orleans. Catch all the action live by following our guide to watching UFC 318. UFC 318 takes place at the Smoothie King Center in New Orleans, Louisiana on Saturday July 19. The main card gets going at 9 p.m. CDT local time (10 p.m. It's hard to say exactly when the main event will take place, but if you're looking to only watch the fight between Holloway and Poirier, ring walks will start no earlier than midnight ET (9 p.m. PT). Existing annual ESPN Plus subscribers can order the upcoming UFC card for $80. It costs £30 either way and comes in a package that includes Discovery Plus' library of documentary content. That means you can also watch online via sports streaming service Kayo for AU$60. Whichever option you choose, it's a PPV fee of CA$70 across the board. It's also worth noting that early prelims will be available to stream via UFC Fight Pass, while the event's Prelims will be shown on Sportsnet and TVA Sports."
  },
  {
    "title": "When Will You See AI-Generated Content on Netflix? It's Possible You Already Have",
    "slug": "when-will-you-see-ai-generated-content-on-netflix-it-s-possible-you-already-have",
    "link": "https://www.cnet.com/tech/services-and-software/when-will-you-see-ai-generated-content-on-netflix-its-possible-you-already-have/#ftag=CAD590a51e",
    "published": "2025-07-19 00:08",
    "image": "https://www.cnet.com/a/img/resize/c77ce50ce575065f5f16e2824f30897bc6579f07/hub/2025/07/18/67407eaf-147f-4600-955c-185e5113a4a0/eternaut.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "A graphic-novel adaptation from Argentina already used AI to generate final footage, Netflix's CEO says.",
    "full_text": "How soon will it be before Netflix subscribers begin to see movies and TV show that were made with generative AI technology? In a video conference call after Netflix's earnings were announced on July 17, Sarandos took questions, one of which was focused on when and how the streaming company will generate content with artificial intelligence tools. For a scene showing a building collapsing in Buenos Aires, Netflix's tech team worked with the filmmakers to generate AI footage that was used as final footage. \"We remain convinced that AI represents an incredible opportunity to help creators make films and series better, not just cheaper,\" Sarandos said in the call. \"They were able to achieve an amazing result with remarkable speed,\" Sarandos said. El Eternauta has already been renewed for a second season and received positive reviews. \"Netflix using AI for final footage in El Eternauta isn't entirely surprising given their track record of embracing new technologies early -- from streaming to algorithm-driven recommendations to interactive content,\" Kate O'Neill, founder of KO Insights and author of What Matters Next, told CNET. \"What's notable is how matter-of-factly CEO Ted Sarandos revealed this, suggesting they view it as a natural evolution rather than a watershed moment,\" O'Neill says. Some of those ethical and legal questions include what data AI models are being trained on and if intellectual property is being infringed upon, not to mention the effect widespread AI may have on an industry of actors, craftspeople and digital-effects workers. \"While AI can democratize access to sophisticated visual effects, we need transparency about how these tools are trained and whether they're incorporating existing copyrighted material,\" O'Neill says."
  },
  {
    "title": "Benchmark in talks to lead Series A for Greptile, valuing AI-code reviewer at $180M, sources say",
    "slug": "benchmark-in-talks-to-lead-series-a-for-greptile-valuing-ai-code-reviewer-at-180m-sources-say",
    "link": "https://techcrunch.com/2025/07/18/benchmark-in-talks-to-lead-series-a-for-greptile-valuing-ai-code-reviewer-at-180m-sources-say/",
    "published": "2025-07-18 23:21",
    "image": "https://images.unsplash.com/photo-1665808590824-dd12b41dd46a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx5YyUyMGFsdW0lMjBncmVwdGlsZSUyMHJhaXNlc3xlbnwwfHx8fDE3NTI4ODE0MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "YC alum Greptile raises $30M Series  A.",
    "full_text": "But one person says that the deal hasn’t closed and terms may change. Founded by Dasksh Gupta after he graduated from Georgia Tech in 2023, the startup went through Y Combinator in the winter of 2024 cohort, and raised a $4 million seed round led by Initialized Capital after completing its program. Gupta told TechCrunch last year that the bot his company developed acts as an experienced coworker, possessing a deep understanding of the customer’s code, which enables it to pinpoint bugs and other potential issues that human reviewers might miss. As with most areas of AI, the code review space is very competitive. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. Whatever the work culture, attracting an A-list VC like Benchmark at a healthy Series A valuation, could also be helpful in Greptile’s journey. Greptile and Benchmark did not respond to a request for comment."
  },
  {
    "title": "Why AI is moving from chatbots to the browser",
    "slug": "why-ai-is-moving-from-chatbots-to-the-browser",
    "link": "https://www.theverge.com/command-line-newsletter/710313/ai-moves-chatbots-to-web-browser-chatgpt-agent-perplexity-comet",
    "published": "2025-07-18 19:04",
    "image": "https://images.unsplash.com/photo-1648289417891-32b784c583be?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxnZXR0aW5nJTIwY292ZXJlZCUyMGxpa2UlMjBuYmElMjB0cmFkZXN8ZW58MHx8fHwxNzUyODgwNTEyfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Happy Friday. I'm back from vacation and still getting caught up on everything I missed. AI researchers moving jobs is getting covered like NBA trades now, apparently. Before I get into this week's issue, I want to make sure you check out my interview with Perplexity CEO Aravind Srinivas on Decoder this week. It's a […]",
    "full_text": "But as I told Perplexity CEO Aravind Srinivas on Decoder this week, the overall experience feels quite brittle. During our chat this week, Srinivas told me he’s “betting on progress in reasoning models to get us there.” OpenAI built a custom reasoning model specifically for ChatGPT Agent that was trained on more complex, multi-step tasks. (The model has no public name and isn’t available via an API.) Substack’s leadership rebuffed his takeover interest but suggested he could invest in the round they just closed. Substack’s leadership rebuffed his takeover interest but suggested he could invest in the round they just closed. It’s an unfortunate byproduct of the antitrust scrutiny on Big Tech, which so far seems to have figured out how to acquire what it wants by leaving behind a husk of a startup and calling its payouts “licensing fees.” But given how Cognition messaged its rescuing of Windsurf’s remaining team (“every single employee is treated with respect and well taken care of in this transaction”), I wonder if the next AI startup founder will think twice before leaving their team behind. Meanwhile, Boris Cherny and Cat Wu Paul Smith is also leaving ServiceNow to be Anthropic’s first chief commercial officer. Reddit CMO Roxy Young is leaving amid what appears to be a broader leadership reshuffling. More brain drain at Tesla: This time it’s, head of sales for North America. Andy Byron and HR chief Kristin Cabot (that couple from the Coldplay concert) have Astronomer CEOand HR chief(that couple from the Coldplay concert) have been put on leave pending an internal investigation."
  },
  {
    "title": "Microsoft Will Erase Your Passwords in 2 Weeks: What to Do Now",
    "slug": "microsoft-will-erase-your-passwords-in-2-weeks-what-to-do-now",
    "link": "https://www.cnet.com/tech/microsoft-will-erase-your-passwords-in-2-weeks-what-to-do-now/#ftag=CAD590a51e",
    "published": "2025-07-18 23:00",
    "image": "https://www.cnet.com/a/img/resize/3468cfd6c52e4ed7393d3886df02150807f9fbe7/hub/2025/06/18/2fdc8606-3277-40bb-9392-ebc6fe4e994b/gettyimages-1296451468.jpg?auto=webp&fit=crop&height=614&width=1092",
    "summary": "If the Authenticator app is your go-to password manager, you'll need to pick a new one soon.",
    "full_text": "That means your logins will soon rely more on things like PINs, fingerprint scans or facial recognition. If you're a fan of Authenticator and not sure where to start before the switch, here are other password managers CNET recommends and steps you should take before August. Microsoft Authenticator houses your passwords and lets you sign into all your Microsoft accounts using a PIN, facial recognition like Windows Hello, or other biometric data like a fingerprint. Authenticator can be used in other ways, such as verifying you're logging in if you forgot your password, or using two-factor authentication as an extra layer of security for your accounts. In June, the company stopped letting users add passwords to Authenticator. Starting this month, you won't be able to use the autofill password function. And next month, you'll no longer be able to use saved passwords. \"Passkeys use public key cryptography to authenticate users, rather than relying on users themselves creating their own (often weak or reused) passwords to access their online accounts,\" Tomaschek said. Tomaschek has a few of the best password manager recommendations after testing and reviewing several. From a price perspective, the free plan lets you store infinite passwords across unlimited devices."
  },
  {
    "title": "Why a Y Combinator startup tackling AI agents for Windows gave up and pivoted",
    "slug": "why-a-y-combinator-startup-tackling-ai-agents-for-windows-gave-up-and-pivoted",
    "link": "https://techcrunch.com/2025/07/18/why-a-y-combinator-startup-tackling-ai-agents-for-windows-gave-up-and-pivoted/",
    "published": "2025-07-18 22:33",
    "image": "https://images.unsplash.com/photo-1659297396001-fa8d15dcad1a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjb250cm9sbGluZyUyMHdpbmRvd3MlMjBkZXNrdG9wc3xlbnwwfHx8fDE3NTI4Nzg3MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Pig.dev was working on a problem that could have been revolutionary: agent tech for controlling Windows desktops.",
    "full_text": "But in May, the founder announced he was abandoning the tech and pivoting his company to something entirely different: Muscle Mem, a cache system for AI agents that allows them to offload repeatable tasks. What’s interesting — and what sparked a dynamic conversation on Thursday’s Y Combinator podcast — is that Pig was working on computer use, one of the big areas that needs to be solved for agents to be truly useful in the workforce. As the context window for reasoning grows, an agent’s accuracy wavers while LLM costs increase. They’re here to deliver the insights that fuel startup growth and sharpen your edge. They’re here to deliver the insights that fuel startup growth and sharpen your edge. But alas, Pig’s founder Erik Dunteman has already given up on the idea. Dunteman declined further comment about his decision to ditch Windows automation, although the Pig.dev website and GitHub documents remain available. However, Dunteman did tell us his new tool was inspired by the computer use problem. “What we’re working on now is directly inspired by and applicable to computer use, just at the developer tooling layer. I remain very optimistic for computer use as ‘the last mile,’” he told TechCrunch."
  },
  {
    "title": "The best Sonos speakers to buy in 2025",
    "slug": "the-best-sonos-speakers-to-buy-in-2025",
    "link": "https://www.theverge.com/tech/652171/best-sonos-speakers",
    "published": "2025-07-18 18:10",
    "image": "https://images.unsplash.com/photo-1585932350398-48fdaaf20ad8?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxpbnRlcmltJTIwY2VvJTIwdG9tJTIwY29ucmFkfGVufDB8fHx8MTc1Mjg3NjkxMXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "After the year of self-induced tumult that Sonos has been through, I can understand why some people are reluctant to spend money on the company’s products. But interim CEO Tom Conrad has shown that he’s determined to get back on track and revitalize Sonos as the leading whole-home audio brand. The contentious mobile app is […]",
    "full_text": "But interim CEO Tom Conrad has shown that he’s determined to get back on track and revitalize Sonos as the leading whole-home audio brand. I wouldn’t fault anyone for waiting to see where Sonos and its app go from here. Adaptability Collapse Part of what makes the Sonos ecosystem so appealing is everything you can do with it. But once you throw some music on, its powerful stereo output is enough to handle any dinner party or weekend get-together. The Move 2 is both water-resistant and drop-resistant, so it’s built for handling your outdoor parties. This means some buyers can get away with buying the Arc Ultra on its own without adding a subwoofer. Sound-wise, it’s not far off from the old Sonos One / Play:1 and is a very enjoyable speaker. And the TV Audio Swap feature is a useful perk that I still often use late at night when my Arc Ultra would disturb others. TV Audio Swap lets you privately listen to whatever’s coming out of your Sonos soundbar without disturbing others. But they remain a wholly impressive debut that fell victim to the company’s poor software decisions."
  },
  {
    "title": "ServiceNow’s acquisition of Moveworks is reportedly being reviewed over antitrust concerns",
    "slug": "servicenows-acquisition-of-moveworks-is-reportedly-being-reviewed-over-antitrust-concerns",
    "link": "https://techcrunch.com/2025/07/18/servicenows-acquisition-of-moveworks-is-reportedly-being-reviewed-over-antitrust-concerns/",
    "published": "2025-07-18 21:04",
    "image": "https://images.unsplash.com/photo-1617704317772-2a75eb51f98b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxzb3VyY2VzJTIwZmFtaWxpYXJ8ZW58MHx8fHwxNzUyODczMzAzfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The probe into the acquisition, which was announced in March, began in June according to sources familiar with the matter.",
    "full_text": "In Brief ServiceNow’s acquisition of enterprise AI startup Moveworks is reportedly drawing regulatory scrutiny. The acquisition is currently under review for antitrust by the U.S. Justice Department, according to Bloomberg, which cited sources familiar with the matter. The probe began in June, Bloomberg reported, and both companies have since received a “second request” calling for additional information that has to be provided before the deal can move forward. ServiceNow announced it was acquiring Moveworks for $2.85 billion in March. At the time, ServiceNow predicted the deal would close in the second half of 2025. Moveworks declined to comment. TechCrunch has reached out to ServiceNow for more information and will update the article if the company responds."
  },
  {
    "title": "The best instant cameras you can buy right now",
    "slug": "the-best-instant-cameras-you-can-buy-right-now",
    "link": "https://www.theverge.com/23133103/best-instant-cameras-fujifilm-polaroid-kodak",
    "published": "2025-07-18 16:52",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24859242/236751_Instant_Camera_Buying_Guide.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "summary": "Even with the ability to take excellent photos with our phones and instantly share them across the world, there’s something magical about the old-school instant camera. With just a click of a button, you can capture a moment in a photo that you can see and touch almost immediately. Images captured by an instant camera […]",
    "full_text": "Other cameras come with advanced creative modes that let you edit photos and even print smartphone pictures, but a young child might find them hard to use. This is something you should take into account before making a purchase, as the cost of film can quickly add up. Fujifilm claims the Mini 12 optimizes image quality in both dark and bright environments better than its predecessor, but I didn’t notice much of a difference. But if you’re looking for an instant camera that offers a great traditional analog experience, this is it. Photos taken with the Kodak Mini Shot 3 aren’t particularly sharp and can have an excessive pink tint. The second-gen Polaroid Now Plus is a good combination of old-school and modern but was way too big for me to comfortably hold with just one hand. The most significant is USB-C support, which allows for faster charging and prevents you from having to spend money on AA batteries. It also comes with physical filter-changing lens and prints on Zinc paper, allowing you to use your photos as stickers. That said, it might be worth a look if you prefer large 2.4 x 2.4-inch square prints and relatively true-to-life photos over vintage-looking stills. In addition, the Flip features new autofocus capabilities powered by a sonar sensor that automatically selects from one of four lenses."
  },
  {
    "title": "Twelve South’s travel-friendly 2-in-1 Qi2 charger is over 50 percent off right now",
    "slug": "twelve-souths-travel-friendly-2-in-1-qi2-charger-is-over-50-percent-off-right-now",
    "link": "https://www.theverge.com/tech/710104/twelve-south-butterfly-se-charger-nothing-phone-3-deal-sale",
    "published": "2025-07-18 16:35",
    "image": "https://images.unsplash.com/photo-1614926781997-9ca2e6d2785a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0cmF2ZWxpbmclMjB1c3VhbGx5JTIwbWVhbnMlMjBwYWNraW5nJTIwc2V2ZXJhbCUyMHdhbGwlMjB3YXJ0c3xlbnwwfHx8fDE3NTI4NzE1MTF8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Keeping multiple devices charged while traveling usually means packing several wall warts and cables. Thanks to the clever design of the Twelve South Butterfly SE 2-in-1 Qi2 Charger, however, you can power two devices with a single, compact accessory. Best of all, the foldable charger is now on sale at Amazon and Best Buy starting […]",
    "full_text": "Keeping multiple devices charged while traveling usually means packing several wall warts and cables. Best of all, the foldable charger is now on sale at Amazon and Best Buy starting at $40.99 ($59 off), which is the lowest price we’ve seen. Belkin offers a variety of great accessories, from cases to audio gear. It’s a good opportunity to save on Belkin’s charging case for the Nintendo Switch 2 and the excellent BoostCharge Pro 3-in-1 Wireless Charging Stand with Qi2 15W , which can charge three devices simultaneously. The wireless Bluetooth party speaker comes with two microphones and an AI vocal removal feature that can remove vocals from “any song from any app,” giving you endless karaoke fodder. It also features light effects, which you can further customize via the Soundcore app. If you’re obsessed with karaoke or frequently host outdoor parties, you can pick up thefrom Amazon and Soundcore (with code) for $279.99 ($70 off), its best price to date. The wireless Bluetooth party speaker comes with two microphones and an AI vocal removal feature that can remove vocals from “any song from any app,” giving you endless karaoke fodder. It also features light effects, which you can further customize via the Soundcore app. Correction, July 18th: An earlier version of this article misstated that the Twelve South Butterfly SE can power two Qi2-compatible devices at once."
  },
  {
    "title": "Cursor snaps up enterprise startup Koala in challenge to GitHub Copilot",
    "slug": "cursor-snaps-up-enterprise-startup-koala-in-challenge-to-github-copilot",
    "link": "https://techcrunch.com/2025/07/18/cursor-snaps-up-enterprise-startup-koala-in-challenge-to-github-copilot/",
    "published": "2025-07-18 19:56",
    "image": "https://images.unsplash.com/photo-1622733914036-aff71c0c2019?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjdXJzb3IlMjBtYWtlciUyMGFueXNwaGVyZXxlbnwwfHx8fDE3NTI4ODMyMDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Cursor maker Anysphere is snapping up top talent from AI enterprise startups in an effort to compete with Microsoft's GitHub Copilot.",
    "full_text": "At the same time, there’s a growing number of startups like Koala: B2B AI startups that seemed promising — with a co-founder from Meta and advisers like Jack Altman — but have quickly run out of steam. Cursor is capitalizing on this disparity, leveraging middling AI startups as a means to build out its own enterprise offerings. They’re here to deliver the insights that fuel startup growth and sharpen your edge. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Much like in Meta and Scale’s deal, Cursor can now move quickly to build out new business segments while leaving questionable businesses behind. In the last year, Cursor has decisively built out its go-to-market and sales team — which now contains dozens of employees. But as Cursor competes with Microsoft, it also needs to fend off a growing field of threats. Cursor relies heavily on Anthropic’s AI models to power its own coding products. (As one of its biggest customers, Cursor is also vital to Anthropic.) AI coding products are being used daily by millions of software engineers, and they have started to generate real revenue."
  },
  {
    "title": "What is Mistral AI? Everything to know about the OpenAI competitor",
    "slug": "what-is-mistral-ai-everything-to-know-about-the-openai-competitor",
    "link": "https://techcrunch.com/2025/07/18/what-is-mistral-ai-everything-to-know-about-the-openai-competitor/",
    "published": "2025-07-18 19:43",
    "image": "https://images.unsplash.com/photo-1743522901873-19ba865b0cb6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmcmVuY2glMjBjb21wYW55JTIwYmVoaW5kJTIwYWklMjBhc3Npc3RhbnQlMjBsZSUyMGNoYXR8ZW58MHx8fHwxNzUyODY3OTA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Mistral AI, the French company behind AI assistant Le Chat and several foundational models, is officially regarded as one of France’s most promising tech startups and is arguably the only European company that could compete with OpenAI. But compared to its $6 billion valuation, its global market share is still relatively low.  However, the recent […]",
    "full_text": "Mistral AI, the French company behind AI assistant Le Chat and several foundational models, is officially regarded as one of France’s most promising tech startups and is arguably the only European company that could compete with OpenAI. While this wave of attention may be encouraging, Mistral AI still faces challenges in competing with the likes of OpenAI — and in doing so while keeping up with its self-definition as “the world’s greenest and leading independent AI lab.” This comes in addition to Mistral AI’s suite of models, which includes: They’re here to deliver the insights that fuel startup growth and sharpen your edge. They’re here to deliver the insights that fuel startup growth and sharpen your edge. CEO Arthur Mensch used to work at Google’s DeepMind, while CTO Timothée Lacroix and chief scientist officer Guillaume Lample are former Meta staffers. Co-founding advisers also include Jean-Charles Samuelian-Werve (also a board member) and Charles Gorintin from health insurance startup Alan, as well as former digital minister Cédric O, which has caused persistent controversy due to his previous role. Introduced in February 2025, Le Chat’s Pro plan is priced at $14.99 a month. On the purely B2B side, Mistral AI monetizes its premier models through APIs with usage-based pricing. This story was originally published on February 28, 2025 and will be regularly updated."
  },
  {
    "title": "A surveillance vendor was caught exploiting a new SS7 attack to track people’s phone locations",
    "slug": "a-surveillance-vendor-was-caught-exploiting-a-new-ss7-attack-to-track-peoples-phone-locations",
    "link": "https://techcrunch.com/2025/07/18/a-surveillance-vendor-was-caught-exploiting-a-new-ss7-attack-to-track-peoples-phone-locations/",
    "published": "2025-07-18 18:45",
    "image": "https://images.unsplash.com/photo-1609390036305-1223ed09af7f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjBzczclMjBieXBhc3MlMjBhdHRhY2slMjB0cmlja3MlMjBwaG9uZSUyMG9wZXJhdG9yc3xlbnwwfHx8fDE3NTI4ODIzMDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The new SS7 bypass attack tricks phone operators into disclosing a cell subscriber's location, in some cases down to a few hundred meters.",
    "full_text": "The attack relies on bypassing security protections that carriers have put in place to protect intruders from accessing SS7, or Signaling System 7, a private set of protocols used by the global phone carriers to route subscribers’ calls and text messages around the world. SS7 also allows the carriers to request information about which cell tower a subscriber’s phone is connected to, typically used for accurately billing customers when they call or text someone from overseas, for example. Researchers at Enea, a cybersecurity company that provides protections for phone carriers, said this week that they have observed the unnamed surveillance vendor exploiting the new bypass attack as far back as late 2024 to obtain the locations of people’s phones without their knowledge. Mc Daid told TechCrunch that the attack was part of an increasing trend in malicious operators using these kinds of exploits to obtain a person’s location, warning that the vendors behind their use “would not be discovering and using them if they were not successful somewhere.” “We anticipate that more will be found and used,” Mc Daid said. Surveillance vendors, which can include spyware makers and providers of bulk internet traffic, are private companies that typically work exclusively for government customers to conduct intelligence-gathering operations against individuals. Governments often claim to use spyware and other exploitative technologies against serious criminals, but the tools have also been used to target members of civil society, including journalists and activists. But due to the nature of these attacks happening at the cell network level, there is little that phone subscribers can do to defend against exploitation. Rather, defending against these attacks rests largely on the telecom companies. In recent years, phone companies have installed firewalls and other cybersecurity protections to defend against SS7 attacks, but the patchwork nature of the global cell network means that not all carriers are as protected as others, including in the United States."
  },
  {
    "title": "CaaStle founder charged with fraud, turns herself in",
    "slug": "caastle-founder-charged-with-fraud-turns-herself-in",
    "link": "https://techcrunch.com/2025/07/18/caastle-founder-charged-with-fraud-turns-herself-in/",
    "published": "2025-07-18 18:30",
    "image": "https://images.unsplash.com/photo-1588534876510-ea93cfe3bd05?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjB5b3JrJTIwdW5zZWFsZWR8ZW58MHx8fHwxNzUyODY0MzA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "The US Attorney for the Southern District of New York unsealed an indictment against Christine Hunsicker, charging her with wire fraud, securities fraud, money laundering, aggravated identity theft, and lying to financial institutions.",
    "full_text": "In Brief Christine Hunsicker, founder of the fashion startup CaaStle, turned herself in to authorities Friday to face fraud charges, authorities confirmed to Bloomberg. The U.S. Attorney for the Southern District of New York unsealed an indictment against her, charging her with wire fraud, securities fraud, money laundering, aggravated identity theft, and lying to financial institutions. She is accused of defrauding her investors out of more than $300 million. Hunsicker resigned as CEO of CaaStle after her board alleged that she misled investors about the company’s financial performance. The company raised more than $500 million in funding and filed for bankruptcy in June. In addition to the SEC’s case, an apparel company and an investment vehicle launched by CaaStle are also suing the company over financial matters. Two former employees told TechCrunch they weren’t surprised to hear the company faced financial troubles due to how discreet executives were about the company’s financial health."
  },
  {
    "title": "SpaceX worker injury rates at Starbase outpace industry rivals",
    "slug": "spacex-worker-injury-rates-at-starbase-outpace-industry-rivals",
    "link": "https://techcrunch.com/2025/07/18/spacex-worker-injury-rates-at-starbase-outpace-industry-rivals/",
    "published": "2025-07-18 16:29",
    "image": "https://images.unsplash.com/photo-1635294085591-f9c79d77c6db?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx3b3JrZXIlMjBpbmp1cnklMjByYXRlc3xlbnwwfHx8fDE3NTI4NjI1MDR8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "SpaceX has been moving at a breakneck pace, and rapid progress comes at a cost. Worker injury rates at its Starbase facility are almost 6x higher than the average, data reveals.",
    "full_text": "Starbase is home to SpaceX’s most ambitious program: a fully reusable, ultra-heavy-lift rocket called Starship. Since Starship’s first orbital test in April 2023, SpaceX has attempted eight additional integrated flights. It doesn’t distinguish between minor injuries like stitches versus serious incidents such as amputations. They’re here to deliver the insights that fuel startup growth and sharpen your edge. They’re here to deliver the insights that fuel startup growth and sharpen your edge. The injury rate in this sector has fallen dramatically since 1994, dropping from 4.2 injuries per 100 workers to 0.7 injuries per 100 workers in 2023, according to historical data from the Bureau of Labor Statistics. (BLS calculates these rates through its annual company surveys, which asks for the same information found in OSHA’s worker injury forms.) These other facilities report lower TRIR rates, though most still exceed the industry averages. A recent paper on TRIR questioned its statistical validity and advocated that organizations use alternative measures of safety performance instead. But it still leads among SpaceX’s land-based facilities and is second overall only to its West Coast booster recovery operations, which has a TRIR of 7.6."
  },
  {
    "title": "DuckDuckGo now lets you hide AI-generated images in search results",
    "slug": "duckduckgo-now-lets-you-hide-ai-generated-images-in-search-results",
    "link": "https://techcrunch.com/2025/07/18/duckduckgo-now-lets-you-hide-ai-generated-images-in-search-results/",
    "published": "2025-07-18 16:23",
    "image": "https://images.unsplash.com/photo-1533228100845-08145b01de14?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxuZXclMjBzZWFyY2glMjBmZWF0dXJlJTIwY29tZXN8ZW58MHx8fHwxNzUyODU2MjA1fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "DuckDuckGo's new search feature comes as the internet is being flooded with AI-generated slop.",
    "full_text": "Privacy-focused browser DuckDuckGo is rolling out a new setting that lets users filter out AI images in search results. The company says it’s launching the feature in response to feedback from users who said AI images can get in the way of finding what they’re looking for. Users can access the new setting by conducting a search on DuckDuckGo and heading to the Images tab. From there, they will see a new drop-down menu titled “AI images.” Users can then choose whether they want to see AI content by selecting “show” or “hide.” Users can also turn on the filter in their search settings by tapping the “Hide AI-Generated Images” option. DuckDuckGo’s new feature comes as the internet is being flooded with AI slop, which refers to low-quality media content made using generative AI technology. “The filter relies on manually curated open-source blocklists, including the ‘nuclear’ list, provided by uBlockOrigin and uBlacklist Huge AI Blocklist,” DuckDuckGo said in a post on X. “While it won’t catch 100% of AI-generated results, it will greatly reduce the number of AI-generated images you see.” DuckDuckGo says it plans on adding additional filters in the future, but didn’t provide specifics. It’s worth noting that DuckDuckGo’s example for the new feature depicts an image search for a baby peacock, likely in reference to Google facing controversy last year for showing more AI-generated images of baby peacocks rather than real-life images when conducting an image search for the bird."
  },
  {
    "title": "With her app Smash, Kesha can be whoever she wants — even a tech CEO",
    "slug": "with-her-app-smash-kesha-can-be-whoever-she-wants-even-a-tech-ceo",
    "link": "https://techcrunch.com/2025/07/18/with-her-app-smash-kesha-can-be-whoever-she-wants-even-a-tech-ceo/",
    "published": "2025-07-18 16:00",
    "image": "https://images.unsplash.com/photo-1681505526188-b05e68c77582?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxmcmllbmRseSUyMGNvbnRyYWN0cyUyMGFtb25nJTIwY29sbGFib3JhdG9yc3xlbnwwfHx8fDE3NTI4NjI1MDZ8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Kesha is building an app called Smash, which is a way for musicians to find one another, make music together, and establish clear, artist-friendly contracts among collaborators.",
    "full_text": "She didn’t let people dismiss her as a one-dimensional, glitter-clad party girl. Smash would fund itself by taking a small cut of payments made through the app. He immediately countersued her for defamation, sparking a high-profile legal battle and reckoning with the dark side of pop music. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “It’s always just been in my value system that artists need to be supported.” Kesha even announced the app as part of Rasmussen’s Panathēnea festival in Greece. “I regained the rights to my voice back for the first time in my adult life about one year ago, as a 37-year-old woman,” Kesha said at Panathēnea."
  },
  {
    "title": "Meta refuses to sign EU’s AI code of practice",
    "slug": "meta-refuses-to-sign-eus-ai-code-of-practice",
    "link": "https://techcrunch.com/2025/07/18/meta-refuses-to-sign-eus-ai-code-of-practice/",
    "published": "2025-07-18 13:52",
    "image": "https://images.unsplash.com/photo-1751356424643-c88ba7931b96?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx0aHJvdHRsZSUyMGFpJTIwZGV2ZWxvcG1lbnR8ZW58MHx8fHwxNzUyODgwNTA2fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Meta will not sign the EU's new rules, calling the implementation \"overreach\" and claiming it will throttle AI development.",
    "full_text": "Meta has refused to sign the European Union’s code of practice for its AI Act, weeks before the bloc’s rules for providers of general-purpose AI models take effect. “Europe is heading down the wrong path on AI,” wrote Meta’s chief global affairs officer Joel Kaplan in a post on LinkedIn. “We have carefully reviewed the European Commission’s Code of Practice for general-purpose AI (GPAI) models and Meta won’t be signing it. This Code introduces a number of legal uncertainties for model developers, as well as measures which go far beyond the scope of the AI Act.” The EU’s code of practice — a voluntary framework published earlier this month — aims to help companies implement processes and systems to comply with the bloc’s legislation for regulating AI. Among other things, the code requires companies to provide and regularly update documentation about their AI tools and services and bans developers from training AI on pirated content; companies must also comply with content owners’ requests to not use their works in their datasets. A risk-based regulation for applications of artificial intelligence, the AI Act bans some “unacceptable risk” use cases outright, such as cognitive behavioral manipulation or social scoring. But the Commission has held firm, saying it will not change its timeline. Also on Friday, the EU published guidelines for providers of AI models ahead of rules that will go into effect on August 2. Companies that have such models on the market before August 2 will have to comply with the legislation by August 2, 2027."
  },
  {
    "title": "Netflix starts using GenAI in its shows and films",
    "slug": "netflix-starts-using-genai-in-its-shows-and-films",
    "link": "https://techcrunch.com/2025/07/18/netflix-starts-using-genai-in-its-shows-and-films/",
    "published": "2025-07-18 12:21",
    "image": "https://images.unsplash.com/photo-1752522541433-a90d632f962b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx1c2VkJTIwZ2VuZXJhdGl2ZSUyMGFpfGVufDB8fHx8MTc1Mjg4MDUwN3ww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Netflix said it used generative AI for the first time for a scene in an Argentinean show called \"El Eternauta.\"",
    "full_text": "Companies developing video AI models and tools often talk about working with Hollywood studios to make certain workflows possible. On Thursday, Netflix said that it has started using AI in movies and shows it produces. Speaking at the company’s post-results conference call, co-CEO Ted Sarandos said that the platform had “the very first GenAI final footage to appear on screen” in an Argentine show called “El Eternauta” (“The Eternaut”). He noted that Netflix’s internal production group teamed up with producers to use AI to create a scene of a building collapsing. Sarandos said that using AI, the scene was finished 10x faster than it would have with traditional visual effect tools, and that it cost less. “We remain convinced that AI represents an incredible opportunity to help creators make films and series better, not just cheaper. Our creators are already seeing the benefits in production through pre-visualization and shot-planning work, and certainly visual effects. It used to be that only big-budget projects would have access to advanced visual effects like de-aging,” he said during the call. Co-CEO Greg Peters said Netflix is using generative AI in other areas as well, including personalization and search and ads, and the company aims to roll out interactive ads in the second half of this year. Earlier this year, the company introduced AI-powered search."
  },
  {
    "title": "ChatGPT: Everything you need to know about the AI-powered chatbot",
    "slug": "chatgpt-everything-you-need-to-know-about-the-ai-powered-chatbot",
    "link": "https://techcrunch.com/2025/07/18/chatgpt-everything-to-know-about-the-ai-chatbot/",
    "published": "2025-07-18 10:03",
    "image": "https://images.unsplash.com/photo-1676573408178-a5f280c3a320?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjaGF0Z3B0JTIwcHJvZHVjdCUyMHVwZGF0ZXN8ZW58MHx8fHwxNzUyODUxNzA0fDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "A timeline of ChatGPT product updates and releases, starting with the latest, which we’ve been updating throughout the year.",
    "full_text": "Some ChatGPT users have noticed a new feature called “Study Together” appearing in their list of available tools. OpenAI has started using Google’s AI chips to power ChatGPT and other products, as reported by Reuters. Sam Altman, the CEO of OpenAI, said during a recent AI event hosted by VC firm Sequoia that he wants ChatGPT to record and remember every detail of a person’s life when one attendee asked about how ChatGPT can become more personalized. It will help organizations in Asia meet their local data sovereignty requirements when using OpenAI’s products. OpenAI said on Tuesday that it might revise its safety standards if “another frontier AI developer releases a high-risk system without comparable safeguards.” The move shows how commercial AI developers face more pressure to rapidly implement models due to the increased competition. OpenAI wants to incorporate Anthropic’s Model Context Protocol (MCP) into all of its products, including the ChatGPT desktop app. Reliance has proposed selling OpenAI’s models to businesses in India through an application programming interface (API) so they can incorporate AI into their operations. we trained a new model that is good at creative writing (not sure yet how/when it will get released). It’s unclear when these agentic tools might launch or which customers will be eligible to buy them. OpenAI says the “agent” is intended for instances where you don’t just want a quick answer or summary, but instead need to assiduously consider information from multiple websites and other sources."
  },
  {
    "title": "Perplexity sees India as a shortcut in its race against OpenAI",
    "slug": "perplexity-sees-india-as-a-shortcut-in-its-race-against-openai",
    "link": "https://techcrunch.com/2025/07/17/perplexity-sees-india-as-a-shortcut-in-its-race-against-openai/",
    "published": "2025-07-18 04:29",
    "image": "https://images.unsplash.com/photo-1688909906484-738d78601884?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxxdWlldGx5JTIwZXhwYW5kaW5nfGVufDB8fHx8MTc1MjkzMTgwOHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Perplexity is quietly expanding into India to compete with OpenAI in the next phase of AI adoption.",
    "full_text": "The growth trend extended to active users as well: Perplexity’s monthly active users (MAUs) in India increased by 640% year-over-year in Q2, while ChatGPT’s MAUs grew by 350%. Perplexity CEO Aravind Srinivas has also taken direct steps to expand in India. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. At the same time, the country has a large and active base of tech-savvy users — a fact that has even prompted Perplexity’s archrival Google to launch AI-powered search features like AI Mode and AI Overviews in India ahead of many other markets. Perplexity still lags far behind ChatGPT globally in terms of revenue, even as both offer the same $20-per-month starting price. The revenue challenge is particularly acute in India, where consumers are notoriously price-sensitive. Strategic partnerships in markets like India could help Perplexity catch the eye of investors who value user growth and geographic diversification."
  },
  {
    "title": "‘Utopian’ city California Forever announces huge tech manufacturing park",
    "slug": "utopian-city-california-forever-announces-huge-tech-manufacturing-park",
    "link": "https://techcrunch.com/2025/07/17/utopian-city-california-forever-announces-huge-tech-manufacturing-park/",
    "published": "2025-07-17 22:44",
    "image": "https://images.unsplash.com/photo-1703379715279-c20f53d91c91?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxob3N0JTIwNDAlMjBtaWxsaW9uJTIwc3F1YXJlJTIwZmVldHxlbnwwfHx8fDE3NTI4ODg2MDl8MA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Solano Foundry is a 2,100-acre manufacturing park that can host 40 million square feet of advanced tech manufacturing space.",
    "full_text": "In Brief California Forever announced on Thursday plans to build a massive manufacturing park called Solano Foundry, the newest addition to its master-planned “utopian” city backed by a group of Silicon Valley billionaires. Solano Foundry is 2,100 acres that can host 40 million square feet of advanced tech manufacturing space. The manufacturing park will be built as part of its planned walkable city with over 175,000 homes, CEO Jan Sramek said at the Reindustrialize conference in Detroit. Sramek tweeted that U.S. manufacturers can’t win by “building factories off of random freeway exits in the middle of nowhere. The best people don’t want to work there.” This site will offer expedited permitting, transportation for finished goods, and plenty of power from renewable energy, he said. The hope is that it will attract hardware, engineering, and AI talent from relatively nearby Silicon Valley. Solano County is about 40 miles northeast of San Francisco."
  },
  {
    "title": "Anthropic tightens usage limits for Claude Code — without telling users",
    "slug": "anthropic-tightens-usage-limits-for-claude-code-without-telling-users",
    "link": "https://techcrunch.com/2025/07/17/anthropic-tightens-usage-limits-for-claude-code-without-telling-users/",
    "published": "2025-07-17 21:04",
    "image": "https://images.unsplash.com/photo-1725379447707-0a0386c7dbc8?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHx1bmV4cGVjdGVkbHklMjByZXN0cmljdGl2ZSUyMHVzYWdlJTIwbGltaXRzfGVufDB8fHx8MTc1MjkwODQwOXww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Claude Code users have been hit with unexpectedly restrictive usage limits. The problems, many of which have been aired on Claude Code’s GitHub page, seem to be concentrated among heavy users of the service, many of whom are on the $200-a-month Max plan.",
    "full_text": "Since Monday morning, Claude Code users have been hit with unexpectedly restrictive usage limits. “Your tracking of usage limits has changed and is no longer accurate,” one user complained. When reached for comment, an Anthropic representative confirmed the issues but declined to elaborate further. But Anthropic says the free user limit “will vary by demand” and does not set an absolute value. The result leaves users unable to plan around usage limits, since they have no clear idea of when their service will be restricted. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. “The lack of communication just causes people to lose confidence in them.”"
  },
  {
    "title": "Microsoft is buying tons of carbon removal from Xprize startup Vaulted Deep",
    "slug": "microsoft-is-buying-tons-of-carbon-removal-from-xprize-startup-vaulted-deep",
    "link": "https://techcrunch.com/2025/07/17/microsoft-is-buying-tons-of-carbon-removal-from-xprize-startup-vaulted-deep/",
    "published": "2025-07-17 19:03",
    "image": "https://images.unsplash.com/photo-1641945512297-538a81b13f85?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHwyMDMwJTIwY2FyYm9uJTIwbmVnYXRpdmUlMjBwbGVkZ2V8ZW58MHx8fHwxNzUyOTA4NDEwfDA&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Microsoft's data center boom has been imperiling its 2030 carbon negative pledge, so the tech giant is turning to Vaulted Deep, which operates like a reverse oil company.",
    "full_text": "Microsoft is building data centers as fast as it can, and that’s killing its carbon balance sheet. Since 2020, its carbon emissions have grown by nearly a quarter, undermining the pledge it made that year to remove more carbon from the atmosphere than it generates by 2030. So Microsoft has been buying massive amounts of carbon-removal credits to attempt to remedy that situation, including a newly announced purchase of 4.9 million metric tons from Vaulted Deep. It will last 12 years through 2038. Vaulted Deep operates like a reverse oil company. It collects solid waste — like treated sewage, excess manure, or paper sludge — that would otherwise be headed for a landfill or incinerator, blends it into a slurry, and injects it into porous rocks deep underground. So far, Vaulted Deep has removed over 18,000 metric tons of carbon dioxide. Recently, Microsoft has been stuck between a rock and a hard place to make good on its imperiled carbon pledge. While the tech company has been investing heavily in renewable power — avoiding emissions is considered the appropriate first step — there are some things it must use, like semiconductors, for which there are no zero-greenhouse-gas alternatives. Among them are a 7 million metric ton deal with Chestnut Carbon to reforest 60,000 acres in the southeastern U.S. and another for 3.7 million metric tons with CO280 to capture carbon from paper mill operations along the Gulf Coast."
  },
  {
    "title": "Hadrian raises $260M to build out automated factories for space and defense parts",
    "slug": "hadrian-raises-260m-to-build-out-automated-factories-for-space-and-defense-parts",
    "link": "https://techcrunch.com/2025/07/17/hadrian-raises-260m-to-build-out-automated-factories-for-space-and-defense-parts/",
    "published": "2025-07-17 18:16",
    "image": "https://images.unsplash.com/photo-1677933421705-b037e6f2a184?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxyZXZvbHV0aW9uaXplJTIwYW1lcmljYW4lMjBtYW51ZmFjdHVyaW5nfGVufDB8fHx8MTc1MjkwMzkxMHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Hadrian wants to revolutionize American manufacturing through automation.",
    "full_text": "It’s a huge change to the status quo: a manufacturing industry that’s largely populated by dozens of small machining shops run by an aging workforce. Hadrian’s first target was high-precision CNC machining, a manufacturing process that makes parts to extremely tight tolerances — often measured in the microns, not millimeters (a single human hair is anywhere from 50 to 120 microns in thickness). (He did not immediately respond to TechCrunch’s request for comment on the new round.) Hadrian’s business model is not just selling parts, but also a “factories as a service” model that will see dedicated facilities for customers that want to ensure committed factory capacity. Speaking at the Reindustrialization Summit on Wednesday, Power argued that reshoring domestic production is nothing less than existential: “This country is heading into a generational fight,” he said. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. The company has now raised nearly $500 million since it was founded in 2020."
  },
  {
    "title": "After raising over $3M, popular VC-backed beauty brand Ami Colé is shuttering",
    "slug": "after-raising-over-3m-popular-vc-backed-beauty-brand-ami-cole-is-shuttering",
    "link": "https://techcrunch.com/2025/07/17/after-raising-over-3m-popular-vc-backed-beauty-brand-ami-cole-is-shuttering/",
    "published": "2025-07-17 17:59",
    "image": "https://images.unsplash.com/photo-1599408444232-8947844d94e2?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjMyMjh8MHwxfHNlYXJjaHwxfHxjb25zdW1lciUyMHJldGFpbCUyMGJ1c2luZXNzfGVufDB8fHx8MTc1MjkwNTcxMHww&ixlib=rb-4.1.0&q=80&w=400",
    "summary": "Diarrha N'Diaye-Mbaye, one of the first among the small number of Black women to raise more than $1 million in venture capital, hinted that one of the problems was tension between her and investors' expectations of a consumer retail business.",
    "full_text": "But the 4-year-old company will now officially shutter in September. Ami Colé did not immediately respond to our request for comment. Like many Black startups launched after the murder of George Floyd, Ami Colé rode the waves of excitement from investors and corporations looking to pour money into backing more products and initiatives that touched upon diversity, equity, and inclusion. While she had loyal customers, her fast nationwide growth meant pressure from investors. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise. The strain comes as venture funding to Black founders has hit a multi-year low in a political climate that has disavowed anything perceived as DEI. “I still believe in beauty — at every level — and I’m looking forward to discovering what comes next,” she said."
  }
]